{
        "code":  "03-140",
        "name":  "Ecology and Environmental Science",
        "short_name":  "ECO \u0026 ENVRNMNTL SCI",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Environmental science is a highly interdisciplinary field that integrates knowledge and modes of inquiry from across the sciences to understand some of the most important challenges of the 21st century. This course provides a foundational background in scientific method, critical thinking and problem solving strategies used to study and evaluate the environment. Modules include principles of ecology and ecosystems, biological diversity, biogeochemical cycles, endangered species management, human population growth, atmosphere, climate and global warming. Assessment will include class attendance, quizzes, individual and small group projects, in class exams. Projects may involve visits to local sites.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The main goal of this course is to provide a strong foundation for examining, analyzing, and addressing current environmental challenges. At the completion of this course, students will be able to 1 Discuss the diversity of life and the biological processes that link them together. 2 Identify constraints imposed on living organisms by the physical environment, both aquatic and terrestrial, and describe how these function as agents of change through the process of natural selection. 3 Examine plant diversity and explain the processes of photosynthesis, nutrient uptake, Big and adaptation to the environment. 4 Examine animal diversity and explain how structure and function regulate bioenergetic, physiological, and behavioral processes and adaptation to the environment. 5 Explain how characteristics expressed at the level of the individual organisms ultimately determine the collective dynamics of the population. 6 Describe the experimental strategies that ecologists use to study the natural world. This includes both explaining the basic scientific method the formulation and experimental testing of hypotheses and an explaining the application of experimental techniques. 7 Analyze primary sources by interpreting figures and tables, describing their core findings, identifying limitations, proposing future lines of investigation, and discussing the findings in a broader social context. 8 Discuss the role that humans play in affecting characteristics of the environment.",
                                                    "key_topics":  "(1) Overview: Major ideas in Ecology and Environmental Science. (2) Climate. (3) The Aquatic Environment. (4) The Terrestrial Environment. (5) Adaptation and Natural Selection. (6) Plant Adaptation to the Environment. (7) Animal Adaptation to the Environment. (8) Properties of Populations. (9) Population Growth. (10) Life History Traits. (11) Intraspecific Population Regulation. (12) The Ecology of Climate Change. (13) Reading and discussion of recent research in selected topics (4 interspersed sessions).",
                                                    "prerequisite_knowledge":  "No prerequisite knowledge is required.",
                                                    "assessment_structure":  "Discussion of current research topics (4 sessions: 10%). Quizzes (8: 10%). Homework (4: 10%). Group presentation (15%). In-class exams (3: 30%). Final exam (20%). Participation and professionalism (5%).",
                                                    "relevance":  "Biodiversity, Sustainability, Climate Change",
                                                    "learning_resources":  "Textbook and additional readings will be required and will be posted on Canvas.",
                                                    "extra_time_commitment":  null
                                            }
}