{
        "code":  "03-113",
        "name":  "Biologies in Text and Film",
        "short_name":  "BIOLOGIES TEXT/FILM",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The course enables students to interpret and apply scientific findings meaningfully by enhancing their critical thinking and analytical skills through the examination of how science is represented in media. In their personal lives, students become more discerning consumers of scientific information. learning to differentiate between accurate scientific facts and speculative fiction. Professionally, the course equips students with the ability to communicate complex scientific concepts to diverse audiences and to apply scientific reasoning to problemsolving in various fields. Civically, the course fosters an understanding of the societal and ethical implications of scientific advancements, empowering students to engage in informed public discussions to make thoughtful decisions on sciencerelated issues.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The course enables students to interpret and apply scientific findings meaningfully by enhancing their critical thinking and analytical skills through the examination of how science is represented in media. In their personal lives, students become more discerning consumers of scientific information. learning to differentiate between accurate scientific facts and speculative fiction. Professionally, the course equips students with the ability to communicate complex scientific concepts to diverse audiences and to apply scientific reasoning to problemsolving in various fields. Civically, the course fosters an understanding of the societal and ethical implications of scientific advancements, empowering students to engage in informed public discussions to make thoughtful decisions on sciencerelated issues.",
                                                    "key_topics":  "Biology, science fiction, ecology, theory",
                                                    "prerequisite_knowledge":  "Success in this course does not require a prior background in Biology or movies",
                                                    "assessment_structure":  "The following assessments will determine the student grades: - Participation (15%) - Low Stake assessments: Exit Tickets (15%) - Exploratory Paper (10%) - Medium Stake assessments: Problem Sets (25%) - Final Project (35%) Low-Stake Assignments: Through incremental practice, the course will emphasize knowledge of biological practices (e.g. problem sets), theory of representation (e.g. study questions), and facilitate student engagement with text and film (e.g. any in-class prompts not contained in the journal). Medium-stakes assignments: Weekly tasks aimed at applying each unit\u0027s skills and theory necessary for potential projects or for course project milestones. Each week will end with a group initiative that allows students to practice collaborative research. These weekly unit assessments will serve as white space for project creation and sharing of ideas (e.g. journal prompts). High-stake assignments: Final capstone project. This portfolio project contains both cumulative items from the semester, as well as a final contributory component that may take various forms, including a research paper. Given the novelty of these projects, they have the potential to be disseminated in various ways (e.g. undergraduate research publication or Meeting of the Minds posters).",
                                                    "relevance":  "Students will think reflectively about science as a process by engaging them in the analysis of how scientific knowledge and methodologies are represented in films and texts",
                                                    "learning_resources":  "movies and Text",
                                                    "extra_time_commitment":  null
                                            }
}