{
        "code":  "03-128",
        "name":  "Biology for Life Special Topics",
        "short_name":  "BIOLOGY FOR LIFE",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Special Topics in Biological Sciences. Topics will vary depending on the semester and instructor.  Courses offered under this course number will not require prior knowledge of or exposure to biological sciences and are open to students from any major and class year.  Please read individual section descriptions for more information. Summer 1All 2024 Tropical Ecology at Monteverde Institute. This is a course offered through a study abroad program to Costa Rica. Students will be addressing general questions about tropical ecosystems such as What are tropical forests What makes them different than other forests Where are they and why do global climate patterns result in their geographic distribution What are the different kinds of tropical forests What controls the diversity, phenology and successional processes of tropical forests What are tropical marine ecosystems This course will also cover specific ecological interactions between organisms such as seed dispersal, pollination, herbivory, mutualisms, preypredator interactions in the tropics. Students will also learn about humans in the tropics, both those groups that have evolved and adapted to these environments and the current threats imposed by localglobal economic systems. As a part of this course, students will participate in field work and use nature as a laboratory to study the diversity of life forms and interactions between plants, animals, and microorganisms and with the physical environment.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://www.cmu.edu/bio/undergrad/academics/intro_courses.html",
        "custom_fields":  {
                                                    "goals":  "Variable. See individual section instructor for additional information.",
                                                    "key_topics":  "Variable. See individual section instructor for additional information.",
                                                    "prerequisite_knowledge":  "No prerequisite knowledge is required.",
                                                    "assessment_structure":  "Variable. See individual section instructor for additional information.",
                                                    "relevance":  "Variable. See individual section instructor for additional information.",
                                                    "learning_resources":  "Variable. See individual section instructor for additional information.",
                                                    "extra_time_commitment":  "Variable. See individual section instructor for additional information."
                                            }
}