{
        "code":  "03-118",
        "name":  "Beer: A Yeast\u0027s Perspective",
        "short_name":  "BEER: YEAST PERSPECT",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This is a combined lecture and laboratory course in which students will investigate the biochemistry of fermentation using strains of yeast commonly used in brewing science. Lectures and readings will cover all necessary information to succeed in the course, including topics like yeast metabolism, fermentation at the micro and industrial levels, and a history of fermentations influence on society. Lab experiments will investigate yeast growth and fermentation processes in various strains used in brewing, and quantitative assessments of beer at the molecular level. The course puts a focus on microbiology lab techniques and yeast biochemistry however, no previous lab experience or biology coursework is required, and anyone with an interest in the science behind brewing yeast can succeed in the class.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "This course intends to expose, excite, and familiarize majors and nonmajors with microbiology research through the lens of brewing science. Students will learn about yeast biochemistry, the history of fermentation, the biochemistry of the process, industrial applications from brewing to biofuels, of the extensive scientific research in fermentation, and discuss the business of fermentation with local craft brewers. Students will also develop analytical and critical thinking skills by completing laboratory experiments investigating ways to manipulate yeast growth and metabolism, and quantitatively assess beer samples. The lab component will expose students to the scientific method, basic procedures in microbiology, and analyzing and interpreting data. Students will work with partners to critically analyze the growth, metabolism, and other characteristics of a yeast strain used in brewing. The semester will culminate in the students sharing their experimental results from multiple experiments in presentations to their peers. Students will gain insight into the impact of biology research on their daytoday lives, gain research skills, develop their analytical skills, and develop their oral and written communication skills.",
                                                    "key_topics":  "History of fermentation, beer brewing, yeast metabolism, effect of yeast on beer styles, industrial fermentation, basic lab techniques, laboratory testing of beer during brewing process.",
                                                    "prerequisite_knowledge":  "There are no prerequisites such that any student with an interest in biology, and more specifically the biochemistry of fermentation, can take the course.",
                                                    "assessment_structure":  "Laboratory notebooks, data analysis assignments, attendance, quizzes, lab benchwork, and final presentations.",
                                                    "relevance":  "Biology has the potential to be one of the most relatable sciences, yet many people do not recognize the impact of biological research on their daily lives outside of medicine. The growing popularity of craft beers and home brewing provide a unique opportunity to engage a diverse population of students from across the university in microbiology topics and experimentation. Beer: A Yeast\u0027s Perspective is a combined lecture and lab course in fermentation biochemistry that would expose students to practical wet work in the lab, experimental design and analysis, and brewing science. The course is specifically designed to appeal to students from all colleges - from biochemist to business major.",
                                                    "learning_resources":  "Students will be required to read selected portions of the provided lab manual and from selected peer-reviewed literature.",
                                                    "extra_time_commitment":  null
                                            }
}