{
        "code":  "03-133",
        "name":  "Neurobiology of Disease",
        "short_name":  "NEURO OF DISEASE",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will explore the biological basis of several neurological and neuropsychiatric diseases, with an emphasis on medical diagnostic tools and techniques. It will include discussions of the anatomical basis of neurological diseases as well as recent research into understanding the mechanisms of disease. This course is intended to broaden students understanding of how diseases are diagnosed and studied.  Students will also learn how basic neurological and psychiatric evaluations are conducted.  We will discuss neurobiological research to serve as a basis for understanding brain structures and functional alterations in a variety of developmental, degenerative, neurological, and psychiatric disorders.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "http://www.cmu.edu/bio/undergrad/courses/index.html",
        "custom_fields":  {
                                                    "goals":  "Upon successful completion of the course, students should be able to1Describe the basic mechanisms of cellular neuroscience including action potentials, excitation, inhibition, neuromodulation, and other cellular processesaExplain the sequence of events in an action potential and relate this to diseases such as demyelinating diseasesbExplain the processes involved in release and reuptake of neuro transmitter and relate this tocCompare postsynaptic changes in neurotransmitter responses to presynaptic changes and discuss qualitative and quantitative methods to differentiate between presynaptic and postsynaptic changes2Understand the genetic and environmental causes of diseasesaDesign and evaluate experimental tests to assess whether diseases share common genetic mechanismsbUsing demographic and epidemiological data to qualitatively and quantitatively describe the genetic vs. environmental components of a disease3Describe the symptoms of the neuropsychiatric diseases studiedaDiscuss the relationship between symptoms and personal experiences of patients of these diseases4Explain what is known about the cellular and circuit basis of diseases of the nervous systemaFor each disease in the class, relate the symptoms of the disease to the known aspects of the biological basis5Think critically and creatively about ways to advance knowledge in the study of the neurobiology of diseasesaExplicitly relate experimental design, results, and interpretations in the context of diseases of the nervous systembIdentify and explain the experimental challenges associated with current gaps in knowledge of the biological basis of diseases studiedcPropose hypotheses about plausible biological mechanisms for novel diseasesdApply experimental techniques learned in the context of one disease to design experiments to test questions related to another disease given a hypothesis, prop",
                                                    "key_topics":  "Research into neuropsychiatric disorders, ADHD, OCD, Alzheimer\u0027s, Schizophrenia, Depression, Bipolar Disorder",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "quizzes, exams, homework, in-class activities, 3 scientific publication reports, reading an autobiography and writing a short report on it",
                                                    "relevance":  "Mental illness is rising around the world and creating a growing burden on society. In this class, students from any background will begin to explore the biology of mental disease and what is known and not known. We will discuss how to bridge the gaps between our current knowledge and what is needed to help better manage mental health.",
                                                    "learning_resources":  "Textbook, supplemental videos",
                                                    "extra_time_commitment":  "Students are expected to meet with the professor at least 3 times during the semester outside of normal class time to discuss the 3 scientific publication reports"
                                            }
}