{
        "code":  "03-210",
        "name":  "Independent Study",
        "short_name":  "INDEPENDENT STUDY",
        "units":  1.0,
        "min_units":  1.0,
        "max_units":  11.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Students will read papers from the original literature under the direction of a faculty member. Students will be required to demonstrate mastery of the readings by discussions with the sponsoring faculty member, oral presentations, or writing of one or more papers summarizing and extending the information in the readings. If appropriate, students may write a programs to satisfy this last requirement. A student may take this course only once.  This is a mini format course.  Special permission required.  Students MUST complete the application form in order to participate  register. Students MUST review the requirements and deadlines in full located at httpswww.cmu.edubioresearchugrrfc.html prior to applying. The application link will be published on the website on the first day of class each semester. Forms must be received by the posted deadline.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Varies by experience",
                                                    "key_topics":  "Varies by advisor and project",
                                                    "prerequisite_knowledge":  "Varies by project",
                                                    "assessment_structure":  "per Advisor",
                                                    "relevance":  "Supervised undergraduate experience for academic credit",
                                                    "learning_resources":  "per Advisor; Additionally the Biological Sciences Office requires 1.5-2 page summary as outlined in the Independent Study form that is updated each semester",
                                                    "extra_time_commitment":  "each unit is equivalent to 2 hours of research/work per session.\nFor example, 10 total units for the Semester = 5 units per Mini = 10 hours research/work per week"
                                            }
}