{
        "code":  "03-380",
        "name":  "Virology",
        "short_name":  "VIROLOGY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(03-240 [] at least D) or (03-320 [] at least D)"
                                },
        "co_reqs":  [
                                        {
                                                "code":  "03-220",
                                                "id":  466,
                                                "name":  "Genetics",
                                                "units":  9.0
                                        }
                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The concepts and methods of virology are covered, with emphasis on animal viruses, within the framework of cell biology, genetics, molecular biology, immunology, pathology, and epidemiology. The strategies that a wide variety of different DNA and RNA viruses, including some new and emerging ones, use to replicate and express their genomes  during infection of host cells will be examined in some detail. The effects that viruses inflict on these cells will also be examined, as will some of the host cell responses generated by such viruscell interactions, including interferon induction, the antiviral response generated by interferon, and oncogenic transformation. In addition, anoverview of procedures used for prevention and treatment of viral diseases via vaccinesand antiviral drugs, respectively, will be presented, as will a brief discussion of viroids and prions, and the characteristics of these agents which distinguish them from viruses.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "At the end of the course, students should be able to 1.Recognize and compare the various classes of animal viruses2.Conceptually describe and analyze the steps required for viral replication3.Articulate the complexities of the structure of viral genomes and virions4.Understand the hosts mechanism of defense against viral infection and describe viral antagonisms to these defenses5.Articulate the basic features of viral pathogenesis6.Discuss antiviral technologies from vaccines to antiviral drugsRead primary research articles in the field of virology and apply critical thinking for analysis of these articles",
                                                    "key_topics":  "Viral classification, viral replication cycle, virus-host interaction, viral pathogenesis, vaccination and treatment",
                                                    "prerequisite_knowledge":  "Solid understanding of basic concepts in Cell Biology",
                                                    "assessment_structure":  "Attendance and in class discussions, homework, quizzes, midterms, final project",
                                                    "relevance":  "Students gain an in-depth knowledge on the way viruses that impact our daily lives replicate and cause disease, with better understanding of preventive and therapeutic measures",
                                                    "learning_resources":  "Lecture slides, and textbook: Principles of Virology, 5th Edition. ISBN-13: 978-1683670322",
                                                    "extra_time_commitment":  "a. reading research articles and writing summaries.\nb. Researching one virus and preparing a poster presentation as well as public health awareness pamphlet on it."
                                            }
}