{
        "code":  "03-342",
        "name":  "Introduction to Biological Laboratory Practices",
        "short_name":  "INTRO BIO LAB PRACTC",
        "units":  1.0,
        "min_units":  1.0,
        "max_units":  1.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [
                                        {
                                                "code":  "03-343",
                                                "id":  1963,
                                                "name":  "Experimental Techniques in Molecular Biology",
                                                "units":  12.0
                                        }
                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is designed for students in the BSA degree program. It is designed to be an introduction to basic laboratory practices.   The course will introduce biological and chemical safety training and basic laboratory practices.  Techniques of solution preparation and titration, pipetting, UVVIS spectroscopy, and quantitation of biological compounds will be covered.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will learn1 Introduction to basic lab practices and safety procedures.2To apply your knowledge from your prior biology courses in order to implement and interpret techniques in genetics and molecular biology.3To Assess and describe how each step in an experiment contributes to the outcome.4To Analyze and interpret data and recognize trends and relationships through graphical and statistical representations.5To Propose legitimate experimental designs to address a hypothesis.6To be able to collect, record, and organize data in lab notebooks, excel spreadsheets, etc.7To be able to read and interpret primary scientific literature through summarization of relevant components and critiquing the final conclusion. 8To be able to clearly articulate and explain experimental results through written reports.",
                                                    "key_topics":  "The course will reinforce laboratory practices, including Basic Microbiology, Yeast Genetics , DNA Isolation and Analysis , PCR and Sequencing. It is a supplement to 03-343 Experimental Genetics.",
                                                    "prerequisite_knowledge":  "Students should know:\nBasic background in yeast and bacteria as model organisms, as well as basic principles of molecular biology and genetics, including cell structure and function, gene expression and regulation, and mechanisms of inheritance of genetic traits in bacteria and fungi.",
                                                    "assessment_structure":  "Lab work assessment, Group meetings with Instructor, and in-class journal club discussion.",
                                                    "relevance":  "In this course, students will have guided instruction to supplement the 03-343 Experimental Genetics lab class. Students will learn lab safety, biology lab practice, and how to interpret and explain data in lab reports and presentations.",
                                                    "learning_resources":  "Students will be supplied with suggested reading material in addition to the lab manual.",
                                                    "extra_time_commitment":  null
                                            }
}