{
        "code":  "03-351",
        "name":  "Computation and Biology Integrated Research Lab",
        "short_name":  "COMP BIO LAB",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(03-117 [] at least D) or (15-112 [] at least D) or (03-343 [] at least D) or (03-124 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Modern biological research is heavily interdisciplinary in nature requiring the use of a diverse set of experimental techniques and computational analysis.  This course provides students with a modern research experience while training them to communicate and collaborate in an interdisciplinary setting to better prepare them to join the workforce as members of interdisciplinary teams.  This will be accomplished by focusing efforts on a real research problem requiring sophisticated experimentation and computation for success.  Class time will include both laboratory research time wet lab and computational and activities designed to teach and practice communication methods for interdisciplinary teams.  Students are expected to have a strong background in biology or computation and an interest in both.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1. To propose experimental designs and testable hypotheses. 2. To collect and interpret data through graphical, statistical, and computational analysis to address a research goal. 3. To clearly articulate and explain generation and analysis of experimental data through oral presentations. 4. To be able to read, interpret, and apply knowledge from scientific literature to experimental design and data analysis. 5. To be able to identify and explain disciplinespecific topics to peers outside of your primary discipline. 6. To engage in selfreflection to recognize gaps in your knowledge and your efficacy as a team member in a crossdisciplinary research project. 7. To develop strategies for effective team communication through iterative practice and assessment.",
                                                    "key_topics":  "Experimental Design, Scientific Communication, Interdisciplinary Communication, Computational Data Analysis using Bioinformatics Tools and machine learning techniques; Project specific topics for the Fall 2022 semester: Host-Microbiome Interactions, including Microbiology and Molecular Biology Bench Skills, Sanger Sequencing, Comparative Genomics, Automated Microscopy, Machine Learning, active machine learning.",
                                                    "prerequisite_knowledge":  "Previous biology lab experience (03-117 or 03-124 or 03-343) OR previous computational experience (15-112 or equivalent)",
                                                    "assessment_structure":  "Attendance, lab notebook, background presentation, experimental progress reports, self-assessment and reflection activities on communication, peer assessment activities, poster presentation (Rust Belt Microbiome Meeting), final oral data presentation",
                                                    "relevance":  "Modern biological research is heavily interdisciplinary in nature, requiring the use if a diverse set of experimental techniques and computational analysis and bringing together experts from across disciplines. This course will give students training and practice in interdisciplinary communication in the context of a team research project. Students from different backgrounds (biology and computational) will research, design, and carry out a computational biology research project in cross-disciplinary teams. The project for the course will be carefully chosen to require all students to build on their own background knowledge as they work through the lab work and analysis.",
                                                    "learning_resources":  "Laboratory notebook. No formal textbook is required. Course materials, including protocols and research articles, will be provided by the instructors.",
                                                    "extra_time_commitment":  null
                                            }
}