{
        "code":  "03-343",
        "name":  "Experimental Techniques in Molecular Biology",
        "short_name":  "EXP TECHN MOL BIOLGY",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "((03-232 [] at least D) or (03-231 [] at least D)) and ((QC-211 [] at least D) or (09-222 [] at least D) or (09-208 [] at least D) or (09-223 [] at least D))"
                                },
        "co_reqs":  [
                                        {
                                                "code":  "03-220",
                                                "id":  466,
                                                "name":  "Genetics",
                                                "units":  9.0
                                        },
                                        {
                                                "code":  "33-121",
                                                "id":  4982,
                                                "name":  "Physics I for Science Students",
                                                "units":  12.0
                                        },
                                        {
                                                "code":  "03-330",
                                                "id":  6205,
                                                "name":  "Genetics",
                                                "units":  9.0
                                        }
                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This laboratory course is designed to teach experimental methods of modern biology. Experiments in microbial genetics, molecular biology and eukaryotic genetics are performed. Emphasis is placed on understanding and applying the biological principles of each experiment. This course is designed to be taken during the junior year and is intended to prepare students for undergraduate research. Experimentation using living organisms andor their tissues, cells or molecules is an essential component of this course.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "http://www.cmu.edu/bio/undergrad/courses/index.html",
        "custom_fields":  {
                                                    "goals":  "Students will learn how 1 To apply your knowledge from your prior biology courses in order to implement and interpret techniques in genetics and molecular biology.2 To assess and describe how each step in an experiment contributes to the outcome.3 To analyze and interpret data and recognize trends and relationships through graphical and statistical representations.4 To propose legitimate experimental designs to address a hypothesis.5 To be able to collect, record, and organize data in lab notebooks, excel spreadsheets, etc.6 To be able to read and interpret primary scientific literature through summarization of relevant components and critiquing the final conclusion. 7 To be able to clearly articulate and explain experimental results through written reports and oral presentations. 8 To build analytical, problem solving, and data analysis skills in preparation for completing a final studentdriven research project.",
                                                    "key_topics":  "The course will cover:\nBasic Microbiology\nYeast Genetics\nBacteria and Bacteriophage as Experimental Organisms\nDNA Isolation and Analysis including Agarose Gel Electrophoresis\nFractionation of Cells and Recovering and Purifying specific cellular material, separation and analysis\nPCR and Sequencing",
                                                    "prerequisite_knowledge":  "Students should know the basic principles of molecular biology and genetics, including cell structure and function, gene expression and regulation, and mechanisms of inheritance of genetic traits in bacteria and fungi.",
                                                    "assessment_structure":  "3 exams, weekly quizzes, 3 problem sets, 6 lab reports including one team project report, lab work assessment, and required in-class activities",
                                                    "relevance":  "In this course students develop broadly applicable analytical, reasoning, quantitative, and problem solving skills while gaining a working knowledge of core genetics and molecular biology research techniques.",
                                                    "learning_resources":  "Students will be supplied with suggested reading material in addition to the lab manual. Optional multimedia resources are available to students",
                                                    "extra_time_commitment":  "Students are expected to spend 4-6 hours per week outside of class working on material (on weeks with lab reports or exams that is expected to be 7-8 hours outside of class time). Small group activities on lab report writing skills will occur during class time. Optional Lab Report office hours and exam reviews are offered outside of class time. These reviews are scheduled after a class survey on scheduling. Students should ask instructor for syllabus for complete details."
                                            }
}