{
        "code":  "03-346",
        "name":  "Experimental Neuroscience",
        "short_name":  "EXPER NEUROSCIENCE",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "((03-240 [] at least D) or (03-320 [] at least D)) and (03-362 [] at least D) and (03-343 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This laboratory is designed to teach concepts and experimental methods in neurobiology.  Students work with a variety of organisms to study the anatomy, function, and development of the nervous system.  Immunological, molecular, biochemical, and ballistic labeling techniques are used to examine the gene expression and structure in the mature and developing nervous system.  Students study the function of neurons through neurophysiological techniques in invertebrates and computer simulation.  This course makes extensive use of video microscopy and phase contrast, DIC, and fluorescence microscopes.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "You will work independently or in groups to investigate research questions in six different modules. Within each you will research background information, design a hypothesis, plan and carry out experiments, analyze and interpret your data, and propose future directions. You will communicate your results and background information in written reports or seminar presentations. The final research project will be designed and presented as a team in a poster session that hosts all of the undergraduate lab courses.",
                                                    "key_topics":  "Fluorescent proteins, action potential, synaptic function, immunological techniques, neuronal morphology, cell culture",
                                                    "prerequisite_knowledge":  "Core concepts in cellular neuroscience and cell biology; molecular biology techniques.",
                                                    "assessment_structure":  "Grades will be determined by written lab reports, seminar presentations, exams, quizzes, problem sets, attendance, and participation.",
                                                    "relevance":  "This course builds on skills learned in 03-343 to provide a laboratory research experience in the field of neuroscience. Students design projects, collect and analyze data, and present results in written and oral formats.",
                                                    "learning_resources":  "Students will be required to read the provided lab manual and provided scientific papers. Students will also search for primary literature to provide background information for reports and seminars.",
                                                    "extra_time_commitment":  "Students will be asked to briefly come to lab outside of class 2-3 times during the semester to further experimental work. In addition, one problem set will include a 1-hour article discussion session outside of scheduled class time."
                                            }
}