{
        "code":  "03-411",
        "name":  "Topics in Research",
        "short_name":  "TOPICS IN RESEARCH",
        "units":  1.0,
        "min_units":  1.0,
        "max_units":  2.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "During the year students attend weekly seminars given by outside speakers or members of the Biology Department on current research topics in modern biology some seminars outside of the department may be substituted.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The goals of the course are 1 to make our majors aware of recently published or notyetpublished results from scientists at the forefront of their respective fields, and 2 to allow the students to see and interact with those scientists in person. More generally, the course will show students how new knowledge is disseminated to the scientific community through research seminar presentations.",
                                                    "key_topics":  "A variety of advanced topics will be represented, including topics in biochemistry, genetics, cell and developmental biology, neurobiology, computational biology, molecular biology, and evolution.",
                                                    "prerequisite_knowledge":  "All students are Biological Sciences seniors and should be familiar with basic principles and terminology in biochemistry, genetics, cell and developmental biology, neurobiology, computational biology, molecular biology, and evolution.",
                                                    "assessment_structure":  "Students will submit written answers to questions about the seminar contents prepared by the instructor, and the instructor will grade the answers.",
                                                    "relevance":  "The course gives students exposure to cutting edge work in biological science.",
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}