{
        "code":  "03-490",
        "name":  "Advanced topics in Immunology",
        "short_name":  "ADV TOP IMMUNOLOGY",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Course topics include antibody engineering, cytokine therapies, Tcell based therapies, vaccine development",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will be able to read, critique, and present the primary literature related to immunology.They will have a functional understanding of how to use aspects of the immune system to treat disease.",
                                                    "key_topics":  "Course topics include antibody engineering, cytokine therapies, T-cell based therapies, vaccine development",
                                                    "prerequisite_knowledge":  "Students should have a good knowledge of fundamental biochemistry in terms of protein and nucleic acid structure. Students should also have a good knowledge of cell biology. Students who have not taken an advanced course in immunology will be provided with the necessary materials to be successful in this course.",
                                                    "assessment_structure":  "There will two in-class exams, several in-class presentations, weekly homeworks, and a final exam or final paper",
                                                    "relevance":  "This is an upper level elective course for those students interested in immunology and applied immunology.",
                                                    "learning_resources":  "Students will be given review articles and articles from the primary literature.",
                                                    "extra_time_commitment":  "Nothing beyond normal course demands for preparation of presentations, homework, and studying for assessments. Total time will be 12 hours/week, 3 of which will be spent in class"
                                            }
}