{
        "code":  "03-439",
        "name":  "Introduction to Biophysics",
        "short_name":  "INTRO TO BIOPHYSICS",
        "units":  10.0,
        "min_units":  10.0,
        "max_units":  10.0,
        "prereqs":  {
                                        "text":  "((03-121 [] at least D) or (03-151 [] at least D)) and ((33-142 [] at least D) or (33-112 [] at least D) or (33-132 [] at least D) or (33-122 [] at least D) or (33-152 [] at least D) or (33-107 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Biological physics, or the physics of living systems, is an exciting interdisciplinary frontier of physics that aims to understand the phenomenon of life using concepts and tools from Physics. This intermediate level course will introduce the general concepts and principles underpinning the physical behavior of living systems, from the dynamics of proteins and molecules to collective behavior of living cells and organisms. The course will develop key physics concepts that are most vital to biological processes, including energy conversion, information transfer, mechanics of movement, statistical phenomena, and fluid flow. We will apply these physics concepts to demonstrate how biological systems function, build simplified mathematical models to predict behavior, and use experimental data to inform and test models. The integration of biological phenomena, physical concepts, mathematical modeling, and analysis of experimental data represents an entirely new mode of learning, based on strategies adopted in research. These strategies will break traditional disciplinary barriers between physics and biology. The students will be expected to gain an intuitive grasp of ways to frame the physical problem, identify appropriate theoretical frameworks, analyze experimental data, and ways to generalize and to understand the dependence of biophysical phenomenon on time and length scales. No prior knowledge of biology is expected. This class is offered in Fall of even years e.g. Fall 22, 24, etc.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  "This intermediate level course will introduce the general concepts and principles underpinning the physical behavior of living systems, from the dynamics of proteins and molecules to collective behavior of living cells and organisms. The course will develop key physics concepts that are most vital to biological processes, including energy conversion, information transfer, mechanics of movement, statistical phenomena, and fluid flow.",
                                                    "prerequisite_knowledge":  "Introductory physics, can be met with any combination of: 33-111/112 or 33-106/107 or 33-121/122 or 33-141/142",
                                                    "assessment_structure":  null,
                                                    "relevance":  "This course is relevant for Physics majors with an interest in biological physics and is also appropriate for life science students.",
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}