{
        "code":  "03-442",
        "name":  "Molecular Biology",
        "short_name":  "MOLECULAR BIOLOGY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(03-330 [] at least B) or (03-221 [] at least B) or (03-220 [] at least B)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The structure and expression of eukaryotic genes are discussed, focusing on model systems from a variety of organisms including yeast, flies, worms, mice, humans, and plants. Topics discussed include 1 genomics, proteomics, and functional proteomics and 2 control of gene expression at the level of transcription of mRNA from DNA, splicing of premRNA, export of spliced mRNA from the nucleus to the cytoplasm, and translation of mRNA.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "http://www.cmu.edu/bio/undergrad/courses/index.html",
        "custom_fields":  {
                                                    "goals":  "1 Learn to think like a molecular biologistHow do molecular biologists identify questions that are important to answer How does one develop a testable hypothesisHow does one design experiments to test ones hypothesisIf new tools are necessary to answer a question, how does one develop themHow does one properly and critically evaluate results2 What is creativity How can one become more creative3 How does one read scientific papers critically and more efficiently4 Improve your science communications skills to speak and write more critically, persuasively, succinctly, and creatively.5 Learn the basic principles of the molecular mechanisms underpinning the structure and expression of genomes, and the tools to study these. How do these steps work and how does one figure out how the molecules participating in these steps function together classic and emerging techniques to study genome organization and expression...from cloning to omicstranscription of RNA from DNApremRNA splicingRNA transport and localizationRNA turnovertranslation of mRNA",
                                                    "key_topics":  "(1) Structure and expression of eukaryotic genomes\n(2)\u0027Omics: genomics, transcriptomics, proteomics: how to identify and characterize the structure, interaction network, and function of all sequences in a genome, or all transcripts in a cell, or all proteins in a cell\n(3) Protein synthesis: translation of mRNA\n(4) Transcription: synthesis of RNA from DNA\n(5) Splicing: removal of intron from mRNA precurosrs\n(6) Nuclear export and subcellular localization of mRNA\n(7) Turnover of RNA",
                                                    "prerequisite_knowledge":  "Intro genetics and biochemistry",
                                                    "assessment_structure":  "Twelve weekly homework assignments, three one-hour exams, one art project, and one term paper, including an outline of the paper prepared beforehand.",
                                                    "relevance":  "Understanding the structure and organization of genes, and the mechanisms of their expression, explain the biology of cells and organisms¿exactly how, at the atomic level, do organisms and their tissues arise in time and space? Going forward, exactly what are the molecular underpinnings of diseases in humans? What are the underlying mechanisms driving the expression of genes, and why does dysfunction of these expression pathways, or of the function of the gene products, result in disease? Then and only then will rational approaches to diagnosis, therapy, and eventually cures, be possible.",
                                                    "learning_resources":  "Students will be required to read 2-3 papers from the literature each week, including mostly up-to-date review articles.",
                                                    "extra_time_commitment":  "Students typically spend 6-8 hours each week outside of class reading, writing and studying."
                                            }
}