{
        "code":  "03-534",
        "name":  "Biological Imaging and Fluorescence Spectroscopy",
        "short_name":  "BIO IMG \u0026 FLR SPECTR",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(09-106 [] at least D) and ((03-320 [] at least D) or (03-240 [] at least D)) and ((21-122 [] at least D) or (21-124 [] at least D)) and ((33-121 [] at least D) or (33-141 [] at least D) or (33-111 [] at least D)) and ((03-231 [] at least D) or (03-232 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Fluorescence detection is a powerful technology that is the basis of most biomedical imaging, high speed flow cytometry, cell sorting, DNA sequencing, gene expression arrays, diagnostics and drug discovery. It is not surprising, then, that it is the basis of many commercial technology organizations with billions of dollars in sales. It is almost impossible to turn the page of a biomedical journal without seeing multicolor images acquired with powerful microscopes and fluorescent probes of cell structure and function. The sensitivity of fluorescence detection is so high that single biological molecules can be monitored as they function in living cells.  This course covers principles and applications of optical methods in the study of structure and function in biological systems. Topics to be covered include absorption and fluorescence spectroscopy interaction of light with biological molecules, cells, and systems design of fluorescent probes and optical biosensor molecules genetically expressible optical probes photochemistry optics and image formation transmittedlight and fluorescence microscope systems laserbased systems scanning microscopes electronic detectors and cameras image processing multimode imaging systems microscopy of living cells and the optical detection of membrane potential, molecular assembly, transcription, enzyme activity, and the action of molecular motors. This course is particularly aimed at students in science and engineering interested in gaining indepth knowledge of modern light microscopy.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}