{
        "code":  "03-711",
        "name":  "Computational Molecular Biology and Genomics",
        "short_name":  "GENOMICS \u0026 MOLEC BIO",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "((03-121 [] at least D) or (03-151 [] at least D)) and (15-122 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "An advanced introduction to computational molecular biology, using an applied algorithms approach.  This course provides an indepth treatment of the algorithmic foundations of computational molecular biology.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  "http://www.cs.cmu.edu/~durand/03-711/",
        "custom_fields":  {
                                                    "goals":  "After completing this course, students will have a working knowledge of algorithms for global, semiglobal, and local alignment and be able apply those algorithms to concrete examples understand how parameter selection in a scoring function influences the results obtained using an alignment algorithm be familiar with the three basic families of phylogeny reconstruction methods maximum parsimony, distance, and maximum likelihood and be able to select an appropriate method for a given data set have an introductory understanding of Markov models of sequence evolution be familiar with the problems of sequence motif discovery, representation and recognition in a probabilistic framework understand the application of Hidden Markov Models in this framework, including the Viterbi, Forward, and Backward algorithms be introduced to the Baum Welch algorithm and the Gibbs Sampler understand the purpose of amino acid substitution matrices that are parameterized by evolutionary distance and be introduced to the derivation of the PAM substitution matrices from a Markov model of sequence evolution have an in depth knowledge of the BLAST database search heuristic and its parameters be able to select appropriate parameter values for a given query sequence and retrieval goal and be able to interpret the statistical output of BLAST.",
                                                    "key_topics":  "- Pairwise sequence comparison\n- Global multiple sequence alignment\n- Models and algorithms for motif discovery\n- Position Specific Scoring Matrices and the Gibbs sampler\n- Hidden Markov model (HMMs) for molecular biology\n- The Viterbi, Forward, and Backward algorithms and posterior decoding\n- Markov models of nucleotide sequence evolution (Jukes Cantor, Kimura 2 parameter models)\n- The PAM and BLOSUM amino acid substitution matrices and their derivation\n- Algorithms and statistics for searching sequence databases\n- Additional topics as time permits: Phylogeny reconstruction, gene finding",
                                                    "prerequisite_knowledge":  "To succeed in this course, you will need a solid introductory background in biology (molecular, cell and genetics), data structures and algorithms, and discrete math (probability, graphs, trees). There are no programming assignments in this course and the ability to program is not evidence that you have the right foundation. To take this course you must have taken the following CMU courses or have the permission of the instructor. Modern Biology (03-121), Programming for Scientists (02-601) or Principles of Imperative Computation (15-122), Concepts of Mathematics (21-127), (Note that 21-127 is a co-requisite of 15-122.)",
                                                    "assessment_structure":  "Evaluation is based on 8 to 10 problem sets, 5 to 7 advanced assignments, two exams and a final.",
                                                    "relevance":  "Research in bioinformatics requires an interdisciplinary effort between molecular biologists and computer scientists, and students from both disciplines are encouraged to participate in the course. A variety of backgrounds will bring different strengths to the course.",
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}