{
        "code":  "03-727",
        "name":  "Evolutionary Bioinformatics: Trees, Sequences and the Comparative Method",
        "short_name":  "EVOL BIOINFORMATICS",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "An advanced introduction to the evolutionary concepts and bioinformatic skills that are central to molecular, cell, developmental, and microbiology.  Proteins that share common ancestry also share functional properties.  This is the guiding principle of model organism research and sequencebased bioinformatics. Evolutionary trees phylogenies and multiple sequence alignments provide evidence for predicting structural and functional constraints, sites of molecular interaction, and residues that confer functional specificity.  In 2021, phylogenetics is emerging as an essential technique in metagenomics, cancer, and infectious disease, driven by technological advances such as high throughput sequencing and singlecell phenotyping.  This course covers both the conceptual foundation and the practical skills of evolutionary bioinformatics.   Students will acquire the tree thinking skills required for critical interpretation of phylogenetic analyses and figures in the literature and a rigorous understanding of phylogenetic inference methods.  Theoretical knowledge will be complemented by handson experience with sequence data repositories, bioinformatic tools for database retrieval, sequence analysis, and tree building.  Students will walk out of the course with the knowledge required to apply those tools correctly to messy, genuine data sets, and the ability to evaluate alternate hypotheses in light of these bioinformatic analyses.  Students with a range of computational backgrounds are welcome.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  "http://www.cs.cmu.edu/~durand/Phylogenetics/",
        "custom_fields":  {
                                                    "goals":  "The goals of this course are to impart both fundamental concepts and practical skills. The fundamental knowledge will enable students toUnderstand and use the basic concepts and terminology of phylogenetics in scientific discourse Interpret a phylogenetic tree, including identifying which taxa are most closely related and determining the temporal ordering of events implied by the treeInterpret figures in the phylogenetic literature with easeDistinguish between rooted and unrooted treesUnderstand the distinction beween a gene family tree and a species tree Discuss the basis of gene duplication and horizontal gene transfer and how these events influence gene tree topologyReconcile a gene tree with a species tree to infer ancestral states and evolutionary eventsUnderstand the distinction between orthologs and paralogs and identify orthologs in a reconciled gene tree explain how orthology is related to model organism research and apply that knowledge to design a wet lab experimentDescribe the basic features of a sequence evolution modelExplain the underlying basis of the major approaches to phylogeny reconstruction, how they differ, and the strengths and limitations of eachSummarize sources of error in molecular phylogenetics and review approaches to addressing such errorsUnderstand the importance of accounting for shared ancestry in comparative genomics and describe how phylogenies can be used to correct for nonindependence of observations.In addition, students will learn to apply the practical skills taught in this course to Describe the major steps in a phylogenetic analysis workflow, including multiple sequence alignment, model selection and tree reconstructionApply bioinformatic software to carry out each of these steps on amino acid andor DNA sequence data Use database retrieval software, e.g., Blast, to obtain a suitable data set from an appropriate",
                                                    "key_topics":  "Introduction to phylogenetic concepts and terminology; interpretation of evolutionary trees (\"tree thinking\"); critical evaluation of phylogenetic evidence in a formal, hypothesis-driven framework.\nGene and protein family evolution in the context of species evolution; gene duplication, horizontal transfer, gene tree reconciliation.\nIdentification and retrieval of sequences that share common ancestry via speciation (orthologs) or gene duplication (paralogs), distinctions between orthologs and paralogs, and the importance of orthologs for designing wet lab experiments.\nSequence analysis, multiple sequence alignment.\nMajor approaches to phylogeny reconstruction: Parsimony, Distance matrix, maximum likelihood, Bayesian analysis. Sequence evolution models.\nEvaluating phylogenetic reliability, bootstrapping, sources of bias, and systematic error.\nEmerging applications of phylogenetics in epidemiology and medicine, developmental processes and metagenomics will be presented as case studies.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Course work will include readings from textbooks and articles from the primary literature, problem sets, practica, one or two in-class exams, and a final exam. Students in 03-727 will also carry out a major data analysis project, intended to familiarize the student with the practical application of principles taught in class. A short paper and an in-class presentation summarizing the results of this project will be required.",
                                                    "relevance":  "Phylogenetics is emerging as an essential technique in cell and developmental biology, cancer, and infectious disease, driven by advances in biotechnology, including high through-put sequencing and single-cell phenotyping. Some examples include:\n\n-Tracking pandemics: Strain phylogenies, combined with epidemiological data, are crucial for early identification of COVID-19 variants with enhanced transmission, virulence and/or mutability. Comparative methods predict specific mutations that likely contribute to those phenotypes, which can then guide vaccine and drug design.\n-Multidrug resistance in bacteria: Similarly, phylogenetic approaches are used to track the spread of multidrug resistance in bacteria in hospital settings and to capture in vivo adaptations within patients.\n-Uncovering developmental pathways: Tree models of cell division and differentiation provide a foundation for exploiting high-throughput single-cell data to study tissue formation. This approach is already in use for studying tumorigenesis but is now emerging as a general technique in cell and developmental biology.\n-Metagenomics and the microbiome: High-volume, low-cost sequencing of environmental samples provides an unprecedented insight into the unculturable microbial world. Phylogenetics is essential for taxonomic profiling of these samples and for characterizing their metabolic capabilities.\n\nIn 2021, the ability to interpret trees is a fundamental requirement for scientific literacy. A survey of Science and Nature over a three month period in the last year shows that, on average, there is at least one evolutionary tree figure per issue. Interpreting such figures is not innate; it is a learned skill (\"tree thinking\") that our students will need in order to read and interpret the scientific literature.\n\nIn summary, 03-327/727 teaches practical, general skills that students can use in many settings, as well as abstract concepts that",
                                                    "learning_resources":  "Primary textbook: Molecular Evolution: A Phylogenetic Approach 1st Edition, Page \u0026 Holmes, Wiley-Blackwell, 1999. Additional readings will be taken from the primary literature and auxiliary textbooks: Inferring Phylogenies, Felsenstein, Sinauer, 2003; Phylogenetics: Theory and Practice of Phylogenetic Systematics 2nd Edition, Wiley \u0026 Lieberman, Wiley-Blackwell, 2011; An Introduction to Molecular Evolution and Phylogenetics 2nd Edition, Bromham, Oxford University Press, 2016.",
                                                    "extra_time_commitment":  null
                                            }
}