{
        "code":  "03-726",
        "name":  "Evolution of Regulatory Genomics",
        "short_name":  "EVLN REGULY GENOMICS",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [
                                        {
                                                "code":  "03-220",
                                                "id":  466,
                                                "name":  "Genetics",
                                                "units":  9.0
                                        },
                                        {
                                                "code":  "03-330",
                                                "id":  6205,
                                                "name":  "Genetics",
                                                "units":  9.0
                                        }
                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course in will examine the processes by which genomes evolve and how this genetic variation leads to phenotypic diversity.  An introduction to gene regulation, how the genome controls development, comparisons of development and the phenotypic diversity in animals will be provided.  Then we will consider ways in which genomes evolve, followed by in depth coverage of how gene regulation has evolved focusing on cis regulatory evolution and noncoding RNA regulatory evolution.  Finally the concept of gene regulatory network control of development and understanding evolution as change in these networks will be examined.   Concepts and specific examples will come through reading of primary literature and selected readings from advanced texts.  Grading will be based on written assignments from readings of literature, participation in class discussion, and two in class exams. The graduate level course 03726 will in addition require a term paper based on thorough and critical reading of primary literature focused on one of the general topics presented in the course.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}