{
        "code":  "03-709",
        "name":  "Applied Cell and Molecular Biology",
        "short_name":  "APP CELL MOLC BIOLGY",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course can serve a wide range of students, but it is primarily for students in Masters programs in life sciences. The purpose of this course is to review key cellular and molecular phenomenon in biological pathways with strong emphasis on latest experimental techniques used in applications including but not limited to disease diagnosis, therapeutics, largescale genomic and proteomic analysis.  Knowledge gained from this course will be both conceptual and analytical.  Students will periodically write extensive research reports on select topics and give oral presentations on a select few, while critically analyzing primary literature.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1 Apply key cutting edge experimental techniques to design of experiments that study the molecular basis of cellular function, including western blots, 2D proteomic gels, PCR, Sanger sequencing, CRISPRCas9, genetic screens, sequencing by synthesis, genomic reconstruction, and in situ labeling of DNARNAprotein. 2 Analyze scientific articles by critically reading the methology and data to understand the uses and limitations of the above techniques. 3 Design intervention strategies using all of the above expertise toward problem solving in applicationbased research for translating basic science into treatment of human diseases.",
                                                    "key_topics":  "The course will cover:\n1) the molecular mechanisms and regulation of key cell biology processes including cell signaling, central dogma, cell cycle and DNA replication, intracellular trafficking, and energetics.\n2) the significance of individual molecules and cellular pathways in relationship to the following: cell survival, cell division, cell growth, tissue growth, and organismal development",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "3-4 cumulative midterm exams, a final exam, weekly homework, weekly quizzes, required in-class activities, group presentations of research papers, individual presentations of research topics",
                                                    "relevance":  "Students will learn core facts about how biological systems work and prepare for possible future course work, including courses in automation of the biological research techniques taught.",
                                                    "learning_resources":  "Students will be required to read selected chapters of \"Molecular Biology of the Cell\" by Alberts. A supplemental text \"Molecular Biology\" by Clark is freely available while logged into CMU\u0027s VPN. Optional multimedia resources are available to students",
                                                    "extra_time_commitment":  "Students are expected to spend 9 hours on average per week on course material outside of class meeting times. Students will have to coordinate times for out-of-class meetings with their group for the 3 group projects, the time spent in group meetings is factored into the expected 9 hours/week of out-of-class work."
                                            }
}