{
        "code":  "05-200",
        "name":  "Ethics and Policy Issues in Computing",
        "short_name":  "ETHCS POLICY CMPTNG",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Should autonomous robots make life and death decisions on their own Should we allow them to select a target and launch weapons To diagnose injuries and perform surgery when human doctors are not around Who should be permitted to observe you, find out who your friends are, what you do and say with them, what you buy, and where you go Do social media and personalized search restrict our intellectual horizons Do we live in polarizing information bubbles, just hearing echoes of what we already know and believe As computing technology becomes ever more pervasive and sophisticated, we are presented with an escalating barrage of decisions about who, how, when, and for what purposes technology should be used. This course will provide an intellectual framework for discussing these pressing issues of our time, as we shape the technologies that in turn shape us. We will seek insight through reading, discussion, guest lectures, and debates. Students will also undertake an analysis of a relevant issue of their choice, developing their own position, and acquiring the research skills needed to lend depth to their thinking. The course will enhance students ability to think clearly about contentious technology choices, formulate smart positions, and support their views with winning arguments.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The course will enhance students ability to think clearly about contentious technology choices, formulate smart positions, and support their views with winning arguments",
                                                    "key_topics":  "Who, how, when, and for what purposes technology should be used.",
                                                    "prerequisite_knowledge":  "This course is intended for undergraduate and masters students from across the university. There are no pre-requisites.",
                                                    "assessment_structure":  "We will seek insight through reading, discussion, guest lectures, and debates. Students will also undertake an analysis of a relevant issue of their choice, developing their own position, and acquiring the research skills needed to lend depth to their thinking",
                                                    "relevance":  "In this course, students will study the social impacts of computing technology and systems. The course will provide a brief introduction to ethics and policy, and to the new and difficult questions modern computing technology presents us with. It will focus on a number of areas in which computers and information technology are having an impact on society including data privacy, social media, and autonomous technologies.",
                                                    "learning_resources":  "Readings - all online, accessible through Canvas. A bit of lecture, but mostly discussions",
                                                    "extra_time_commitment":  "Discussion posts and comments in Canvas"
                                            }
}