{
        "code":  "05-392",
        "name":  "Interaction Design Overview",
        "short_name":  "INTERACTN DESGN OVRV",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This studio course offers a broad overview of communication and interaction design. Students will learn design methodologies such as brainstorming, sketching, storyboarding, wire framing, and prototyping. Students learn to take a humancentered design approach to their work. Assignments include short inclass exercises as well as individual and teambased projects. Students take part in studio critiques, engaging in critical discussions about the strengths and weaknesses of their own work and the work of others. No coding is required. When registering for this course, undergraduate students are automatically placed the wait list.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will obtain an understanding of design principles, how to evaluate the efficacy of existing designs, and how to use design methods to create concepts and prototypes of ideal solutions.",
                                                    "key_topics":  "Basics of interaction design, digital display design, mobile website design, design research methods, and conversational user interface design",
                                                    "prerequisite_knowledge":  "No prior knowledge required",
                                                    "assessment_structure":  "Students will be assessed through completion of projects, presentations, participation in class, and their performance on team assignments.",
                                                    "relevance":  "Relevant to students wanting to incorporate a basic knowledge of design fundamentals with their main course of study, or as a starting point for moving toward an HCI major.",
                                                    "learning_resources":  "Readings and lectures will be available. Interim assignments and class participation (in addition to final projects) are a critical part of the course.",
                                                    "extra_time_commitment":  "Students must meet with teammates outside of class to complete assignments throughout the semester."
                                            }
}