{
        "code":  "05-360",
        "name":  "Interaction Design Fundamentals",
        "short_name":  "IXD FUNDAMENTALS",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "IXD Fundamentals introduces the humancentered design process as well as fundamental interaction design principles, methods, and practices. The course is for both students who may only enroll in one interaction design course and those who intend to build upon their HCI learning by taking advanced interaction design courses. Students must work effectively as individuals and in small teams to learn interaction design concepts and apply them to realworld problems.  By the end of this course students should be able to  Apply appropriate interaction design methods in a humancentered design process. Create persuasive interim and final design artifacts that demonstrate communication design fundamentals. Facilitate productive and structured critique across the class and with instructors. Explain and apply fundamental interaction design principles. Create clarity and readability in artifacts, including GUIs and deliverables, through the disciplined application of visual design principles such as typography, color and composition. Practice reframing a given problem in order to create opportunities that drive generating multiple solutions. Demonstrate habits that foster the creative process, including drawing, divergent thinking, and creative experimentation. Identify and explore with interaction design materials.  This course serves as a prerequisite for Advanced Interaction Design Studio number TBD.   Students who are required to take this course have priority and will be enrolled first.   No coding is required.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "IxDS for HCI aims to prepare students for more advanced courses involving user interface design, conversational agents, service design, digital service innovation, designing products that use artificial intelligence, persuasive design, designing gesturebased systems, humanrobot interaction and design systems among others. The course prepares students for Capstone projects by equipping them with many capabilities needed to operate in teams and work with a client.",
                                                    "key_topics":  "Interaction design, human-centered design, visual design, typography, color, composition, sketching, design for graphical user interfaces (GUIs), reframing, concept modeling, critique facilitation, persuasive presentation, working in teams, and prototyping.",
                                                    "prerequisite_knowledge":  "Deep interest in understanding the human-centered design process. Abiding curiosity about how interaction designers find problems that are worth solving and solve them through the expert application of interaction design methods and principles. A desire to learn how to communicate about interaction design through critique and design review as well as presentations. Students with experience in psychology, social sciences, design, software development, product management, product innovation and other related fields are appropriate for IxD for HCI.\n\nOnly the desire to continuously produce design work is required for this class. No coding or prior tool operation knowledge is required for this class.",
                                                    "assessment_structure":  "Learning outcomes are defined for each individual and team assignment in the IxD for HCI. Student assessments are based on the extent to which they satisfy each learning outcome. Numeric scores and comments are provided for each assignment. Each assignment includes interim deliverables to ensure continuous progress toward the presentation and submission of a final design.",
                                                    "relevance":  "Required for MHCI students, METALS students and undergraduate HCII majors.",
                                                    "learning_resources":  "Students use markers, whiteboards, paper, foam core and role playing to rapidly give form to concepts. They also choose from a variety of market-supplied tools such as Figma, Sketch, Adobe XD, Adobe Creative Cloud, Apple iMovie, InVision, Dovetail, Loom and others to produce more finished work with higher visual fidelity, rich interaction and functional robustness. Specific tools are not required for the course, so students may choose the tool with which they have the greatest familiarity and can be operated by all team members.",
                                                    "extra_time_commitment":  "Students identify times for teams to work outside of class. Establishing regular meeting times is encouraged to ensure steady learning."
                                            }
}