{
        "code":  "05-470",
        "name":  "Digital Service Innovation",
        "short_name":  "DGTL SRV INNVTN",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Attention entrepreneurs, designers, and engineers This course teaches you to invent digital services. You will learn about valuecreation in the service sector and a humancentered design process including brainstorming, storyboarding, interviewing, video sketches, and pitching. Students work in small, interdisciplinary teams to discover unmet needs of users. They conceive of a digital service and assess its technical feasibility, financial viability, and desirability. Then they  produce a plan with a business model and a video sketch and pitch it to industry professionals. Grades will be determined primarily by the quality of the teams products.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://www.hcii.cmu.edu/course/digital-service-innovation",
        "custom_fields":  {
                                                    "goals":  "In this course students will learn basic skills for conceiving of an innovative digital service in the context of a softwarebased startup. Students will learn the ideas, methods, tools and practices associated with the lean startup approach, service thinking and service making that are commonly used in todays tech startups.",
                                                    "key_topics":  "Digital Service Innovation exposes students to design thinking, service thinking, and the methods and practices used by lean startups working to create a minimum viable product (MVP).",
                                                    "prerequisite_knowledge":  "This course requires no coding, no background in design, and no training in business. We expect each student possess a background strength in one of the following areas: business, software/tech development, user-centered design, service design, behavioral science, data science, or communications.",
                                                    "assessment_structure":  "Students will primarily learn by doing, in teams or solo, and will be evaluated based on the output of their projects. Students are also evaluated on participation in threaded discussion boards and in class activities.",
                                                    "relevance":  "In this course students will conceive of a startup that is software-based and give form to a service for several stakeholders.",
                                                    "learning_resources":  "Readings and materials will be provided for in-class activities.",
                                                    "extra_time_commitment":  "As 50% of the class is a team project, students will need to find time outside of class to work as a team."
                                            }
}