{
        "code":  "08-533",
        "name":  "Privacy Policy, Technology and Law",
        "short_name":  "PRIVCY POLCY LAW TEC",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course focuses on policy issues related to privacy from the perspectives of governments, organizations, and individuals. We will begin with a historical and philosophical study of privacy and then explore recent public policy issues. We will examine the privacy protections provided by laws and regulations, as well as the way technology can be used to protect privacy. We will emphasize technologyrelated privacy concerns and mitigation, for example social networks, smartphones, behavioral advertising and tools to prevent targeted advertising and tracking, anonymous communication systems, big data, and drones.  This is part of a series of courses offered as part of the MSITPrivacy Engineering masters program. These courses may be taken in any order or simultaneously. Foundations of Privacy Fall semester offers more indepth coverage of technologies and algorithms used to reason about and protect privacy. Engineering Privacy in Software Spring semester focuses on the methods and tools needed to design systems for privacy.  This course is intended primarily for graduate students and advanced undergraduate students with some technical background. Programming skills are not required. 8733, 19608, and 95818 are 12unit courses for PhD students. Students enrolled under these course numbers will have extra assignments and will be expected to do a project suitable for publication. 8533 is a 9unit course for undergraduate students. Masters students may register for any of the course numbers permitted by their program. This course will include a lot of reading, writing, and class discussion. Students will be able to tailor their assignments to their skills and interests. However, all students will be expected to do some writing and some technical work.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "http://cups.cs.cmu.edu/courses/privpolawtech.html",
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}