{
        "code":  "09-108",
        "name":  "The Illusion and Magic of Food",
        "short_name":  "ILLUSION MAGIC FOOD",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Have you ever wondered about your food Why the freshly squeezed orange juice spoils after few hours while the one from the market lasts so much longer without apparent alteration Why roasted food is so delicious What is the nutritional value of milk and honey Why soft drinks are damaging the teeth What is the Impossible Burger These and many more questions will be answered in this course, not only by the instructor but also through the students research and curiosity. This course will introduce chemistry concepts on an asneeded basis, but it will remain at a simple level. We expect to help the student understand what food is made of, its nutritional value, how it is processed to offer longer shelf life, and how elaboration and preservation procedures may affect critical components. The topics will vary depending on the students motivation in learning about different concepts related to the food industry, from processing to analysis, to packaging, and appearance. We plan to discuss interesting things in every class and finish the course with a broad knowledge of what is on our table and a better criteria to select our food. 3 hrs. lectures per week.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Our aim is that students make an educated assessment of the quality of food that the market offers based on concepts learned in this course. They will also learn of some food industry associated issues that affect society. We expect that they associate the three fundamental food components lipids, carbohydrates and proteins to the properties of food, their taste, aspect and nutritional value. Our goal is to stimulate them either to learn more andor to wisely choose their food.",
                                                    "key_topics":  "1-Food and Food Quality: acceptability; aspects of food quality; taste sensitivity, objective, and subjective testing. 2-Water: relevance of water in food and water activity. 3-Lipids: structure and properties; fats and oils; essential fatty acids; polymorphism; melting point; rancidity. 4-Carbohydrates: structure and properties; carbohydrates relevant to food; body and mouthfeel; fermentation; preservatives; caramelization; other sweeteners. 5-Chocolate; cocoa cultivars; manufacture of chocolate. 6- Proteins, amino acids, and peptides. Structure and properties. Eggs; denaturation; coagulation; dehydration phenomenon. 7-Milk and Milk Products. Types of milk. Cheese; whey and whey products. 8-Fruits and Vegetables; enzymatic browning; pigments; vitamins. 10- Beef and \"Impossible\" foods.",
                                                    "prerequisite_knowledge":  "This course has no prerequisite however high school chemistry exposure would help. The structure and properties of the basic components of food: lipids, carbohydrates and proteins will be discussed to provide a fundamental understanding of food systems. Basic overview of the basic concepts will be presented in write ups and further work in class.",
                                                    "assessment_structure":  "The student\u0027s grade will be determined by the following:\n\nGraded on correctness (70%):\n\t\t\ta) Five quizzes (15 %), 3 pts each.\nb) There are six (6) assignments to be completed outside the classroom and due on Wednesdays (35%).\nc) An in-class Final Exam (10%)\nd) An essay on a case study (10%).\n\nGraded on completion (30%):\ne) Five write-ups with questionnaires to be completed. (20%)\nf) pre- and post-test submission (5%), 2.5 pts each.\nf) Attendance (5%)\n\n\nLetter Grade: Letter grade will be assigned as follows: 89-100%: A; 79-88%: B; 69-78% C; 59-68%: D; 58% or less: R. Students with grades in the borderline will be considered for a higher letter grade based on punctuality, attendance, and participation.",
                                                    "relevance":  "Food is essential to maintain health and life. This course is relevant to educate our students on the value contained, added, or reduced in food through different treatments and processes during and post harvesting and until it reaches the table. We will also address other hidden aspects of food that relate to the way food is presented, packaged, and advertised. Students that took this course commented on the value that introduced in their life being more knowledgeable about the choices they make on the food they eat. Not only they felt many food secrets were revealed but also learned the chemical foundation for some food facts.",
                                                    "learning_resources":  "The recommended textbook is: Essentials of Food Science, 4th Edition, by Vickie Vaclavik and Elizabeth W. Christian, 2014, Springer, ISBN: 978-1-4614-9137-8. Some material will be provided in the course such as notes and links to on-line resources some additional material may need to be procured through the student\u0027s own research. Office hours and open-door policy provides flexibility for students to get help when needed. We will use Piazza as the communication platform.",
                                                    "extra_time_commitment":  "Students will invest time in reading the class notes and answering questions of five write ups. Videos assigned may represent more time commitment, such as 45 min to 1 hour and there might be one or two assigned per week. Readings will also be assigned. The graded material will often refer to the videos, readings, and notes."
                                            }
}