{
        "code":  "09-110",
        "name":  "The Design and Making of Skin and Hair Products",
        "short_name":  "SKIN HAIR PRODUCTS",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This handson course targets students from across the CMU community who are interested in learning how chemistry applies to their everyday life. We will focus on students gaining knowledge of the chemical components in cosmetic products and on the methods for preparing them from shampoos and conditioners to lotions, soaps, and creams. We will emphasize good laboratory practices and safety as well as the fundamental chemical and physical concepts that govern the product behavior and use. The overarching goal is that the students have a handson laboratory experience and develop a full understanding of the science behind the products that they use every day. No human or animal testing will take place as part of the curriculum.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "To acquire fundamental laboratory skills and learn how to work safely in a chemical laboratory.To develop proficiency in recordkeeping by maintaining a laboratory notebook.To demonstrate knowledge of the chemical reactions.To learn and use the appropriate scientific vocabulary to articulate chemical properties and functions of components in cosmetics products.To work as a member of a team in creating an original formulation of a product based on knowledge gained in the course.To effectively communicate knowledge in an end of semester presentation to a group of their peers.To explain how factors such as race, ethnicity, gender identity, socioeconomic status, work, environmental factors, athletic pursuance, and culture play a role in the formulation of cosmetic products.",
                                                    "key_topics":  "Topics covered in this course are:\n-Working safely in the lab\n-Perfume and color additives and their role in cosmetic products.\n\n-Chemical properties and function of different natural and synthetic components in cosmetic formulations with special focus on skin and hair products.",
                                                    "prerequisite_knowledge":  "There are no prerequisites.",
                                                    "assessment_structure":  "Students are assessed over a few main categories:\n-Students\u0027 ability to work safely in the lab is assessed through the form of weekly safety quizzes that they must take prior to the start of all experimentation.\n-Students\u0027 understanding of how to perform each experiment is assessed through lab assignments. Students must complete lab assignment questions and/or watch technique videos before beginning experimentation.\n-Students\u0027 laboratory skills will be evaluated by the grading of their laboratory notebook pages.\n-Depth of understanding of the technique and its application are assessed through weekly quizzes and individual team project assignments.\n-Group work as well as technique application are assessed through the team project grade. Students are asked to select a group for team projects. The group is responsible for developing an original formulation of one or more of the cosmetic products for a given \"client\". They are graded based on the creativity and uniqueness of the proposed product formulation as well as the presentation of their finished product in terms of branding and aesthetics. They will also receive a grade based on their individual contribution to the team as well as the teams\u0027 overall lab work.",
                                                    "relevance":  "This course targets students from across the CMU community who are interested in: 1) learning how chemistry applies to their everyday life and 2) thinking about how factors such as race, ethnicity, gender identity, socio-economic status, work, environmental factors, athletic activities, and culture play a role in the formulation of cosmetic products. We will focus on students gaining knowledge on the chemical components in cosmetics and on the methods for preparing them (from shampoos and conditioners to lotions, soaps, and creams). We will emphasize good laboratory practices and safety in terms of the production of the cosmetic product as well as the fundamental chemical and physical concepts that govern the product behavior and use. The overarching goal is that the students have a hands-on laboratory experience and develop a full understanding of the science behind the products that they use every day.",
                                                    "learning_resources":  "-\tStudents utilize Canvas for all course material including the syllabus, lecture notes and videos, etc. Canvas is updated daily/weekly.\n-\tStudents are given access to an electronic \u0027in house\u0027 lab manual/notebook that provides information regarding safety, how to write in a laboratory notebook, introductory background information as well as procedural information for each experiment.\n-\tSafety and Technique\u0027s videos will be posted on how to use the equipment/instruments and work safely in the lab.\n-\tStudents are encouraged to use Piazza (online discussion forum) to ask questions. Teaching assistants, course instructors, and graders are all given access to Piazza and questions will be answered within a 12-24 hour period or often less.\n-\tInstructors will provide office hours on an as needed basis.",
                                                    "extra_time_commitment":  "-\tStudents are expected to efficiently utilize the 2-hours out-of-class time to complete research assignment questions and work on team projects. There should be no extra time commitments for the course."
                                            }
}