{
        "code":  "09-220",
        "name":  "Modern Organic Chemistry II",
        "short_name":  "MODRN ORGANIC CMY II",
        "units":  10.0,
        "min_units":  10.0,
        "max_units":  10.0,
        "prereqs":  {
                                        "text":  "09-219 [] at least D"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course builds on 09219 by introducing students to additional functional groups, chemical reaction mechanisms and synthetic strategies commonly used in the practice of organic chemistry. Advanced topics to be presented during the extra lecture will include multidimensional NMR spectroscopy, enantioselective synthesis, ionic polymerization, bioorganic and medicinal chemistry, natural products chemistry and toxicology. Students who complete 09220 will have a strong foundation in synthetic, mechanistic and structural organic chemistry and will understand how this applies to human health and the environment. 4 hrs. lec, 1 hr. rec.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "At the completion of this course, students should have the following skills and knowledge. The ability to write mechanisms for a variety of reactions, including but not limited to nucleophilic attack at carbonyl groups, enolate reactions, aromatic substitutions and DielsAlder reactions. The ability to use these reactions to design multistep syntheses of organic compounds. The ability to determine chemical structure from spectroscopic data and reactivity behavior. An understanding of the relationship between organic chemistry and the structure and function of complex biomolecules such as proteins and nucleic acids. An understanding of the role that organic chemistry plays in the synthesis of polymers..",
                                                    "key_topics":  "The first part of the class is focused on the chemistry of conjugated molecules including dienes, and aromatic compounds. The second part of the class is focused on the chemistry of carbonyl compounds, including but not limited to: oxidation/reduction, nucleophilic addition, aldol reactions, Claisen condensations, Micheal additions, and carboxylic acid derivative interconversion. The third part of the course is focused on amines, synthetic polymers, polypeptides, phenols, and nucleophilic aromatic substitution.",
                                                    "prerequisite_knowledge":  "Chem 09219.",
                                                    "assessment_structure":  "Three in-class exams (50 min each) and a comprehensive final exam. The course is graded on the typical scale.",
                                                    "relevance":  "This course is part of the Modern Organic Chemistry sequence (09219 and 09220). Organic chemistry is the foundation for many other subjects dealing with living organisms, materials and pharmaceuticals. It forms the foundation for a strong understanding of molecular structure and spectroscopy.",
                                                    "learning_resources":  "The following material is made available to students through Canvas and in lecture: Skeleton lecture notes; recitation material including practice problems and solutions; homework materials and answer keys; practice exams and answer keys. Office hours allows for flexibility to access help; emailed questions are also answered. The Office of Disability Resources also offers exam proctoring as well as additional help to students with different disabilities, including time management.",
                                                    "extra_time_commitment":  "Students have to commit an additional hour for lecture each week which enables the course instructors to cover some modern aspects of organic chemistry and provide students with further exposure to recent developments in the field. In addition, students have recitation and should review/complete practice problems on their own outside of class time each and every week."
                                            }
}