{
        "code":  "09-291",
        "name":  "Environmental Systems on a Changing Planet",
        "short_name":  "ENV SYS CHG PLNT",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course introduces the interconnected environmental systems that regulate our climate and ecosystems, providing the resources required to sustain all life, including human societies. These systems are the fascinating connections between the oceans, atmosphere, continents, ecosystems, and people that provide our planet with resources that all life depends on. Human activities disrupt these natural systems, posing critical threats to the sustainable functioning of environmental systems. We will explore how solar and biochemical energy moves through the Earths interconnected systems, recycling nutrients how complex environmental systems function to produce critical resources such as food and water and how human activities interfere with these systems. Case studies include the interplay between climate change feedbacks, wildfires, and forest ecosystems the hazards that everyday chemical toxins pose to ecosystems and human health and reproduction and growing threats to ecosystem health and biodiversity. We will also develop the relevant information literacy required to understand current issues that are frequently debated in the public sphere, and connect these to environmental justice. This course draws on principles learned in high school science and serves as the foundational Earth  Environmental Science requirement for both the Minor and Additional Major in Environmental and Sustainability Studies. 09291 is intended for both nonSTEM majors from any program as well as STEM majors from any program in CIT, MCS, and SCS.  In addition, STEM majors are strongly encouraged to take the connected 09381 3unit course that provides a more technical and quantitative framework for understanding the course content. 24381 is often required for this course to count as a technical elective for STEM programs, and is required for students from CIT, MCS, and SCS in the Environmental and Sustainability Studies programs.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Understand how major environmental systems and their underlying components and processes function and in doing so sustain life on Earth by providing a habitable and stable climate, food, water, energy, nutrients, and other material resources.Develop the proficiency in environmental, scientific, and information literacy required to understand, evaluate, and contribute to discussions regarding current environmental sustainability challenges and their proposed solutions. State and explain the major connections and interactions between the oceans, atmosphere, continents, ecosystems, and people that create environmental systems and support life.Apply environmental science to learn and illustrate fundamental concepts and methods from the sciences and engineering for organizing information such as using concept maps and understanding complex integrated systems.Describe major current threats to the sustainable functioning of natural environmental systems and evaluate proposed solutions identify the major course concepts you draw on in your multidisciplinary analysis of these threats.Explain sustainability in the context of natural environmental systems and the perturbations to sustainable natural systems caused by human societies describe how human societies rely on natural environmental systems evaluate effective possible modifications to modern systems that would promote sustainability.Identify and describe the functioning of environmental systems at work in your own environment and location e.g. Pittsburgh through selfguided field trips identify and explain the interference from human activities in these systems.",
                                                    "key_topics":  "Environmental systems: functioning of and interactions between the atmosphere, continents, oceans, ecosystems, and human societies in the Anthropocene; sustainability; environmental, scientific, and information literacy; ecology, ecosystems, biomes, and food webs; threats to ecosystem health and biodiversity; fire ecology \u0026 succession; biogeochemistry and nutrient cycling; evolution \u0026 biodiversity; environmental health and disease; resource management, environmental economics \u0026 policy; Earth systems, water \u0026 rock cycles, glaciology; water resources; land resources (forest, grassland, and soil ecosystems); food resources, food security, agrochemicals, sustainable agriculture; climate change, drought and wildfires.",
                                                    "prerequisite_knowledge":  "This interdisciplinary course is designed to be accessible to students from all Colleges and majors, expecting only high school science courses as preparation.",
                                                    "assessment_structure":  "Graded discussions of pre-class reading and viewing material, online quizzes, one in-class test, in-class discussion and participation, final exam. Main assignments: series of short problem/question sets, field trip report, short term paper.",
                                                    "relevance":  "The course serves as an introduction to environmental science, considering the Earth from a complex integrated systems perspective. It is relevant to any student interested in studying the environment and sustainability through science and engineering perspectives and approaches. It exposes students to the environmental systems that control the natural function of the Earth and its climate, and the production of critical resources such as the food, water, energy, nutrients, and materials that all life depends on.\n24-291/09-291 also serves as the foundational Earth \u0026 Environmental Science course requirement for the interdisciplinary Minor and Additional Major in Environmental and Sustainability Studies programs for students in non-STEM majors. Students in STEM majors should also take the 24-381/09-381 Science \u0026 Engineering Addendum course together with 24-291/09-291. 24-381/09-381 taken with this course is also required for this course to count as a technical elective for STEM programs in CIT, MCS, and SCS. This course is included on the approved list of science electives for the general education requirements for most Colleges at CMU.",
                                                    "learning_resources":  "All readings and lecture slides will be posted on Canvas. A required textbook will also be used that has an affordable online version and comes with supplementary materials and adaptive online quizzes to help you assess your understanding. Select documentary videos will also be provided online for viewing before class.",
                                                    "extra_time_commitment":  "A few local field trips will be planned to experience environmental systems at work and the role of human interference in these systems, usually on weekends."
                                            }
}