{
        "code":  "09-204",
        "name":  "Professional Communication Skills in Chemistry",
        "short_name":  "PRFL COMM SKLS CHMST",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  "09-221 [] at least D"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This required course for chemistry majors promotes development of  written and oral communication skills in various formats within the discipline.  Students are expected to develop these skills by becoming more familiar with the style and format of the chemical literature, current topics in chemistry, and research projects in the Department.  Other learning outcomes include developing critical reading skills, providing effective feedback to peers written and oral communication, demonstrating the ability to revise written work, and using chemical structure drawing software. 1 hr. lec.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Upon completion of this course, students should\nprepare an outline of a scientific manuscript or presentation\nsupport their ideas through the scientific literature\npresent their ideas and results in logical, visually clear text and graphics\nsell an idea through a clever, thoughtprovoking title and compelling threeminute presentation\nprovide thoughtful feedback on peers presentations",
                                                    "key_topics":  "The course provides an introduction to written and oral communication skills, directed toward presentations that emphasize chemistry topics and settings. Topics covered in class include (a) writing an abstract, (b) describing data, (c) articulating conclusions and future directions, (d) searching the literature, (e) preparing an oral presentation and (f) giving an oral presentation",
                                                    "prerequisite_knowledge":  "There are no prerequisites for the course.",
                                                    "assessment_structure":  "Students will be evaluated based on three types of assignments: (1) writing of sample abstracts, descriptions of results and statements of conclusions, (2) literature summaries based on topics chosen by the students and (3) an oral presentation on that same topic. These assignments will each be worth 30% of the grade; the remaining 10% of the grade will be earned through class participation in discussions.",
                                                    "relevance":  "The traditional view of a professional chemist as someone who works exclusively at the bench, fumehood or computer, completely absorbed in their research and having minimal contact with the outside world, is badly outdated. Today\u0027s professional chemist spends countless hours in meetings, giving technical seminars, speaking to community groups, writing manuscripts for peer-reviewed journals and proposals for funding agencies, and preparing reports for supervisors. Those with chemistry degrees also pursue careers in non-research areas such as patent law, consulting, engineering, technical writing and the health professions. The common thread connecting these disparate disciplines and activities is communication, both written and oral. Beginning to build skills in professional communication will help prepare students to compete for summer internships, fellowships, employment and post-graduate programs.",
                                                    "learning_resources":  "Instructor\u0027s notes, readings and online videos will supplement in-class discussions.",
                                                    "extra_time_commitment":  "Students can expect to spend 2-3 hours per week (outside of class) reading course materials and working on assignments. The workload will be fairly consistent across the semester."
                                            }
}