{
        "code":  "09-222",
        "name":  "Laboratory II: Organic Synthesis and Analysis",
        "short_name":  "LAB II:ORGNC SYN ANL",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "((09-217 [] at least D) or (09-219 [] at least D)) and ((09-221 [] at least D) or (09-223 [] at least D))"
                                },
        "co_reqs":  [
                                        {
                                                "code":  "09-220",
                                                "id":  1862,
                                                "name":  "Modern Organic Chemistry II",
                                                "units":  10.0
                                        },
                                        {
                                                "code":  "09-218",
                                                "id":  5319,
                                                "name":  "Organic Chemistry II",
                                                "units":  9.0
                                        }
                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In this second course in the laboratory sequence, students acquire laboratory skills relevant to synthesis and purification of organic compounds, as well as the practical use of chromatography and spectroscopy. Students will also further develop technical writing skills through preparation of lab reports. 2 hrs. lec., 6 hrs. lab.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Learn how to search for information about chemical hazards and waste. Work safely in a laboratory environment. Use proper handling and waste disposal for chemicals. Safely carry out laboratory techniques for synthesis, purification, and identification of organic chemicals. Describe at an appropriate level the principles and theory behind techniques. Assemble laboratory apparatus in a stable and safe structural arrangement. Manage time to allow for completion of work on schedule. Demonstrate ability to explain scientific concepts, experimental methods, and conclusions in writing.",
                                                    "key_topics":  "Organic chemistry laboratory techniques for synthesis, separation, purification, and analysis; record-keeping; written communication skills; lab safety; chemical handling.",
                                                    "prerequisite_knowledge":  "Lab I: Introduction to Chemical Analysis (09221), and Modern Organic Chemistry I (09219). Pre- or corequisite: Modern Organic Chemistry II (09220).",
                                                    "assessment_structure":  "There are typically 7 - 8 lab reports, which provide for assessment of scientific writing, record-keeping, and logical thinking. Two exams test background knowledge and problem-solving abilities. Variable from year to year: quizzes, problem sets",
                                                    "relevance":  "This course is part of the laboratory sequence for chemistry majors. It reinforces material covered in organic chemistry lecture courses and provides hands-on experience with laboratory equipment and techniques as well as developing scientific writing skills. This course prepares students to move on to Lab III: Molecular Design and Synthesis (09321) or Bioorganic lab (09323), as well as to participate in research. The course material is also relevant background for biochemistry, molecular biology, environmental chemistry and other courses that pertain to medical and material applications.",
                                                    "learning_resources":  "A lab manual specific to the experiments being performed, a textbook that covers techniques, on-line spectrum database, Canvas for on-line materials with Piazza enabled for discussion, office hours offered by the instructor scheduled for assignments.",
                                                    "extra_time_commitment":  "Students are expected to work outside of class to complete assignments."
                                            }
}