{
        "code":  "09-510",
        "name":  "Chemistry and Sustainability",
        "short_name":  "CMSTY \u0026 SUSTAIN",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course aims to educate students in the foundations of systematic leadership for building a sustainable world. Many sustainability challenges are associated with commercial chemicals and with operational modes of the chemical enterprise. For scientists, effectiveness in solving the technical challenges and redirecting cultural behavior is the defining substance of sustainability leadership. The course aims to challenge students to analyze and understand the root causes of unsustainability, especially in the technological and cultural dimensions of the chemical enterprise, to imagine a more sustainable world and to begin to define personal leadership missions. Students will be introduced to sustainability ethics as the foundation stone of transformative sustainability leadership, to the Collins Code of Sustainability Ethics and to other guiding tools. The Collins Bookcase of Green Science Challenges organizes the technical content. It systematizes the major chemical sustainability challenges of our time clean synthesis, renewable feedstocks, safe energy, elemental pollutants, persistent molecular toxicants and endocrine disruptors. Focal areas will be the technical, toxicological and cultural histories of elemental and molecular pollutants and endocrine disruptor ED science. EDs represent the single greatest sustainability challenge of everyday chemicals all while we are just beginning to recognize an emerging threat to health and the environment from micro and nanoplastics which are finding their way into human tissues.  The course is intended for upper level undergraduates and graduates, although many brilliant freshmen have thrived in the course.  The class is limited to 25 students. The assignments are common to both undergraduate and graduate classes offerings with graduates taking additional assignments. Undergraduate course 9 units 09510. Graduate course 12 units 09710 3 hrs. lec.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Important thematic challenges are to understandwhat sustainability error in chemistry looks like,how we can avoid it and,how we can strategically adapt and advance chemistry so that the plenitude of life is here in abundance for as long as the universe will allow.",
                                                    "key_topics":  "sustainability ethics, chemical technologies, green science",
                                                    "prerequisite_knowledge":  ".",
                                                    "assessment_structure":  "The graded substance will take the form of take-home work. Students will primarily read key books and articles and will summarize and personally evaluate the material in essay assignments.",
                                                    "relevance":  "Sustainability competent scientists, currently a tiny cadre, are going to be the most in demand for employment of all scientists as the general public comes to better understand the existential threats posed by chemical and related technologies.",
                                                    "learning_resources":  "Immoderate Greatness: Why Civilizations Fail, William Ophuls, Greater Space Independent Publishing Platform, 2012, North Charleston, SC, ISBN-10:1479243140,ISBN-13: 978-1479243143\nDeceit and Denial: The Deadly Politics of Industrial Pollution, Gerald Markowitz and David Rosner, Univ. California Press, California/Milbank Books on Health and the Public, 2002, ISBN-10:0520275829 ISBN-13: 978-0520275829\nOur Stolen Future: Are We Threatening Our Fertility, Intelligence, and Survival?¿A Scientific Detective Story, Theo Colborn, Dianne Dumanoski, John Peterson Myers, Plume, 1996, NY, ISBN-10:0452274141,ISBN-13: 978-0452274143\nSections of Hans Jonas, The Imperative of Responsibility: In Search of an Ethics for the Technological Age, Univ. Chicago Press, Chicago, 1984\nVandenberg LN, Colborn T, Hayes TB, Heindel JJ, Jacobs DR, Lee D-H, et al. 2012. Hormones and endocrine disrupting chemicals: low dose effects and non-monotonic dose responses. Endocr Rev; doi:10.1210/er.2011-1050, and Material from www.ourstolenfuture.com",
                                                    "extra_time_commitment":  "."
                                            }
}