{
        "code":  "10-301",
        "name":  "Introduction to Machine Learning",
        "short_name":  "MACHINE LEARNING",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "((15-122 [] at least C) or (15-121 [] at least C)) and ((15-151 [] at least C) or (21-128 [] at least C) or (21-127 [] at least C)) and ((36-220 [] at least C) or (15-259 [] at least C) or (36-219 [] at least C) or (21-325 [] at least C) or (36-218 [] at least C) or (15-359 [] at least C) or (36-225 [] at least C) or (36-217 [] at least C) or (36-235 [] at least C))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [
                                            {
                                                    "code":  "18-461",
                                                    "id":  8806,
                                                    "name":  "Introduction to Machine Learning for Engineers",
                                                    "units":  12.0
                                            },
                                            {
                                                    "code":  "18-661",
                                                    "id":  8815,
                                                    "name":  "Introduction to Machine Learning for Engineers",
                                                    "units":  12.0
                                            },
                                            {
                                                    "code":  "10-315",
                                                    "id":  9508,
                                                    "name":  "Introduction to Machine Learning (SCS Majors)",
                                                    "units":  12.0
                                            }
                                    ],
        "equiv":  [
                                    {
                                            "code":  "10-401",
                                            "id":  404,
                                            "name":  "Introduction to Machine Learning (Undergrad)",
                                            "units":  12.0
                                    }
                            ],
        "long_desc":  "Machine Learning is concerned with computer programs that automatically improve their performance through experience e.g., programs that learn to recognize human faces, recommend music and movies, and drive autonomous robots. This course covers the theory and practical algorithms for machine learning from a variety of perspectives. We cover topics such as decision tree learning, neural networks, statistical learning methods, unsupervised learning and reinforcement learning. The course covers theoretical concepts such as inductive bias, the PAC learning framework, Bayesian learning methods, and Occams Razor. Programming assignments include handson experiments with various learning algorithms. This course is designed to give a graduatelevel student a thorough grounding in the methodologies, technologies, mathematics and algorithms currently needed by people who do research in machine learning.  10301 and 10601 are identical. Undergraduates must register for 10301 and graduate students must register for 10601. 10301 is recommended for undergraduates who are not SCS majors. SCS majors should instead take 10315.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "http://mlcourse.org",
        "custom_fields":  {
                                                    "goals":  "By the end of the course, students should be able to Implement and analyze existing learning algorithms, including wellstudied methods for classification, regression, structured prediction, clustering, and representation learning Integrate multiple facets of practical machine learning in a single system data preprocessing, learning, regularization and model selection Describe the the formal properties of models and algorithms for learning and explain the practical implications of those results Compare and contrast different paradigms for learning supervised, unsupervised, etc. Design experiments to evaluate and compare different machine learning techniques on realworld problems Employ probability, statistics, calculus, linear algebra, and optimization in order to develop new predictive models or learning methods Given a description of a ML technique, analyze it to identify 1 the expressive power of the formalism 2 the inductive bias implicit in the algorithm 3 the size and complexity of the search space 4 the computational properties of the algorithm 5 any guarantees or lack thereof regarding termination, convergence, correctness, accuracy or generalization power.",
                                                    "key_topics":  "Decision trees, k-nearest neighbors, perceptron, linear regression, logistic regression, neural networks, gradient descent, stochastic gradient descent, model selection, experimental design, regularization, deep learning, learning theory, hidden Markov models, Bayesian networks, reinforcement learning, dimensionality reduction, unsupervised learning, k-means, ensemble methods, recommender systems.",
                                                    "prerequisite_knowledge":  "1. Significant experience programming in a general programming language.\n2. Basic familiarity with probability and statistics.\n3. College-level maturity in discrete mathematics.",
                                                    "assessment_structure":  "The requirements of this course consist of participating in lectures, midterm, final, homework assignments, and readings.",
                                                    "relevance":  "Machine learning is itself an interdisciplinary field that draws on aspects of computer science, statistics, probability, optimization, information theory, and more. Increasingly its applications include fields that span all of those represented at Carnegie Mellon. This course is designed to give students a deep understanding of how and why these methods work and how they can be applied to new problems.",
                                                    "learning_resources":  "Resources for this course typically include one or more recommended textbooks and online readings. Some offerings of this course also include recitations.",
                                                    "extra_time_commitment":  "Attendance of exams is required. Sometimes these exams are held in the evening in order to give students additional time."
                                            }
}