{
        "code":  "12-215",
        "name":  "Introduction to Professional Writing in CEE",
        "short_name":  "INTR PRF WRTG IN CEE",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The objective of the course is to prepare students for writing technical reports and essays assigned in CEE courses and laboratories, writing professional letters and reports for internships and professional positions, preparing documents in a team setting, delivering individual and team oral presentations, and transforming information for several types of audiences scientific accommodation.  The course focuses on document purpose, organization and style basic editing techniques scientific accommodation plagiarism and proper paraphrasing and summarizing evaluating, citing and referencing sources team communication strategies oral presentations and proper use of tables, graphics, and other visual aids in documents and presentations.  Course activities include inclass exercises, peer workshops, and homework assignments to illustrate examples of good and poor communication and to practice technical communication skills.  Concurrent with lectures and class activities, students draft and revise individual and team technical reports and will give individual and team oral presentations.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will compare the differences between professional writing and narrative or creative writing demonstrate that writing is an iterative process of drafting, revising, and proofreading organize information and compose clear, concise technical reports and professional letters assess writing using a rubric of competencies demonstrate oral presentation skills including creating visuals and practicing delivery.",
                                                    "key_topics":  "Business writing, oral presentations, group writing and presentation, revision strategies, peer review strategies, evaluating and using sources.",
                                                    "prerequisite_knowledge":  "High school writing experience",
                                                    "assessment_structure":  "Several short writing assignments, individual report and presentation, group report and presentation, midterm exam, peer review participation",
                                                    "relevance":  "Students will be prepared for the types of communication frequently used by civil and environmental engineers.",
                                                    "learning_resources":  "Short readings will occasionally be used.",
                                                    "extra_time_commitment":  "Students are encouraged to visit the Global Communications Center."
                                            }
}