{
        "code":  "14-315",
        "name":  "Innovation in Building AI-Products",
        "short_name":  "INNOV BUILD AI PROD",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Innovation is a key element for technological entrepreneurship. Adopting Artificial Intelligence has much more to it than learning the technical aspects. In this course, we cover the basics of building AIproducts and adopting Artificial Intelligence into an organization. This course is targeted to undergraduate students with interest in learning the innovation and entrepreneurship skills. Topics covered will include understanding the principles of innovation, understanding AIbusiness models, defining the value proposition and user benefit of AIproducts, building the AI team, and scalingup the business. Emphasis will be on team projects. At the end of this course, students are expected to  learn the principles of innovation  understand the components of the entrepreneurship competency model and leverage it to building a successful AIproduct  obtain the skillset to innovate and adopt Artificial Intelligence  apply entrepreneurial strategies in building AIsystems  understand the practices needed to grow your AIproduct and  obtain selfevaluation for career direction.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "This course helps students with interest in AI and Innovation to build successful AI products and businesses",
                                                    "key_topics":  "Understanding the principles of innovation, understanding AI-business models, defining the value proposition and user benefit of AI-products, building the AI team, and scaling-up the business.",
                                                    "prerequisite_knowledge":  "No prerequisite courses. Basic knowledge about AI is preferable",
                                                    "assessment_structure":  "This course helps students with interest in AI and Innovation to build successful AI products and businesses",
                                                    "relevance":  "This course helps students with interest in AI and Innovation to build successful AI products and businesses",
                                                    "learning_resources":  "No textbook is required. Learning tutorials, readings and Industry reports will be provided to the students",
                                                    "extra_time_commitment":  "Students are expected to spend 1-2 hours/week to meet with the instructor/TA and share their course project progress"
                                            }
}