{
        "code":  "14-310",
        "name":  "Cybersecurity in our Daily Applications",
        "short_name":  "CYBERSECURITY APPLIC",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Information security is involved in our everyday applications from banking systems to IoT devices. With the increased amount of cybersecurity attacks, understanding key concepts in information security and privacy become essential in every application. This course Introduces students to key terminology in security and privacy explains the building blocks of cryptographic primitives that help achieve security properties Introduces issues affecting usable security and privacy, and provides a thorough understanding of a variety of userinterface attacks phishing, spam, clickbait, social engineering, etc. Help students assess examples motivated by real security attacks and reason about security and privacy",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The main objective of the course is to enable students to reason about information systems as they use these systems daily. Students will become familiar with key terminology in security and will learn how to make informed judgments about systems and applications.",
                                                    "key_topics":  "Cybersecurity key terminology, threat modeling, security in web, mobile and IoT applications, privacy, and humans role in cybersecurity.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "The course has in-class quizzes, in-class individual and group activities, and reading summaries",
                                                    "relevance":  "This course is relevant to students in any field. Nowadays, cybersecurity is affecting every field especially when a human makes a cybersecurity mistake. Such mistakes could be due to making an uninformed decision about clicking a link or trusting a third-party component. This course is beneficial for students from every major at CMU Qatar.",
                                                    "learning_resources":  "Canvas, office hours, recitations, recorded lectures",
                                                    "extra_time_commitment":  null
                                            }
}