{
        "code":  "15-181",
        "name":  "Demystifying AI",
        "short_name":  "DEMYSTIFYING AI",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(15-112 [] at least D) or (15-110 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [
                                            {
                                                    "code":  "11-485",
                                                    "id":  2107,
                                                    "name":  "Introduction to Deep Learning",
                                                    "units":  9.0
                                            },
                                            {
                                                    "code":  "07-128",
                                                    "id":  9463,
                                                    "name":  "First Year Immigration Course",
                                                    "units":  3.0
                                            },
                                            {
                                                    "code":  "10-315",
                                                    "id":  9508,
                                                    "name":  "Introduction to Machine Learning (SCS Majors)",
                                                    "units":  12.0
                                            },
                                            {
                                                    "code":  "10-301",
                                                    "id":  9565,
                                                    "name":  "Introduction to Machine Learning",
                                                    "units":  12.0
                                            },
                                            {
                                                    "code":  "15-281",
                                                    "id":  9742,
                                                    "name":  "Artificial Intelligence: Representation and Problem Solving",
                                                    "units":  12.0
                                            }
                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will pull back the curtains on artificial intelligence, helping you learn what it is, what it can do, how to use it, how it works, and what can go wrong. This course is designed for students that want to learn about AI and machine learning but dont have the course schedule bandwidth to build up the math and computing background required for fullfledged intro AI and ML courses, such as 15281 and 10301. Leveraging high school algebra and basic Python programming skills from 15110, well help you implement key pieces of AI techniques from the nearest neighbor algorithm to simple neural networks. Through inclass activities, weekly recitations, and course assignments, youll start to learn how to use AI systems, including how to make them intelligent, what data might be needed, and what can go wrong. Ethical discussions will be woven throughout the course to enable you to think critically about how AI impacts our society.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  "Artificial Intelligence, Machine Learning, Ethics",
                                                    "prerequisite_knowledge":  "Basic programming skills in Python as learned in 15-110 (15-112 is certainly sufficient). High school algebra I, e.g. graphic equations of lines and computing the distance between points.",
                                                    "assessment_structure":  "Exams/quizzes, written problem sets, and a series of mini-projects to learn about how AI systems work and how they can become biased and problematic.\nLearning Resources: Course website with lecture and recitation materials, online discussion forum",
                                                    "relevance":  "As artificial intelligence technology becomes more pervasive in both everyday products and mainstream media, it is increasingly important that all of us learn about the basic concepts behind AI. While computer science, calculus, linear algebra, and probability prerequisites are required to become an AI developer, students from any major can learn a myriad of machine learning and AI concepts by simply leveraging the student\u0027s knowledge of high school algebra and basic programming constructs.",
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}