{
        "code":  "15-151",
        "name":  "Mathematical Foundations for Computer Science",
        "short_name":  "MATH FOUNDATIONS CS",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "21-120 [] at least D"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [
                                    {
                                            "code":  "21-128",
                                            "id":  2621,
                                            "name":  "Mathematical Concepts and Proofs",
                                            "units":  12.0
                                    },
                                    {
                                            "code":  "21-127",
                                            "id":  2625,
                                            "name":  "Concepts of Mathematics",
                                            "units":  12.0
                                    }
                            ],
        "long_desc":  "CS majors only This course is offered to incoming Computer Science freshmen and focuses on the fundamental concepts in Mathematics that are of particular interest to Computer Science such as logic, sets,induction, functions, and combinatorics. These topics are used as a context in which students learn to formalize arguments using the methods of mathematical proof.  This course uses experimentation and collaboration as ways to gain better understanding of the material.  Open to CS freshmen only. NOTE students must achieve a C or better in order to use this course to satisfy the prerequisite for any subsequent Computer Science course.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://www.math.cmu.edu/~jmackey/151_128/welcome.html",
        "custom_fields":  {
                                                    "goals":  "Students learn to formalize arguments using mathematical proofs. Ability to reason logically and clearly. Ability to prove using elementary logic.",
                                                    "key_topics":  "Proofs, Induction, Functions and Sets, Combinatorics, Probability",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Each of the two high midterm scores: 20%, The low midterm score: 10%, Homework: 20%, Final Exam: 30%",
                                                    "relevance":  "Course for CS freshman designed to teach about fundamental concepts in mathematics.",
                                                    "learning_resources":  "Supplemental Reading",
                                                    "extra_time_commitment":  null
                                            }
}