{
        "code":  "15-259",
        "name":  "Probability and Computing",
        "short_name":  "PROBABILITY \u0026 COMPTG",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "((21-268 [] at least C) or (21-266 [] at least C) or (21-259 [] at least C) or (16-211 [] at least C)) and ((21-128 [] at least B) or (21-127 [] at least B) or (15-251 [] at least C) or (15-151 [] at least B))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [
                                            {
                                                    "code":  "21-325",
                                                    "id":  2381,
                                                    "name":  "Probability",
                                                    "units":  9.0
                                            },
                                            {
                                                    "code":  "36-218",
                                                    "id":  8831,
                                                    "name":  "Probability Theory for Computer Scientists",
                                                    "units":  9.0
                                            }
                                    ],
        "equiv":  [
                                    {
                                            "code":  "36-218",
                                            "id":  8831,
                                            "name":  "Probability Theory for Computer Scientists",
                                            "units":  9.0
                                    }
                            ],
        "long_desc":  "Probability theory is indispensable in computer science today. In areas such as artificial intelligence and computer science theory, probabilistic reasoning and randomization are central. Within networks and systems, probability is used to model uncertainty and queuing latency. This course gives an introduction to probability as it is used in computer science theory and practice, drawing on applications and current research developments as motivation. The course has 3 parts  Part I is an introduction to probability, including discrete and continuous random variables, heavy tails, simulation, Laplace transforms, ztransforms, and applications of generating functions. Part II is an indepth coverage of concentration inequalities, like the Chernoff bound and SLLN bounds, as well as their use in randomized algorithms.  Part III covers Markov chains both discretetime and continuoustime and stochastic processes and their application to queuing systems performance modeling. This is a fastpaced class which will cover more material than the other probability options and will cover it in greater depth.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://www.cs.cmu.edu/~harchol/PnC/class.html",
        "custom_fields":  {
                                                    "goals":  "Analyze probabilities and expectations using tools such as conditioning, independence, linearity of expectations. Compute expectation and variance of common discrete and continuous random variables. Apply ztransforms and Laplace transforms to derive higher moments of random variables. Prove elementary theorems on probability. Analyze tail probabilities via Markov and Chebyshev concentration inequalities. Understand basics of eventdriven simulation, including generating random variables for simulation and the Poisson arrival process. Derive statistical estimators, including maximum likelihood estimators and MAP estimators. Understand the application of probability to problems in machine learning, theoretical computer science, networking, cloud computing, and operations research.",
                                                    "key_topics":  "Probability on events, Discrete random variables, Continuous random variables, Moment generating functions (z-transforms and Laplace transforms), Heavy-tailed distributions, Poisson process, Event-driven simulation, Statistical Estimation, Statistical Inference, Bayesian Inference",
                                                    "prerequisite_knowledge":  "15-259 assumes NO PRIOR PROBABILITY/STATS classes, and will satisfy the Computer Science Probability/Statistics requirement. The course DOES assume that you have taken calculus (and still remember how to integrate, differentiate, and do Taylor-series expansions). 3D Calculus is a co-requisite for the class.",
                                                    "assessment_structure":  "Weekly homework -- worth 35% combined. Midterm 1 -- worth 20%. Midterm 2 -- worth 20%. Final -- worth 20%. Occasional Unannounced Quizzes -- worth 5%. Class Participation will allow you to move up a grade if you\u0027re at the border.",
                                                    "relevance":  "This course 15-259 is for undergraduates. Graduate students should enroll in 15-559.",
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}