{
        "code":  "15-282",
        "name":  "Artificial Intelligence for Medicine",
        "short_name":  "AI FOR MEDICINE",
        "units":  10.0,
        "min_units":  10.0,
        "max_units":  10.0,
        "prereqs":  {
                                        "text":  "15-112 [] at least C"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course introduces Artificial Intelligence AI and its recent applications in medicine for students with only a little background in computer science. It starts by motivating and defining AI, before folding over to a survey of some of its newest applications to medicine, including diagnosis, prognosis, drug discovery, and recommendations of individualized treatments, to mention just a few. Afterwards, it provides a birdseye view of some of the major AI techniques, including machine learning, deep neural networks, recommendation systems, ranked retrieval, and probabilistic graphical models. Finally, it concludes with a discussion on some of the concerns related to AI, including ethical issues, job security, society, and healthcare institutions, among others.  The course comprises a balance of lectures, case studies, live demonstrations of some medical AI applications, problemsolving  programming assignments, and research tasks. The students will be exposed to industry and researchbased perspectives on AI for medicine. In addition, they will learn through a course project the nuances of working with medical data and applying AI models to solve concrete problems in healthcare.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The course incorporates seven major learning outcomes. In particular, after finishing the course, each student will be able toa.Define AI and discuss what AI can and cannot do.b.Identify various AI applications in medicine and explain how they are transforming healthcare.c.Recognize the power of big data in enabling AI and describe the different types of data representations.d.Recognize the power of AI algorithms in solving medical problems and discuss how they can be applied in the medical field.e.Explain different AI concepts, including machine learning, deep learning, recommendation systems, ranked retrievals, and probabilistic graphical models, among others.f.Apply some AI techniques to solve realworld medical problems.g.Discuss several societal issues and ethical concerns surrounding AI.",
                                                    "key_topics":  "This course introduces Artificial Intelligence (AI) and its recent applications in medicine for students with only a little background in computer science. It starts by motivating and defining AI, before folding over to a survey of some of its newest applications to medicine, including diagnosis, prognosis, drug discovery, and recommendations of individualized treatments, to mention just a few. Afterwards, it provides a bird\u0027s-eye view of some of the major AI techniques, including machine learning, deep neural networks, recommendation systems, ranked retrieval, and probabilistic graphical models. Finally, it concludes with a discussion on some of the concerns related to AI, including ethical issues, job security, society, and healthcare institutions, among others.\n\nThe course comprises a balance of lectures, case studies, live demonstrations of some medical AI applications, problem-solving \u0026 programming assignments, and research tasks. The students will be exposed to industry- and research-based perspectives on AI for medicine. In addition, they will learn through a course project the nuances of working with medical data and applying AI models to solve concrete problems in healthcare.",
                                                    "prerequisite_knowledge":  "Fundamentals of Programming and Computer Science (i.e., 15-112",
                                                    "assessment_structure":  "Each student will receive a numeric score with a corresponding letter grade, based on a weighted average of the following:\n\n\na.\tProblem Sets: There will be 4 homework assignments, which will account for 15% of the final score. The lowest one will be dropped.\n\nb.\tQuiz: There will be 4 quizzes, which will account for 20% of the final score.\n\nc.\tExam: There will be two exams, midterm and final, which will account for 15% and 20%, respectively (or 35% collectively) of the final score.\n\nd.\tProject: There will be one applied learning project that is worth 25% of the final score.\n\ne.\tClass Participation and Attendance: Attendance of classes and participation in discussions will account for 5% of the final score.",
                                                    "relevance":  "Artificial Intelligence (AI) is transforming various sectors, including medicine. This course will teach students what is AI, take them through a journey of AI applications in medicine, and give them a practical experience in applying AI to solve real-world problems. It will demystify major AI concepts for them, including machine learning, neural networks, Bayesian networks, recommendation systems, data science, and ranked retrieval, among others. In addition, it will allow them to navigate several societal issues and ethical concerns that surround AI.",
                                                    "learning_resources":  "There is no specific textbook for the course, but certain notes and papers will be assigned for reading. In addition, the slides provided by the instructor will be self-contained. All course material will be posted on the course webpage.",
                                                    "extra_time_commitment":  null
                                            }
}