{
        "code":  "15-386",
        "name":  "Neural Computation",
        "short_name":  "NEURAL COMPUTATION",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "((15-112 [] at least C) or (15-122 [] at least C)) and (21-122 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Computational neuroscience is an interdisciplinary science that seeks to understand how the brain computes  to achieve  natural intelligence.  It seeks to understand the computational principles and mechanisms of intelligent behaviors and mental abilities  such as perception, language, motor control, and learning  by building artificial systems and computational models with the same capabilities. This course explores how neurons encode and process information, adapt and learn, communicate, cooperate, compete and compute at the individual level as well as at the levels of networks and systems. It will introduce basic concepts in computational modeling, information theory, signal processing, system analysis, statistical and probabilistic inference. Concrete examples will be drawn from the visual system and the motor systems,  and studied from computational, psychological and biological perspectives. Students will learn to perform computational experiments using Matlab and quantitative studies of neurons and neuronal networks.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will learn to perform quantitative analysis as well as computational experiments using Matlab and deep learning platforms.",
                                                    "key_topics":  "This course explores computational issues at multiple levels, from individual neurons to circuits and systems, with a view to bridging brain science and machine learning. It will cover basic models of neurons and circuits, computational models of learning, memories and inference, and quantitative approaches to neural system analysis in real and artifical systems. Concrete examples will be drawn from the visual system and the motor system, with emphasis on relating current deep learning research and the brain research, from hierarchical computation, attention, recurrent neural networks, to reinforcement learning.",
                                                    "prerequisite_knowledge":  "No prior background in biology or machine learning is assumed. Prerequisites: 15-100, 21-120 or permission of instructor. 21-241 preferred but not required.",
                                                    "assessment_structure":  "6 Assignments\t70%; Class participation/attendance/quizzes 10%; Midterm 10; Final Exam 10%; Optional term project (Replacement of 1 HM or Exam)\t10%",
                                                    "relevance":  "This course is for undergraduates. Graduate students should enroll in 15-686.",
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}