{
        "code":  "15-314",
        "name":  "Programming Language Semantics",
        "short_name":  "PRG LNG SEMANTICS",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "(15-251 [] at least C) and (15-312 [] at least C) and (15-150 [] at least C)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This lecture course introduces the foundational concepts and techniques of programming language semantics. The aim is to demonstrate the utility of a scientific approach, based on mathematics and logic, with applications to program analysis, language design, and compiler correctness. We focus on the most widely applicable frameworks for semantic description denotational, operational, and axiomatic semantics. We use semantics to analyze program behavior, guide the development of correct programs, prove correctness of a compiler, validate logics for program correctness, and derive general laws of program equivalence. We will discuss imperative and functional languages, sequential and parallel, as time permits.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  "1.\tThe denotational and operational styles of semantic description; criteria for choosing models: behavioral equivalence, compositionality, adequacy, full abstraction. A language of arithmetic expressions.\n2.\tSequential while-programs: direct- and continuation-style semantics. Partial and total correctness. Axiomatic semantics: Hoare logic and incorrectness logic. Declarations and scope.\n3.\tMachine code: continuation semantics. Foundations: Scott domains, continuity and least fixed-points. A compiler for imperative programs; compiler correctness and code optimizations. Axiomatic semantics: a Hoare logic for machine code\n4.\tSequential pointer-programs. Abstract models of store and heap. Denotational and operational semantics. Separation logic.\n5.\tConcurrency: shared memory models; fair execution; race conditions; safety and liveness; concurrent separation logic\n6.\tFunctional programs: types and polymorphism; call-by-value evaluation; denotational and operational semantics; progress and preservation",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Grading is based on homeworks and a (take-home) final exam. Students are encouraged to form study groups, but each student must do homework and exams individually.\nAll classes will be delivered using zoom.",
                                                    "relevance":  "This course is designed for advanced undergraduates with interests in the mathematical and logical foundations of programming languages.",
                                                    "learning_resources":  "Lecture notes and slides will be posted to canvas during the course. The following texts are suggested for optional additional reading, but they use different notation and do not cover all class material:\n1.\tReynolds, Theories of Programming Languages, Cambridge University Press, ISBN 0-521-59414-6.\n2.\tWinskel, The Formal Semantics of Programming Languages: An Intro- duction, MIT Press, ISBN 0-262-23169-7.",
                                                    "extra_time_commitment":  null
                                            }
}