{
        "code":  "15-462",
        "name":  "Computer Graphics",
        "short_name":  "COMPUTER GRAPHICS",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "((15-213 [] at least C) and (21-240 [] at least C) and (21-259 [] at least C)) or ((15-213 [] at least C) and (21-259 [] at least C) and (21-241 [] at least C)) or ((18-202 [] at least C) and (18-213 [] at least C))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course provides a comprehensive introduction to computer graphics. It focuses on fundamental concepts and techniques, and their crosscutting relationship to multiple problem domains in graphics rendering, animation, geometry, imaging. Topics include sampling, aliasing, interpolation, rasterization, geometric transformations, parameterization, visibility, compositing, filtering, convolution, curves  surfaces, geometric data structures, subdivision, meshing, spatial hierarchies, ray tracing, radiometry, reflectance, light fields, geometric optics, Monte Carlo rendering, importance sampling, camera models, highperformance ray tracing, differential equations, time integration, numerical differentiation, physicallybased animation, optimization, numerical linear algebra, inverse kinematics, Fourier methods, data fitting, examplebased synthesis.Students will learn through lectures, exercises, and through handson programming experience as they build a 3D modeling, rasterization, pathtracing, and animation utility, Scotty3D, in C.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Provide students with a strong basis in computer graphics techniques broadly, spatial transformations, geometry, rendering, and animation along with handson experience in the basics of these areas and knowledge of the state of the art.",
                                                    "key_topics":  "- rasterization\n- spatial transformations\n- geometric representations\n- the rendering equation\n- path tracing\n- animation\n- splines\n- meshes\n- sampling\n- numerical integration",
                                                    "prerequisite_knowledge":  "Basic vector calculus and linear algebra will be an important component of this course. Previous exposure to basic programming in C/C++ or similar languages is very helpful as course programming assignments will involve significant implementation effort.",
                                                    "assessment_structure":  "Students will be assessed through programming assignments (~70%), midterm/final exams (~20%), and course participation (~10%).",
                                                    "relevance":  "The techniques of Computer Graphics are essential to many aspects of modern life including visual effects in movies, layout design on web pages, visualization in scientific computing, CAD in industrial design, and real-time rendering for games. Graphics techniques are also the basis of emerging technologies, including developing and simulating autonomous vehicles, optimizing material structures, and robotic sensing systems.",
                                                    "learning_resources":  "Lecture slides are posted for commenting and discussion. Piazza is also used for discussion. Additional readings are suggested per lecture (see course page).",
                                                    "extra_time_commitment":  "This course 15-462 is for undergraduates. Graduate students should enroll in 15-662."
                                            }
}