{
        "code":  "15-418",
        "name":  "Parallel Computer Architecture and Programming",
        "short_name":  "PRLL COMP ARC \u0026 PGMG",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "15-213 [] at least C"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The fundamental principles and engineering tradeoffs involved in designing modern parallel computers, as well as the programming techniques to effectively utilize these machines. Topics include naming shared data, synchronizing threads, and the latency and bandwidth associated with communication. Case studies on sharedmemory, messagepassing, dataparallel and dataflow machines will be used to illustrate these techniques and tradeoffs. Programming assignments will be performed on one or more commercial multiprocessors, and there will be a significant course project.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://www.cs.cmu.edu/~15418/",
        "custom_fields":  {
                                                    "goals":  "Provide a deep understanding of the fundamental principles and engineering tradeoffs involved in designing modern parallel computing systems as well as to teach parallel programming techniques necessary to effectively utilize these machines.",
                                                    "key_topics":  "Parallel programming models / frameworks; Characteristics of parallel hardware; Ubiquitous computing workloads",
                                                    "prerequisite_knowledge":  "15-213 is required. Other experience with systems and C programming is valuable. This course 15-418 is for undergraduates. Graduate students should enroll in 15-618.",
                                                    "assessment_structure":  "Programming Assignments: 40 percent; Exams: 30 percent; Final Project: 25 percent; Participation: 5 percent",
                                                    "relevance":  "From smart phones, to multi-core CPUs and GPUs, to the world\u0027s largest supercomputers and web sites, parallel processing is ubiquitous in modern computing. This class covers how these systems operate and are programmed.",
                                                    "learning_resources":  "Piazza; Course website",
                                                    "extra_time_commitment":  null
                                            }
}