{
        "code":  "15-411",
        "name":  "Compiler Design",
        "short_name":  "COMPILER DESIGN",
        "units":  15.0,
        "min_units":  15.0,
        "max_units":  15.0,
        "prereqs":  {
                                        "text":  "15-213 [] at least C"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course covers the design and implementation of compiler and runtime systems for highlevel languages, and examines the interaction between language design, compiler design, and runtime organization. Topics covered include syntactic and lexical analysis, handling of userdefined types and typechecking, context analysis, code generation and optimization, and memory management and runtime organization.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://www.cs.cmu.edu/~411/",
        "custom_fields":  {
                                                    "goals":  "Distinguish the main phases of a stateoftheart compiler Understand static and dynamic semantics of an imperative language Develop parsers and lexers using parser generators and combinators Perform semantic analysis Translate abstract syntax trees to intermediate representations and static single assignment form Analyze the dataflow in an imperative language Perform standard compiler optimizations Generate efficient assembly code for a modern architecture Allocate registers using a graphcoloring algorithm Understand opportunities and limitations of compiler optimizations Appreciate design tradeoffs how representation affects optimizations Automatically manage memory using garbage collection Develop complex software following highlevel specifications",
                                                    "key_topics":  "structure of a compiler; static and dynamic semantics; compiler correctness; parsing and lexing; semantic analysis; code generation; static single assignment form; dataflow analysis; compiler optimizations; assembly code; register allocation; intermediate representations; automatic memory management",
                                                    "prerequisite_knowledge":  "Students are expected to have significant experience in a high-level programming language.",
                                                    "assessment_structure":  "set of homework assignments: 30%; labs: 70%",
                                                    "relevance":  "15-411 Lecture 2 Section R is reserved for students who are unable to register for an in-person section due to a government visa/travel restriction or a documented medical condition. Enrollment in this section will require university-level approval. Register for an in-person section unless you are absolutely certain when you register that you will not be able to attend in-person this Fall.",
                                                    "learning_resources":  "Github; Piazza; Optional text",
                                                    "extra_time_commitment":  null
                                            }
}