{
        "code":  "15-424",
        "name":  "Logical Foundations of Cyber-Physical Systems",
        "short_name":  "FNDN CYB PHY SYS",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "(15-122 [] at least C) and (21-120 [] at least C)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Cyberphysical systems CPSs combine cyber capabilities computation andor communication with physical capabilities motion or other physical processes. Cars, aircraft, and robots are prime examples, because they move physically in space in a way that is determined by discrete computerized control algorithms. Designing these algorithms to control CPSs is challenging due to their tight coupling with physical behavior. At the same time, it is vital that these algorithms be correct, since we rely on CPSs for safetycritical tasks like keeping aircraft from colliding. This course pursues the fundamental question How can we provide people with cyberphysical systems they can bet their lives on",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "http://lfcps.org/course/lfcps.html",
        "custom_fields":  {
                                                    "goals":  "This course will give you the required skills to formally analyze the CPSs that are all around us from power plants to pace makers and everything in between so that when you contribute to the design of a CPS, you are able to understand important safetycritical aspects and feel confident designing and analyzing system models. It will provide an excellent foundation for students who seek industry positions and for students interested in pursuing research.",
                                                    "key_topics":  "Cyber-Physical Systems\nDynamic Logic\nModels and Controls\nAxiomatics\nDifferential Equations Reasoning\nHybrid Games\nFormal Verification",
                                                    "prerequisite_knowledge":  "The course assumes prior exposure to basic computer programming and mathematical reasoning. This course covers the basic required mathematical and logical background of cyber-physical systems. You will be expected to follow the textbook as needed.\nThe 15-424 course counts as a Logics/Languages elective in the Computer Science curriculum. The 15-824 course fulfills the Programming Languages star requirement.",
                                                    "assessment_structure":  "11% Homework, 27% Labs, 20% Final project, 20% Midterms I+II, 20% Quiz. Your best dozen quizzes throughout the semester will determine your quiz score. Absent exceptional circumstances (such as unusually large discrepancies of exam and homework scores), grade assignment is based on total score percentages:\ngrade/total score: A 多90% B 多80% C 多70% D 多60% R \u003c60%",
                                                    "relevance":  "Preference to SCS students, graduate students should register for 15-624 (MS) or 15-824 (PhD)",
                                                    "learning_resources":  "Textbook, slides, videos, course website. https://lfcps.org/course/lfcps.html\n\nTools: KeYmaera X: An aXiomatic Tactical Theorem Prover for Hybrid System http://keymaeraX.org/",
                                                    "extra_time_commitment":  "Enroll in section A if possible; section R is online-only with recorded videos and active-learning quizzes, but requires discipline and organization. Students do not need university-level approval to enroll in section R. However, international students present in the U.S. cannot enroll in more than one REO class per semester."
                                            }
}