{
        "code":  "16-161",
        "name":  "ROB Seminar: Artificial Intelligence and Humanity",
        "short_name":  "ROB SEM: AI\u0026HUMANITY",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In 1965 British mathematician I.J. Good wrote, An ultraintelligent machine could design even better machines there would then unquestionably be an intelligence explosion, and the intelligence of man would be left far behind.  As we enter an age where companies like Uber are testing driverless cars in Pittsburgh and innovative interfaces like IBMs Watson can play jeopardy and learn techniques for medical diagnoses, how are we to negotiate an intelligence explosion that for many individuals might threaten the very notions of what it means to be human  The future of humantomachine relationships will likely define our historical epoch and yet, many young technologists and humanists underestimate the downstream impact of technological innovations on human society.  Presently, we have little choice but to attend to this rapidly anxietyridden question.  This seminar will attend to the challenge of present existential questions on what it means to be human read not machine in the context of a rapidly advancing technological age.  We will consider human narratives throughout history that exam how governments and individual citizens defined humanity in the context of slavery and colonialism as a framework for exploring and projecting what it means to be human in the age of rapidly advancing intelligent machines.  We will trace the technological advancements of the recent five decades and identify historical precedents and speculative narratives that help us to consider issues like labor, economic disparity, negotiations of power, human dignity and ethical responsibility within the context of human relations with advancing technological tools that are now coined, artificial intelligence.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Basic verbal and written communication practice basic introduction to framing a problem basic introduction to identifying argumentative framing basic introduction to collaborative practice.",
                                                    "key_topics":  "Students build relationships with their faculty team and classmates through collaborative inquiry on socially salient topics and practice communication skills. Intimate faculty-student relationships build as we cap ratios at one faculty member to every sixteen students.",
                                                    "prerequisite_knowledge":  "No prior knowledge required",
                                                    "assessment_structure":  "Students will be expected to read, write and participate in group seminar conversations.",
                                                    "relevance":  "Students will engage in collaborative framing of a problem. They will also gain exposure to a variety of disciplines and their respective approaches to analyzing and proposing possible solutions to the topics presented.",
                                                    "learning_resources":  "Learning resources will vary from one seminar to the next but will incorporate texts, visual materials, data sets, etc.",
                                                    "extra_time_commitment":  "Supplemental field trips and lectures in addition to class time."
                                            }
}