{
        "code":  "16-480",
        "name":  "IDeATe: Creative Soft Robotics",
        "short_name":  "CREATIVESOFTROBOTICS",
        "units":  10.0,
        "min_units":  10.0,
        "max_units":  10.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This experimental course offers unique topics situated at the intersection of robotics research and the arts, with a specific research focus that varies each semester.  In this course, students survey the state of an emerging research area, then design and fabricate experimental systems and artworks on the theme.  Students are guided through literature search and technical paper analysis to identify opportunities and techniques.  The textual study spans contemporary robotics and arts literature.  The project component is researchfocused and explores novel techniques in design, fabrication, programming, and control. The project sequence culminates in the collaborative design of expressive robotic systems which match technical innovation with a human need or artistic expression.   The initial iteration of the course focuses on soft robotics, an emerging discipline centered on devices constructed from compliant materials that incorporate sensing and actuation. The literature survey spans soft robotics and kinetic sculpture.  The projects  center on fabricating forms that incorporate actuators and sensors using silicone rubber cast into 3Dprinted and lasercut molds.  This course is offered by IDeATe and this iteration will satisfy minor requirements for IDeATe Soft Technologies or IDeATe Physical Computing.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://courses.ideate.cmu.edu/16-480",
        "custom_fields":  {
                                                    "goals":  "Upon completion of this course the students will be able toIdentify research areas within robotics.Read and critique academic papers.Search citation indices to discover academic literature.Present academic papers and lead discussion.Collaborate in teams to generate, create, evaluate, and document ideas and projects.Contribute productively to a discussion and critique environment with open responses, constructive criticism, and positive feedback.Document and reflect upon processes and finished assignments.Identify major research areas with the emerging discipline of Soft Robotics.Identify and critique kinetic art incorporating biomimetic and soft materials.Design molds for casting silicone rubber using 3Dprinting and lasercutting.Design compliant devices incorporating fluidic actuation, tendon actuation, fluidic sensing, or conventional sensor elements.",
                                                    "key_topics":  "robotics research, human-robot interaction, kinetic art, research literature study, interdisciplinary collaboration, wearable art, soft robotics, fluidic actuators, inflatable robots, mold design, sensor design, compliant materials, bio-inspired design",
                                                    "prerequisite_knowledge":  "Senior-level technical skills within a student\u0027s own discipline plus the disposition to participate in a seminar-style course addressing an emerging field. Experience recommended with any subset of robotics, kinetic sculpture, soft material fabrication, 3D CAD, or mechanical design",
                                                    "assessment_structure":  "The assessment includes in-class discussion, presentation, hands-on project demonstrations, and project reports. The final grade will be equally weighted between literature study and project results",
                                                    "relevance":  "This course offers exposure to emerging robotics technical disciplines in a context promoting transfer to the arts. It will develop skills in discovering and reading technical research literature. It promotes critical thinking at the juncture of technology and artistic practice.\n\nSoft robotics represents a technical frontier within robotics. The potential commercial applications include human-robot interaction, medicine, and compliant robot manipulation. The potential artistic and cultural applications include biomimetic sculpture, costume, and human body extension.",
                                                    "learning_resources":  "course web site with bibliographies, reference designs, and resource material; pre-recorded video lectures",
                                                    "extra_time_commitment":  "Homework will include reading academic literature, developing original prototype designs, and viewing pre-recorded video lectures (6-8 hours per week)."
                                            }
}