{
        "code":  "17-333",
        "name":  "Privacy Policy, Law, and Technology",
        "short_name":  "PRIVCY POLCY LAW TEC",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course focuses on policy issues related to privacy from the perspectives of governments, organizations, and individuals. We will begin with a historical and philosophical study of privacy and then explore recent public policy issues. We will examine the privacy protections provided by laws and regulations, as well as the way technology can be used to protect privacy. We will emphasize technologyrelated privacy concerns and mitigation, for example social networks, smartphones, behavioral advertising and tools to prevent targeted advertising and tracking, anonymous communication systems, big data, and drones. This is part of a series of courses offered as part of the MSITPrivacy Engineering masters program. These courses may be taken in any order or simultaneously. Foundations of Privacy Fall semester offers more indepth coverage of technologies and algorithms used to reason about and protect privacy. Engineering Privacy in Software Spring semester focuses on the methods and tools needed to design systems for privacy. This course is intended primarily for graduate students and advanced undergraduate students with some technical background. Programming skills are not required. 8733, 19608, and 95818 are 12unit courses for PhD students. Students enrolled under these course numbers will have extra assignments and will be expected to do a project suitable for publication. 8533 is a 9unit course for undergraduate students. Masters students may register for any of the course numbers permitted by their program. This course will include a lot of reading, writing, and class discussion. Students will be able to tailor their assignments to their skills and interests. However, all students will be expected to do some writing and some technical work.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Be able to discuss why privacy is important to societyBe familiar with the fair information practice principles as well as the privacy law and policy landscape in the United StatesUnderstand the differences between privacy regulation in the US and EU, and be able to discuss different regulatory approaches to privacyBe able to read, understand, and evaluate privacy policiesUnderstand the mechanics of online tracking and other technologies with privacy implicationsBe able to communicate the privacy implications of a technology with policymakers, lawyers, and engineersBe prepared to pass the IAPP Certified Information Privacy Professional exams",
                                                    "key_topics":  "philosophical foundations of privacy\ntechnology-related privacy concerns\nregulatory frameworks for privacy\nrecent public policy issues in privacy\nnotice and choice\nprivacy policies\nFair Information Practice Principles\ntechnologies to protect privacy",
                                                    "prerequisite_knowledge":  "Some technical background (e.g., a basic understanding of computer systems and the Internet).",
                                                    "assessment_structure":  "10% class participation (attendance, participation in class and online discussion)\n15% quizzes\n25% homework assignments\n25% project\n25% midterms",
                                                    "relevance":  "This course is for undergraduate, masters, and PhD students interested in policy issues related to privacy and technology from the perspective of governments, organizations, and individuals. The course is part of a three-course series of privacy courses offered as part of the MSIT-Privacy Engineering masters program. The course also fulfills one of the requirements for the undergraduate concentration in security and privacy (Security and Privacy Context---Policy).",
                                                    "learning_resources":  "Slides\nTextbooks\nScientific papers\nPiazza\nOptional textbooks",
                                                    "extra_time_commitment":  "Meetings with teammates while working on group projects."
                                            }
}