{
        "code":  "17-355",
        "name":  "Program Analysis",
        "short_name":  "PROGRAM ANALYSIS",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "(15-251 [] at least C) and ((15-150 [] at least C) or (17-214 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course covers both foundations and practical aspects of the automated analysis of programs, which is becoming increasingly critical to find software errors and assure program correctness. The theory of abstract interpretation captures the essence of a broad range of program analyses and supports reasoning about their correctness. Building on this foundation, the course will describe program representations, data flow analysis, alias analysis, interprocedural analysis, dynamic analysis, Hoare Logic and verification, program synthesis and repair, model checking, and symbolic execution. Through assignments and projects, students will design and implement practical analysis tools that find bugs and verify properties of software. This course satisfies the Logic and Languages constrained elective category of the Computer Science major, the Theoretical Foundations requirement of the Computer Science masters degree, and the Technical Software Engineering requirement for the Software Engineering minor.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://cmu-program-analysis.github.io/",
        "custom_fields":  {
                                                    "goals":  "Students will gain a theoretical and practical understanding of program analysis and the ability to apply it to realworld problems",
                                                    "key_topics":  "This course covers both foundations and practical aspects of the automated analysis of programs, including applications to finding software errors and assuring program correctness.",
                                                    "prerequisite_knowledge":  "mathematical maturity; familiarity with higher-order OO or functional programming",
                                                    "assessment_structure":  "There will be assignments, a midterm, a final project, and in-class exercises",
                                                    "relevance":  "Students will learn to design, implement, and apply analysis techniques that find bugs and verify programs",
                                                    "learning_resources":  "Course notes as well as a supplementary textbook, Principles of Program Analysis",
                                                    "extra_time_commitment":  null
                                            }
}