{
        "code":  "17-425",
        "name":  "Introduction to Social Networks",
        "short_name":  "INTRO SOCIAL NETWORK",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Ever wondered how TikTok trends go viral, why some memes explode while others flop, or how influencers turn millions of followers into multimilliondollar brands What makes a social media recommendation algorithm so effective and so toxic at the same time How do online echo chambers and polarization emerge in social media platforms Why does Linux and the broader opensource ecosystem thrive despite weak economic incentives Why do complex software systems sometimes fail despite being wellengineered How can you land your dream jobs and get ahead in life How does mass adoption of technological innovations e.g., Bitcoin unfold Underlying these seemingly unrelated questions is the powerful influence of social networks, the collection of on and offline connections that people form with one another. This course dives into the science of social networks, a powerful framework that offers explanations to these offline and social media phenomena. The course introduces key concepts and measures in network science with concrete examples that help to understand how tech giants, digital marketers, and top influencers stay ahead in the digital age. Students will be trained how to effectively use network analysis software and visualization tools for reaching deeper insights about our social world.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}