{
        "code":  "17-402",
        "name":  "AI and Emerging Economies",
        "short_name":  "AI \u0026 EMERGING ECON",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The course will cover some of the unique aspects of emerging economies as it relates to AI consumption and responsible AI development. The importance of local data and domain knowledge will be illustrated.  Germane to budding technologists, entrepreneurs and policy influencers. Multidisciplinary.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "An appreciation for the responsible use and development of AI in emerging economies. Collaboration with other global CMU campuses for projects",
                                                    "key_topics":  "An understanding of technical as well as societal / policy challenges; congruence with UN SDG goals. AI for all. Critical and creative thinking; problem solving using AI. Instill appreciation of multiple solution objectives: Accurate, Bias-free, Explainable. Instill importance of regional / local data and domain knowledge. Unique aspects of emerging economies and role of Data, AI. Socially-responsible (low-cost innovation) fueled by AI. AI\u0027s increased role in the post-pandemic world. \"Intrapreneurship\" as well as Entrepreneurship implications.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Class participation, a quiz and a final project / paper. Small (3 to 5-person) diverse groups (for projects).",
                                                    "relevance":  "AI is becoming ubiquitous, touching upon all spheres of life: Health, Wealth and Wisdom. An understanding of technical as well as societal / policy challenges (including for example, congruence with UN SDG goals) is important for professionals and future leaders in society. Given that CMU-Q has students hailing from countries ranging from Albania to Vietnam, the unique aspects at the cross-section of AI and emerging economies are worth delving into. Key concepts - via a diverse set of case studies - will be presented and analyzed. The focus will be on critical and creative thinking; and, problem solving using data and AI. The course will also provide an opportunity to work in diverse, cross-border teams (for the projects). Relevance and creative uses of local data and domain knowledge will be illustrated. Opinions from other thought leaders - via guest lectures - will round out the content. The syllabus will be informed by the instructor\u0027s recent experience with the global course around AI Grand Challenges. Many of the class projects therein touched upon emerging economy issues and that is where the idea for this course germinated! Also, the course will underscore the importance of better communication and consensus - a sine qua non for trust and access - among AI producers and AI consumers (a majority of whom are based in emerging economies).",
                                                    "learning_resources":  "Case studies such as: https://www.wired.com/story/clever-strategy-distribute-covid-aid-satellite-data/ https://www.mosip.io/ https://sunbird.org/ (and the general concept of Digital Public Goods and possible AI overlays) along w/ the instructor\u0027s research / articles such as: https://www.rediff.com/business/column/what-is-made-in-india-ai/20191125.htm Artificial Intelligence\u0027s Grand Challenges: Past, Present, and Future (w/ commentary from six thought leaders incl. Francesca Rossi, AAAI President-Elect and Frank Chen of VC firm a16z) that appeared in the 2021 Spring Issue of AI Magazine. That article has many relevant references which also will be summarized. Other references such as https://www.nature.com/articles/s41467-019-14108-y (AI and UN SDG goals) https://ai100.stanford.edu/2021-report/standing-questions-and-responses/sq3-what-are-most-inspiring-open-grand-challenge Jupyter notebook / Google Colab (for any groups wanting to do a hands-on project). Shared Google sheets; Zoom sessions. Cross-border group activities.",
                                                    "extra_time_commitment":  null
                                            }
}