{
        "code":  "18-090",
        "name":  "Twisted Signals: Multimedia Processing for the Arts",
        "short_name":  "TWST SIG: MLTMD PRO",
        "units":  10.0,
        "min_units":  10.0,
        "max_units":  10.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "[IDeATe portal course  This course presents an overview on manipulating and synthesizing sound, video, and control signals.  Signals are the raw materials used in many forms of electronic art and design  electronic music, interactive art, video art, kinetic sculpture, and more. In these fields, signals are used to represent information about sound, images, sensors, and movement. By transforming and manipulating these types of signals, we are able to create powerful new tools for digital art, multimedia applications, music, responsive environments, video and sound installation, smart products, and beyond.  In this course we will study Signal Processing from a practical pointofview, developing tools that can be easily integrated into artmaking using the graphical programming environment Max a.k.a. MaxMSPJitter.  We will present a survey of Signal Processing techniques used in the sonic and visual arts, and will discuss the mathematical theories underlying these techniques.  Students will be encouraged to combine, modify, and extend working examples of software to create original digital artworks.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Present a survey of Signal Processing techniques that are used in the sonic and visual arts. Develop a working knowledge of how to implement, combine, and modify Signal Processing techniques, and to integrate these techniques into ones artmaking. Develop a familiarity with the mathematical concepts underlying Signal Processing techniques. Develop proficiency in a widelyused coding environment for the digital arts.",
                                                    "key_topics":  "This course presents an overview on manipulating and synthesizing sound, video, and control signals to create electronic artwork. The course presents a survey of signal processing techniques used in the sonic and visual arts, and will discuss the mathematical theories underlying these techniques. This is done from a practical point-of-view, developing tools that can be easily integrated into art-making using the graphical programming environment Max (a.k.a. Max/MSP/Jitter). Students will be in the course will combine, modify, and extend working examples of software to create original digital artworks.",
                                                    "prerequisite_knowledge":  "There are not requirements other than basic computer skills and an interest in creating electronic artwork.",
                                                    "assessment_structure":  "Grading for the course is based on four short-term assignments, two long-term projects, quizzes, and class participation.",
                                                    "relevance":  "Developing a basic understanding of signal processing techniques is an important fundamental skill for digital artists and designers. This knowledge is highly transferable to many different computing platforms and mediums and it encourages critical inquiry about one\u0027s digital environment.",
                                                    "learning_resources":  "The course directs students in navigating learning applications and web pages with interactive materials relevant to the coursework. The students are also presented with access to large collection of coding examples that demonstrates the basic concepts covered during the in-class lectures.",
                                                    "extra_time_commitment":  "Students are required to deliver assignments and projects that will be developed outside of regular course meetings."
                                            }
}