{
        "code":  "18-100",
        "name":  "Introduction to Electrical and Computer Engineering",
        "short_name":  "INTRO ELEC COMP ENG",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [
                                        {
                                                "code":  "21-120",
                                                "id":  2627,
                                                "name":  "Differential and Integral Calculus",
                                                "units":  10.0
                                        }
                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The goals of this freshman engineering course are  To introduce basic concepts in electrical and computer engineering in an integrated manner  To motivate basic concepts in the context of real applications  To illustrate a logical way of thinking about problems and their solutions, and  To convey the excitement of the profession. These goals are attained through analysis, construction and testing of an electromechanical system e.g., a robot that incorporates concepts from a broad range of areas within Electrical and Computer Engineering. Some of the specific topics that will be covered include system decomposition, ideal and real sources, Kirchhoffs Current and Voltage Laws, Ohms Law, piecewise linear modeling of nonlinear circuit elements, Ideal OpAmp characteristics, combinational logic circuits, Karnaugh Maps, FlipFlops, sequential logic circuits, and finite state machines. 3 hrs. lec., 1 hr. rec., 3 hr. lab.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students should gain an understanding of the scope of activities within the discipline of ECE. Students should develop experiences with basic problem solving in ECE contexts and should learn the basic vocabulary associated with a wide range of ECE problems. Students should also gain handson experience building interesting circuits and systems in hardware and software laboratories leading to their development of qualitative intuition about how things work in ECE.",
                                                    "key_topics":  "Broadly, this course addresses a wide range of topics in ECE; e.g., electronic devices, circuit analysis, operational amplifier circuits, noise, signal-to-noise ratio, analog filters, digitizing signals, digital filters, logic design, finite state machines, microprocessor architecture, assembly language programming, and communications channels.",
                                                    "prerequisite_knowledge":  "High school proficiency with trigonometry and complex numbers necessary. Some basic calculus proficiency is helpful.",
                                                    "assessment_structure":  "This course incorporates 10 Homeworks (25%), 10 Laboratory Exercises (30%), and Exams (45%). Note, all Laboratory Exercises must be completed to receive a passing grade (missed Lab Exercises must be made up).",
                                                    "relevance":  "This course gives students a picture of the breadth of topics that are studied in Electrical and Computer Engineering.",
                                                    "learning_resources":  "Course textbook, Lecture Notes (via Canvas), Weekly SI / EXCEL review sessions helping with problem solving",
                                                    "extra_time_commitment":  "Weekly lab meetings"
                                            }
}