{
        "code":  "18-202",
        "name":  "Mathematical Foundations of Electrical Engineering",
        "short_name":  "MATH FNDTN ELEC ENGR",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "21-122 [] at least C"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [
                                    {
                                            "code":  "18-205",
                                            "id":  7346,
                                            "name":  null,
                                            "units":  0.0
                                    }
                            ],
        "long_desc":  "This course covers topics from engineering mathematics that serve as foundations for descriptions of electrical engineering devices and systems. It is the corequisite mathematics course for 18220, Fundamentals of Electrical Engineering. The topics include 1.MATLAB as a robust computational tool, used to reinforce, enrich and integrate ideas throughout the course, including software exercises and projects in combination with homework assignments 2.Complex Analysis, including rectangular and polar representations in the complex plane with associated forms of complex arithmetic, powers, roots and complex logarithms, complex differentiation, analytic functions and CauchyRiemann equations, complex Taylor series, complex exponential, sinusoidal and hyperbolic functions, and Eulers formula 3.Fourier Analysis, including orthogonality of sinusoids, trigonometric and exponential forms of Fourier series, Fourier integrals and Fourier transforms 4.Linear, ConstantCoefficient Differential Equations, including complex exponential solutions to homogeneous equations and particular solutions with polynomial and sinusoidal driving functions described by phasors 5.Difference Equations, with emphasis upon their relationship to differential equations, and 6.Linear Algebra and Matrices, including matrix arithmetic, linear systems of equations and Gaussian elimination, vector spaces and rank of matrices, matrix inverses and determinants, eigenvalue problems and their relationship to systems of homogeneous differential equations.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The objective is to provide basic background in mathematical tools and techniques, including set theory, basic complex analysis, differential equations and linear algebra, that are highly relevant to major technical disciplines in electrical and computer engineering.",
                                                    "key_topics":  "Engineering mathematics including: Rudiments of Set Theory, Complex Analysis, Vector and Matrix Calculus, Determinants. Inverses. Linear Algebra, Vector spaces. Linear independence. Scalar products. Eigenvalues and eigenvectors. Linear transforms. Systems of linear algebraic equations. Linear constant coefficients ordinary difference and differential equations. Systems of linear first order differential and difference equations.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Working examples during recitations, weekly homeworks, midterms and final exam, and occasional quizzes",
                                                    "relevance":  "The course covers topics from engineering mathematics that serve as foundations for descriptions of electrical engineering devices, signals, and systems.",
                                                    "learning_resources":  "Lecture notes for the entire course. The notes list additional references.",
                                                    "extra_time_commitment":  "Each student is assigned to attend a one-hour tutorial session weekly. These are held in the evenings, Monday through Thursday."
                                            }
}