{
        "code":  "18-335",
        "name":  "Secure Software Systems",
        "short_name":  "SEC SOFTWARE SYS",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "((18-330 [] at least C) or (15-330 [] at least C) or (18-631 [] at least C) or (14-741 [] at least C) or (18-730 [] at least C)) and ((15-213 [] at least C) or (18-613 [] at least C) or (15-513 [] at least C) or (14-513 [] at least C) or (18-213 [] at least C))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Poor software design and engineering are the root causes of most security vulnerabilities in deployed systems today. Moreover, with code mobility now commonplaceparticularly in the context of web technologies and digital rights managementsystem designers are increasingly faced with protecting hosts from foreign software and protecting software from foreign hosts running it. This class takes a close look at software as a mechanism for attack, as a tool for protecting resources, and as a resource to be defended. Topics covered include the software design process choices of programming languages, operating systems, databases and distributed object platforms for building secure systems common software vulnerabilities, such as buffer overflows and race conditions auditing software proving properties of software software and data watermarking code obfuscation tamper resistant software and the benefits of open and closed source development.  Students in 18335 will share lectures and homeworks with students in 18732. However, 18732 has additional requirements not shared by 18335, including the requirement to produce scribe notes and to practice and demonstrate the ability to read and summarize scientific papers on the topics covered by the course.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students completing this course will learn how to Reason about and apply general principles of secure software system design, implementation, and analysis Identify common attacks and the vulnerabilities that enable them Assess the merits and limitations of existing and proposed software defenses Find and fix vulnerabilities in softwareUltimately, students should leave able to design, build, and assess secure software systems.",
                                                    "key_topics":  "Topics covered include the software design process; choices of programming languages, operating systems, databases and distributed object platforms for building secure systems; common software vulnerabilities, such as buffer overflows and race conditions; auditing software; proving properties of software; software and data watermarking; code obfuscation; tamper resistant software; and the benefits of open and closed source development.",
                                                    "prerequisite_knowledge":  "Students are expected to have a working knowledge of C programming and previous experience with security, e.g., completing an Introduction to Security course.",
                                                    "assessment_structure":  "The final grade will be determined by exams, class participation, and homework assignments",
                                                    "relevance":  "Poor software design and engineering are the root causes of most security vulnerabilities in deployed systems today. Security expertise is in high demand; there currently about half a million cybersecurity-related job openings in the United States",
                                                    "learning_resources":  "Students can make use of the course website and assigned (plus optional) academic readings",
                                                    "extra_time_commitment":  null
                                            }
}