{
        "code":  "18-330",
        "name":  "Introduction to Computer Security",
        "short_name":  "INTRO TO COMP SEC",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "18-213 [] at least C"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [
                                    {
                                            "code":  "18-487",
                                            "id":  80,
                                            "name":  "Introduction to Computer Security",
                                            "units":  12.0
                                    },
                                    {
                                            "code":  "15-330",
                                            "id":  8936,
                                            "name":  "Introduction to Computer Security",
                                            "units":  12.0
                                    }
                            ],
        "long_desc":  "Security is becoming one of the core requirements in the design of critical systems. This course will introduce students to the introlevel fundamental knowledge of computer security and applied cryptography. Students will learn the basic concepts in computer security including software vulnerability analysis and defense, networking and wireless security, and applied cryptography. Students will also learn the fundamental methodology for how to design and analyze security critical systems.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will master the distinguishing feature of the security field, which is the ubiquitous need to consider an adversary, and the resulting interplay between attack and defense that routinely advances both theory and practice. After completing this course, students will be able to understand and reason about widelydeployed defensive techniques and securebydesign approaches as part of this process, students will learn about the the attacks that motivate the defenses and acquire the adversarial mindset that leads to new forms of attack. Ultimately, students will learn fundamental principles for designing, analyzing, and reasoning about security critical systems.",
                                                    "key_topics":  "This course will introduce students to the fundamentals of computer security. We will focus on software security, applied cryptography, systems security, privacy, and usable security. A recurring theme will be security definitions, what kinds of security vulnerabilities may arise, and how to identify, fix, and prevent vulnerabilities.",
                                                    "prerequisite_knowledge":  "To be successful, students should have a working knowledge of computer systems, e.g., machine-level code, memory organization and layout, how to write and understand C code, and basic computer networking.",
                                                    "assessment_structure":  "Students will be assessed via assignments and exams.",
                                                    "relevance":  "Nearly all modern software and networked systems are, or will be, exposed to attackers who attempt to subvert the system\u0027s intended goals. When successful, such attacks can have devastating consequences for individuals, companies, and society. This course will help students understand the threats their software and systems will face, as well as the tools they can use to defend them.\n\nFor students in CSD and ECE, this course is also the entrypoint for the Security Concentration.",
                                                    "learning_resources":  "Students will have access to course web pages, online discussion forums, seminal papers, and cutting-edge scientific publications.",
                                                    "extra_time_commitment":  null
                                            }
}