{
        "code":  "18-482",
        "name":  "Telecommunications Technology and Policy for the Internet Age",
        "short_name":  "TELCOM TCH POL \u0026 MGT",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "(73-102 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [
                                    {
                                            "code":  "73-100",
                                            "id":  4208,
                                            "name":  "Principles of Economics",
                                            "units":  9.0
                                    }
                            ],
        "long_desc":  "Modern telecommunications is the nervous system of society.  The Internet and wireless communications have transformed every aspect of our modern life.  This course provides a comprehensive introduction to basic principles of telecommunications technology and the legal, economic, and regulatory environment of todays networks.  Topics covered include the fundamentals of communication network technologies, including video, voice, and data networks the rising dominance of wireless networks principles behind telecommunications regulation from common carrier law and natural monopoly to information diversity, privacy and national security traffic differentiation on the Internet and the debate over network neutrality universal service and the digital divide mergers, antitrust, and the changing industrial structure of the communications sector.  We will explore current topical questions such as the future of competition the shift of entertainment video from cable and satellite to Internet delivery how cloud computing concepts are transforming networks and communications support for the Internet of Things.  Comparison with European approaches to communications regulation.  Special emphasis on how new technologies have altered, and are altered by, regulation.  Junior, Senior or graduate standing required.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}