{
        "code":  "18-441",
        "name":  "Computer Networks",
        "short_name":  "COMP NETWORKS",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "18-213 [] at least C"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [
                                            {
                                                    "code":  "18-741",
                                                    "id":  7566,
                                                    "name":  "Computer Networks",
                                                    "units":  12.0
                                            }
                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The Internet has transformed our everyday lives, bringing people closer together and powering multibillion dollar industries. The mobile revolution has brought Internet connectivity to the lastmile, connecting billions of users worldwide. But how does the Internet work What do oft repeated acronyms like LTE, TCP, WWW or a HTTP actually mean and how do they work This course introduces fundamental concepts of computer networks that form the building blocks of the Internet. We trace the journey of messages sent over the Internet from bits in a computer or phone to packets and eventually signals over the air or wires. We describe concepts that are common to and differentiate traditional wired computer networks from wireless and mobile networks. Finally, we build up to exciting new trends in computer networks such as the Internet of Things, 5G and software defined networking. Topics include physical layer and coding CDMA, OFDM, etc. data link protocol flow control, congestion control, routing local area networks Ethernet, WiFi, etc. transport layer and introduction to cellular LTE and 5G networks. A final project asks you to a build a HTTP video server of your own.   This course is crosslisted with 18741  both editions will share Lectures and Recitations. However, students in the two courses will receive different exams and will have a different project. The students in the two versions of the course will be graded on a separate curve.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students should be able to program, configure and debug computer networks and networked systems. Students should have a working knowledge of the principles of how the Internet works from wireless networks cellular, WiFi, etc. to wired networks Ethernet cutting across layers.",
                                                    "key_topics":  "Topics include: physical layer and coding (CDMA, OFDM, etc.); data link protocol; flow control, congestion control, routing; local area networks (Ethernet, Wi-Fi, etc.); transport layer; and introduction to cellular (LTE) and 5-G networks.",
                                                    "prerequisite_knowledge":  "Students should have the basic ability to program in C or Java (e.g. from 213). Students should also have a basic understanding of probability and statistics.",
                                                    "assessment_structure":  "15% - Quizzes (in class), 35% - Projects, 50% - Exams",
                                                    "relevance":  "The course provides a foundation for computer networks, both wired and wireless, and exposes students to network programming and working with networked systems.",
                                                    "learning_resources":  "Students will have access to textbooks, course website (canvas) with reading material, presentations.",
                                                    "extra_time_commitment":  null
                                            }
}