{
        "code":  "18-411",
        "name":  "Computational Techniques for Data Science and Engineering",
        "short_name":  "COMP TECHNIQUES ENG",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "((15-110 [] at least C) or (15-112 [] at least D)) and (21-120 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course covers mathematical techniques that permit formulation of equations that often emerge out of engineering and science problems or experimental data in a manner that makes them computationally tractable for numerical solutions and analysis.  Numerical approaches to solving engineering or science equations allow one to perform computer simulations that can often answer key questions without actual experimentation which can be costly and timeconsuming. The course is divided into two major modules.   The first develops foundational background in modeling, computers, error analysis, linear algebra, regression, and curve fitting. To illustrate applications of the main concepts of the first module, we discuss how to use them in machine learning, specifically in deep learning.   Students carry out a deep learning project of their choosing to sharpen their comprehension of both the mathematics behind deep learning, and the machine learning algorithms that enable the most common applications of deep learning.  The second module builds on the first to develop skills in numerical differentiation and integration and continues with techniques for computational solution of ordinary and partial differential equations that arise from physical or engineering problems.  Students learn how to set up these equations in a manner that allows numerical solutions to be obtained by either writing simple computer code or macros that interface with opensource Python code or commercially available software packages such as MATLAB or Mathematica.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Develop facility to recast equations into forms that are amenable to computer solution. Learn how to set up computer simulations.",
                                                    "key_topics":  "Module 1: Linear algebra - with a few practical examples in machine learning and deep learning; applications in curve fitting; modeling and error Analysis;\nModule 2: Numerical differentiation and integration, numerical ordinary differential equations, and numerical partial differential equations.",
                                                    "prerequisite_knowledge":  "Some understanding of algebra, calculus, and familiarity with simple first-order, ordinary differential equations. Computer literacy (and some facility with the MATLAB or Mathematica software packages).",
                                                    "assessment_structure":  "Problem sets (7) - 20%; mini project (1) - 25%; in-class tests (2) - 50%; attendance and class participation - 5%.",
                                                    "relevance":  "How to solve mathematical equations with relevance to engineering applications numerically. Recasting of equations into formats that permit solution with simple computer programs (or macros).",
                                                    "learning_resources":  "Course textbook - Numerical Methods for Engineers, by Steven C. Chapra and Raymond P. Canale; Any programming resource (MatLab, Mathematica, C++ or Python).",
                                                    "extra_time_commitment":  null
                                            }
}