{
        "code":  "18-540",
        "name":  "Rapid Prototyping of Computer Systems",
        "short_name":  "RAPID PROTOTYPING",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "((18-491 [] at least C) or (18-370 [] at least C) or (18-320 [] at least C)) and ((18-340 [] at least C) or (18-341 [] at least C) or (18-349 [] at least C)) and (18-213 [] at least D) and (18-220 [] at least D) and (18-240 [] at least D) and (18-290 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This is a projectoriented course which will deal with all four aspects of project development the application, the artifact, the computeraided design environment, and the physical prototyping facilities. The class, in conjunction with the instructors, will develop specifications for a mobile computer to assist in inspection and maintenance. The application will be partitioned between human computer interaction, electronics, industrial design, mechanical, and software components. The class will be divided into groups to specify, design, and implement the various subsystems. The goal is to produce a working hardwaresoftware prototype of the system and to evaluate the user acceptability of the system. We will also monitor our progress in the design process by capturing our design escapes errors with the Orthogonal Defect Classification ODC. Upon completion of this course the student will be able to generate systems specifications from a perceived need partition functionality between hardware and software produce interface specifications for a system composed of numerous subsystems use computeraided design tools fabricate, integrate, and debug a hardwaresoftware system and evaluate the system in the context of an end user application. Senior standing is required. This course is crosslisted as 18745",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The course is divided into three major phases Conceptualization, Detailed Design, and ImplementationCONCEPTUALIZATION Problem Definition Define the problem, perform requirements analysis, and evaluate user needs. Create a Product Design Specification including attributes such as functionality, cost, performance, technology acquisition, and fabrication techniques. Technology Survey A survey of available technology further refines the Product Design Specification. New components are acquired and evaluated. Reviews of current practice as well as discussions with end users generate interactive scenarios. System Architecture Specification The system architecture is developed. Topics such as local versus distributed processing, position sensing, computerhuman interface, and information updating must be addressed. Planning includes interdependencies between the technologies, people, and resources available in the course. Subsystem Specification The system functionality is partitioned and assigned to hardware andor software subsystems. Refinement of the Product Design Specification including performance, interface, and evaluation criteria.DETAILED DESIGN Detailed Design Each subsystem is designed supported by contemporary computeraided design tools. Human computer interaction studies are designed in conjunction with mechanicalelectronicsoftware mockups to provide data for design decisions. IMPLEMENTATION Implementation The detailed hardwaresoftware designs are implemented using both oncampus and offcampus facilities. System Integration The various hardware and software subsystems are individually tested and integrated into a working system. The system is evaluated through controlled user experiments. Methodology Evaluation As a final phase, the methodology followed in the course is quantitatively and qualitatively evaluated and modifications suggested.",
                                                    "key_topics":  "Upon completion of this course the student will be able to: generate systems specifications from a perceived need; partition functionality between hardware and software; produce interface specifications for a system composed of numerous subsystems; use computer-aided development tools; fabricate, integrate, and debug a hardware/software system; and evaluate the system in the context of an end user application.",
                                                    "prerequisite_knowledge":  "Senior standing in the students major (Electrical and Computer Engineering, Computer Science, Human Computer Interaction, Mechanical Engineering, Design)",
                                                    "assessment_structure":  "The course is project oriented with a series of phases. In general, each phase culminate with a written design document and an oral design review. Later phases also include a demonstration. Students are graded in terms of classroom participation, written documents, oral presentations, design methodology, and demonstrations. Individual feedback is given in performance reviews at the end of each major presentation. The relative weight for course grading for each of the phases is roughly as follows:\n- Technology Feasibility, System/Subsystem Specification - 30%\n- Detailed Design - 30%\n- Implementation - 30%\n- Integration - 10%",
                                                    "relevance":  "The courses employs a User-Centered Interdisciplinary Concurrent System Design Methodology (UICSM) that takes teams of students from various disciplines that work with an end-user to generate a complete prototype system by the end of the semester. The students experience all the phases in design starting from conceptualization to detailed design to implementation and integration into a fully functional prototype.",
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}