{
        "code":  "19-101",
        "name":  "Introduction to Engineering and Public Policy",
        "short_name":  "INTRO ENGR \u0026 PUB POL",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course examines interactions between technology and society, and the related processes of public and private decisionmaking. Classes involve a mix of lecture, discussion, and handson activities where students tackle interdisciplinary issues with both quantitative and qualitative methods. Students complete individual and group assignments that build skills in analysis and communication relevant for future careers. Past project topics include using drone imaging to assess algal blooms in Lake Erie, incorporating renewable electricity generation on campus, reducing credit card fraud through data analytics, and creating standards for additive manufacturing of critical airplane parts.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Discuss basic concepts of public policy theory, the public policymaking process, and policy analysis approaches in relationship to issues of engineering and technology. Use engineering and social science techniques, skills, and tools to analyze engineering and technology, their impacts on our society, and resulting policy alternatives. Demonstrate that engineering analysis alone is not sufficient to solve a real world societal need or problem, and that technical and scientific information can support decisionmakers in governments and institutions when devising or evaluating policy.",
                                                    "key_topics":  "Interaction between technology and society, and influences of public policy on technology.",
                                                    "prerequisite_knowledge":  "No prior knowledge required",
                                                    "assessment_structure":  "Homework, tests, projects",
                                                    "relevance":  "Satisfies introductory engineering course requirement for CIT students. Satisfies quantitative and non-quantitative general education course requirements for other colleges. Course demonstrates how knowledge across domains is needed to solve complex problems.",
                                                    "learning_resources":  "Canvas site, textbook and case studies from current press and research",
                                                    "extra_time_commitment":  null
                                            }
}