{
        "code":  "19-301",
        "name":  "Decision Making Methods for Engineers and Scientists",
        "short_name":  "DECISION MKG MTH",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(36-217 [] at least C) or (19-250 [] at least C) or (36-219 [] at least C) or (36-220 [] at least C)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course covers various economic, statistical, and decision analysis techniques used for examining complex decisions where technology, society, and policy interconnect. Topics covered include estimation techniques, benefitcost analysis, decision trees, dealing with uncertainty, risk perception and analysis, survey design and implementation, utility theory, heuristics and biases in inference and prediction, methods for combining information from different sources and dealing with conflicting objectives.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Learning objectives1.\nStudents can describe the role of uncertainty in decision analysis.2.\nStudents can apply various methods of decision analysis, such as economic valuation, probability and statistical methods, decision trees, and simulations, in order to address uncertainty in decision analysis.3.\nStudents can apply utility models with multiple objectives to support decisionmaking.In addition to learning new skills specific to decision analysis, students are also expected to practice and improve their skills in problem solving, critical thinking, and communicating both written and verbal.",
                                                    "key_topics":  "Estimation techniques, benefit-cost analysis, decision trees, dealing with uncertainty, risk perception and analysis, survey design and implementation, utility theory, heuristics and biases in inference and prediction, methods for combining information from different sources and dealing with conflicting objectives.",
                                                    "prerequisite_knowledge":  "Prior course in probability \u0026 statistics and engineering economics would be helpful but is not required",
                                                    "assessment_structure":  "The course grade will be based on participation in the class activities and discussions, regular assignments, in-class activities, two exams, and a final exam. Regular assignments will consist of brief analysis exercises and short essays.\n\nThe following grading scheme will be used to assign the final grade\n\n-\nClass participation and discussion: 5%\n\n-\nRegular assignments: 45%\n\n-\nTest 1: 15%\n\n-\nTest 2: 15%\n\n-\nFinal Exam: 20%",
                                                    "relevance":  null,
                                                    "learning_resources":  "Optional Textbook:\n\nMaking Hard Decisions with DecisionTools by Robert Clemen and Terence Reilly. The latest edition is the third edition, but you can buy the second edition, which is much cheaper and available online.\n\nWe have several copies of the book that you can borrow from the main office.\n\nTree Plan Tool Kit:\n\nWe will be using the TreePlan tool kit that includes TreePlan, Sensit, and SimVoi. The tool kit is compatible with both Mac and PC computers and works with MS Excel.",
                                                    "extra_time_commitment":  null
                                            }
}