{
        "code":  "19-318",
        "name":  "Public Policy and Regulations",
        "short_name":  "PUBPOLREG",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Regulations are critical in determining how our society works. How we decide to run our economy, take care of our health, and sustain our environment are all determined through regulations.  Everything that you encounter on a daily basis has some regulation lurking behind the scenes.  Trying to understand why things are the way they are without understanding the importance, functioning, and limits of regulatory policy is impossible.  Despite their importance, regulations are not in the US Constitution. In fact, much to the dismay of some citizens, the Administrative bureaucracy that runs the regulatory process is often referred to as the fourth branch of government on par with the other three Legislative, Executive, and Judicial.  This course will introduce a range of topics related regulatory policies and provide numerous case studies to motivate discussions and comprehension.    All students are expected to attend class, you should not miss any classes",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Learning objectives Students are expected by the end of the course toUnderstand the role that regulations play in how the US government worksUnderstand the steps of the regulatory processUnderstand and apply some of the main techniques used in regulatory policy in particular CostBenefit AnalysisAppreciate the differences between Trump and Biden when it comes to their regulatory approachesBe able to cite examples of successful and failed regulationsDiscuss the methods used to determine the Social Cost of Carbon SCC, clearly the most importance calculation used in climate change regulations.",
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Grading will be based on the following (percent of final grade shown):\n40%\tHomework (5 sets)\n10%\tFive mini quizzes (in-class announced five-minute short questions covering readings or previous class discussions)\n40%\tEnd of semester Project\nTBD\tClass participation (will be used to pull a grade up if needed)\nHomework will be collected through Canvas and must be turned in before the class starts on the day that they are due. Late homework will incur a penalty (10% per day or part of day). Do not wait to turn in a late assignment; turn it in as soon as possible. You don\u0027t need to ask permission to turn it in!",
                                                    "relevance":  "Regulations are critical in determining how our society works. How we decide to run our economy, take care of our health, and sustain our environment are all determined through regulations. Everything that you encounter on a daily basis has some regulation lurking behind the scenes. Trying to understand why things are the way they are without understanding the importance, functioning, and limits of regulatory policy is impossible. Despite their importance, regulations are not in the US Constitution. In fact, much to the dismay of some citizens, the \"Administrative bureaucracy\" that runs the regulatory process is often referred to as the fourth branch of government (on par with the other three: Legislative, Executive, and Judicial). This course will introduce a range of topics related regulatory policies and provide numerous case studies to motivate discussions and comprehension.",
                                                    "learning_resources":  "Course materials\nWe will cover the entire book: Regulation: A Primer by Susan Dudley \u0026 Jerry Brito that can be downloaded at http://mercatus.org/sites/default/files/RegulatoryPrimer_DudleyBrito_0.pdf\n\nChapters from Improving Regulation: Cases in Environment, Health, and Safety, edited by Paul S. Fischbeck \u0026 R. Scott Farrow edited by Paul S. Fischbeck \u0026 R. Scott Farrow will be provided for download from Canvas\n\nSelective handouts will be posted on Canvas",
                                                    "extra_time_commitment":  null
                                            }
}