{
        "code":  "19-351",
        "name":  "Applied Methods for Technology-Policy Analysis",
        "short_name":  "APPLD MTH TCH PLY AN",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "36-220 [] at least D"
                                },
        "co_reqs":  [
                                        {
                                                "code":  "19-301",
                                                "id":  4161,
                                                "name":  "Decision Making Methods for Engineers and Scientists",
                                                "units":  9.0
                                        },
                                        {
                                                "code":  "88-302",
                                                "id":  5415,
                                                "name":  "Behavioral Decision Making",
                                                "units":  9.0
                                        },
                                        {
                                                "code":  "88-223",
                                                "id":  6791,
                                                "name":  "Decision Analysis",
                                                "units":  12.0
                                        },
                                        {
                                                "code":  "19-250",
                                                "id":  8836,
                                                "name":  "Special Topics: Statistical Models for Engineering Analysis and Design",
                                                "units":  9.0
                                        }
                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course synthesizes concepts from economics, statistics, decision analysis, and other humanities and social science areas as they relate to analysis of technology and public policy issues. Students will focus on applying skills, tools, and techniques of social science to critically examine issues of current importance to society that have engineering systems at the core, and how public policy can be informed by the results of these analyses. Students will discover the relationship between formulating research questions considering a wide range of perspectives e.g., political, ethical, social, economic, and legal aspects and implementing the appropriate research methods for answering them. The course will emphasize interpretation and communication of analysis results in written and oral presentation, especially to nontechnical audiences. As a precursor to the EPP Project courses, the course also prepares EPP juniors for structuring realworld problems into a feasible work plan, and to deal with revising work plans as work proceeds.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  "Synthesis of quantitative and qualitative information, technology and policy analysis, forming and answering research questions based on evidence and analysis, communication of results.",
                                                    "prerequisite_knowledge":  "Prior courses in decision analysis , statistics, and public policy helpful",
                                                    "assessment_structure":  "Individual and small group assignments, final group project",
                                                    "relevance":  null,
                                                    "learning_resources":  "Materials provided by instructor",
                                                    "extra_time_commitment":  null
                                            }
}