{
        "code":  "19-429",
        "name":  "Climate Change Science and Solutions",
        "short_name":  "CLIMATE SCI SOL",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course consists of four parts. The first part will provide a primer for those who are curious about the physical mechanisms by which climate is determined, and by which climate change occurs. The treatment of these mechanisms will not be overly quantitative, and no knowledge of meteorology or atmospheric science is needed. Collegelevel physics, as well as basic calculus and basic chemistry, is, however, needed. The second part will describe the projected consequences of climate change, as well as those that are already occurring. This part will also familiarize students with how societies might adapt to these changes. The third part will explore and critique some of the tools that decisionmakers use to quantify and compare the damages caused by these consequences. The final part of the course will discuss some of the technologies that could be used to prevent dangerous climate change.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  "Climate change science (40%); climate change impacts and adaptation (30%); climate change mitigation (20%); environmental economics (10%)",
                                                    "prerequisite_knowledge":  "There are no pre-requisite courses\nCollege-level physics, basic calculus, and basic chemistry are required.\nStudents from outside of CIT should have graduate standing, and be comfortable with quantitative analysis.",
                                                    "assessment_structure":  "No final exam\nOne mid-term on climate science (20% of the grade)\nIn-class quizzes (25% of the grade)\nShort essays (25% of the grade)\nIn-class presentation (10% of the grade)\nParticipation on on-line class discussion forum (10% of the grade)\nSmall project to run climate model (10% of the grade)",
                                                    "relevance":  null,
                                                    "learning_resources":  "Recommended text book: Hartmann, Dennis L. Global Physical Climatology, Volume 56. 1 edition. San Diego: Academic Press, 1994.\nThe textbook is freely available in electronic form at the university library:\nhttp://web.b.ebscohost.com.proxy.library.cmu.edu/ehost/detail/detail?vid=0\u0026sid=ea86c0a0-75f0-4e2d-b0a4-6f66ef8efbbd%40sessionmgr103\u0026bdata=JnNpdGU9ZWhvc3QtbGl2ZQ%3d%3d#AN=279556\u0026db=e230xww\n\nMaterials will be drawn from a variety of source, including recently published scientific findings, which will be made available as PDFs on the course website.\n\nOther materials that students may want to refer to include:\nVallis, Geoffrey K. Climate and the Oceans. Princeton, N.J.: Princeton University Press, 2011.\nRandall, David. Atmosphere, Clouds, and Climate. First Edition edition. Princeton: Princeton University Press, 2012.\nArcher, David. The Global Carbon Cycle. Princeton: Princeton University Press, 2010.\nIPCC, 2013: Climate Change 2013: The Physical Science Basis. Contribution of Working Group I to the Fifth Assessment Report of the Intergovernmental Panel on Climate Change [Stocker, T.F., D. Qin, G.-K. Plattner, M. Tignor, S.K. Allen, J. Boschung, A. Nauels, Y. Xia, V. Bex and P.M. Midgley (eds.)]. Cambridge University Press, Cambridge, United Kingdom and New York, NY, USA, 1535 pp.\nThe US National Climate Assessment: http://nca2014.globalchange.gov/\nSchimel, David. Climate and Ecosystems. Princeton: Princeton University Press, 2013.\nIPCC, 2014: Climate Change 2014: Impacts, Adaptation, and Vulnerability. Part A: Global and Sectoral Aspects. Contribution of Working Group II to the Fifth Assessment Report of the Intergovernmental Panel on Climate Change [Field, C.B., V.R. Barros, D.J. Dokken, K.J. Mach, M.D. Mastrandrea, T.E. Bilir, M. Chatterjee, K.L. Ebi, Y.O. Estrada, R.C. Genova, B. Girma, E.S. Kissel, A.N. Levy, S. MacCracken, P.R. Mastrandrea, and L.L. White (eds.)]. Cambridge University Press, Cambridge, United Ki",
                                                    "extra_time_commitment":  null
                                            }
}