{
        "code":  "19-421",
        "name":  "Emerging Energy Policies",
        "short_name":  "EMG ENERGY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Interested in whats happening in energy policy and how to analyze potential policy options in response  Focusing on current hot topics in energy policy, students will learn the basic principles of public policy analysis and underlying techniques such as program evaluation, cost benefit analysis, life cycle analysis, prince analysis, and risk analysis as well as the variety of policy mechanisms available. Class time will include a combination of faculty and guest speaker lectures, discussion of issues, videos, and problem solving.  Students will review and edit Wikipedia entries on an energy policy topic of their choice, and then analyze policy options resulting in an executive summary or paper on that topic.  While the course has no prerequisites, students should feel comfortable with scientific and technical topics. Upon completion of this course, students should have a deeper and more strategic understanding of the opportunities and challenges associated with emerging energy policies. Open to seniors. Open to juniors with permission only.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}