{
        "code":  "19-473",
        "name":  "Special Topics: Patents, Licensing, and Innovation",
        "short_name":  "ST:PATENTSLICINNOV",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course provides students with the tools to understand patents and technology rights, and how these assets can be utilized in a firms innovation processes. Patents and other technology rights are increasingly valuable to businesses, and are no longer limited to large manufacturing or scientific companies. Startups and midsized firms in numerous industries use technology rights to increase their return on innovation and innovative activity. When used effectively, these legal tools can lead to significant and sometimes surprising business advantages. Patent rights can enable small companies to prevent copying by competitors, earn higher revenue from licensing technology, and compete more effectively against much larger firms. Knowledge of technology rights can provide a powerful competitive advantage and provide many nonintuitive  opportunities. In addition, these legal mechanisms can be made even more effective if they are integrated with the organizations innovation processes the way that organizations manage the conception, development, and production of new products, services, technologies, and business models. This is in contrast to the more common practice of treating innovation and patenting as distinct and consecutive processes. Highly innovative organizations develop new products and technologies guided in part by the patents and other technology rights that can eventually enhance value. This course is believed to be unique in its focus on the complete innovation life cycle. It treats intangible assets like patents and business strategies as part of the process of developing innovations. This leads to interesting techniques different from those used by specialists who only create technology, or who only work with patent and other technology rights. Through the exercises and final project students will follow the complete life cycle of an actual product or service.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  "This course provides students with the tools to understand patents and technology rights, and how these assets can be utilized in a firm\u0027s innovation processes.",
                                                    "prerequisite_knowledge":  "None. Prior course working probability and statistics is helpful but not required.",
                                                    "assessment_structure":  "Exams, assignments, final project",
                                                    "relevance":  null,
                                                    "learning_resources":  "Publicly available articles and lecture notes. No required text.",
                                                    "extra_time_commitment":  "This section is OPEN for all students"
                                            }
}