{
        "code":  "19-424",
        "name":  "Energy and the Environment",
        "short_name":  "ENERGY \u0026 THE ENVRNMT",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will explore the relationships between environmental impacts and the utilization of energy through a series of case studies on topics of current interest.  Such topics might include the use of renewable and nonrenewable fuels for electric power generation energy use for automobiles and other transportation systems energy use for buildings and industrial processes and environmental issues such as urban air pollution, ozone formation, acid rain, and global warming.  The emphasis will be on analysis of energyenvironmental interactions and tradeoffs, and their dependency upon engineering design choices, economic variables, and public policy parameters.      Junior or Senior standing in CIT or permission of instructor.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  "Topics might include the use of renewable and non-renewable fuels for electric power generation; energy use for automobiles and other transportation systems; energy use for buildings and industrial processes; and environmental issues such as urban air pollution, ozone formation, acid rain, and global warming",
                                                    "prerequisite_knowledge":  "Junior or Senior standing in CIT or permission of instructor.",
                                                    "assessment_structure":  null,
                                                    "relevance":  "The course explore the relationships between environmental impacts and the utilization of energy through a series of case studies on topics of current interest.",
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}