{
        "code":  "19-411",
        "name":  "Science and Innovation Leadership for the 21st Century: Firms, Nations, and Tech",
        "short_name":  "SCIINNLEADERSHIP",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Science and Innovation Leadership for the 21st Century introduces students to the fundamental principles surrounding global competitiveness and technological change in the 21st century.  The course is broken into three sections.  The first section introduces students to competing economic, sociological, and political science theories on the structures supporting technological change.  The second section presents contemporary literature on technological change. The concluding section leverages lessons from the preceding two sections to evaluate national innovation systems, and the factors that lead to national comparative advantage.  Students should leave the class able to reflect competently on what the existing literature tells us about the factors influencing global technology competitiveness, and on how modern changes in the structures supporting innovation as well as technology itself may be changing the rules of the game for firms and for nations.  The course is open to undergraduate juniors, seniors  graduate students.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  "Insights from political science, economics, and sociology (and a bit of engineering) on how firms and nations enhance their global competitiveness at the technological frontier.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Class participation in discussing the weekly readings; Three essays/papers and a take-home final",
                                                    "relevance":  "The course merges fundamentals from political science, economics, and sociology to understand the concept of technology change and what it means for national competitiveness",
                                                    "learning_resources":  "None. All weekly readings provided through the canvas system.",
                                                    "extra_time_commitment":  null
                                            }
}