{
        "code":  "19-437",
        "name":  "Special Topics: Global Ecological  Issues \u0026 Controversies",
        "short_name":  "ST:GLOBALECO",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Ecologists study how organisms interact with each other and their environment to understand patterns of species diversity and abundance in nature. At local, regional and global scales, ecological issues abound in the news and social media, often sparking controversy and heated policy debates. For example, is climate change real or a hoax, and whats the evidence either way To what extent can humans impact global climate What are the ecological ramifications, if any, of climate change for individual organisms, populations, communities, and ecosystems This course is designed to enhance any students ability to 1 critically analyze such questions 2 evaluate the available scientific research 3 interrogate the public arguments of various stakeholders regarding environmental issues and 4 make their own  informed decisions and evidencebased conclusions. Collaboratively, through highly interactive, discussionbased classroom activities, we will practice applying fundamental ecological principles and concepts to a variety of environmental issues. Our inquiries may include, but not be limited to, conservation of biodiversity and other natural resources e.g., air and water quality, management of invasive species, fragmentation of natural habitats by human activity, sustainability of agriculture and fisheries, and pros and cons of genetically modified organisms. Although ecology is an empirically and mathematically rigorous science, this course will be mathlite, focusing primarily on application of concepts and critical thinking, rather than the development of disciplinespecific mathematical modeling and computational skills. Previous completion of an introductory statistics course is not required, but encouraged.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}