{
        "code":  "21-102",
        "name":  "Exploring Modern Mathematics",
        "short_name":  "EXPLORE MODERN MATH",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is designed for nonmath majors who are interested in learning some contemporary applications of mathematics with minimal prerequisite math knowledge.  The course will survey the mathematical concepts centered along various themes, which may include the mathematics of social choice voting and apportionment systems, topics in management science optimization and elementary graph theory, modeling growth systems population and finance, shape and form symmetry and fractals, basic applications of probability and counting, and basic applications of number theory cryptography and coding theory.  Additional topics may be presented at the discretion of the instructor.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://www.cmu.edu/math/undergrad/math-course-information.html",
        "custom_fields":  {
                                                    "goals":  "At the completion of this course, students will be able to1. Understand and communicate the mathematical concepts behind many real world applications.2. Use inductive and deductive reasoning to understand and critique mathematical arguments and formulate valid conclusions.3. Identify and apply mathematical models, tools, and techniques to interpret given reallife situations. 4. Develop an appreciation for the role mathematics plays in nature and society.",
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Weekly homework assignments and final project",
                                                    "relevance":  "DC: Disciplinary Perspectives: Logic / Mathematical Reasoning",
                                                    "learning_resources":  "One textbook, with all other resources provided on Canvas",
                                                    "extra_time_commitment":  null
                                            }
}