{
        "code":  "24-101",
        "name":  "Fundamentals of Mechanical Engineering",
        "short_name":  "FUND OF MECH ENGR",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [
                                        {
                                                "code":  "21-120",
                                                "id":  2627,
                                                "name":  "Differential and Integral Calculus",
                                                "units":  10.0
                                        },
                                        {
                                                "code":  "33-141",
                                                "id":  5295,
                                                "name":  "Physics I for Engineering Students",
                                                "units":  12.0
                                        }
                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The purpose of this course is to introduce the student to the field of mechanical engineering through an exposition of its disciplines, including structural analysis, mechanism design, fluid flows, and thermal systems. By using principles and methods of analysis developed in lectures, students will complete two major projects. These projects will begin with conceptualization, proceed with the analysis of candidate designs, and culminate in the construction and testing of a prototype. The creative process will be encouraged throughout. The course is intended primarily for CIT first year students.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "http://www.cmu.edu/me/undergraduate/index.html",
        "custom_fields":  {
                                                    "goals":  "24101 is the first course in the mechanical engineering major. It can also be a useful course for nonmajors in other engineering disciplines, the sciences, business, industrial design, and art. The course combines lecture instruction, problem solving, case studies, and handson computer and machine shop projects.",
                                                    "key_topics":  "1.The mechanical engineering profession. 2.Problem-solving skills. 3.Forces in structures and machines. 4.Materials and stresses. 5.Fluids Engineering. 6.Thermal and energy systems. 7.Motion and controls. 8.Mechanical design.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Final quiz 30%. 2 Quizzes (20% each) 40%. Homework 10%. Team Design Project 10%. CAE projects 10%",
                                                    "relevance":  "24-101 is the first course in the mechanical engineering major.",
                                                    "learning_resources":  "1) Text book. 2) Instructor notes distributed through Canvas and inside the class.",
                                                    "extra_time_commitment":  null
                                            }
}