{
        "code":  "27-100",
        "name":  "Engineering the Materials of the Future",
        "short_name":  "ENG MATERLS OF FUTRE",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [
                                        {
                                                "code":  "21-120",
                                                "id":  2627,
                                                "name":  "Differential and Integral Calculus",
                                                "units":  10.0
                                        },
                                        {
                                                "code":  "33-141",
                                                "id":  5295,
                                                "name":  "Physics I for Engineering Students",
                                                "units":  12.0
                                        }
                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Materials form the foundation for all engineering applications. Advances in materials and their processing are driving all technologies, including the broad areas of nano, bio, energy, and electronic information technology. Performance requirements for future applications require that engineers continue to design both new structures and new processing methods in order to engineer materials having improved properties. Applications such as optical communication, tissue and bone replacement, fuel cells, and information storage, to name a few, exemplify areas where new materials are required to realize many of the envisioned future technologies. This course provides an introduction to how science and engineering can be exploited to design materials for many applications. The principles behind the design and exploitation of metals, ceramics, polymers, and composites are presented using examples from everyday life, as well as from existing, new, and future technologies. A series of laboratory experiments are used as a handson approach to illustrating modern practices used in the processing and characterization of materials and for understanding and improving materials properties.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will be able to identify appropriate material types for different engineering applications and to solve quantitative problems associated with the structure, properties, processing and performance of different materials.",
                                                    "key_topics":  "\"This course provides an introduction to how science and engineering can be exploited to design materials for many applications.\"",
                                                    "prerequisite_knowledge":  "no prior knowledge required",
                                                    "assessment_structure":  "There will be several homeworks and three exams during the semester, a laboratory component that includes written lab reports, and a final exam.",
                                                    "relevance":  "Students will understand the principles behind the design and exploitation of metals, ceramics, polymers, and composites that are used in everyday life, as well as from existing, new, and future technologies.",
                                                    "learning_resources":  "The primary resources are the course textbook, chapter slides and lecture notes available on Canvas to augment the lectures, and short laboratory manuals.",
                                                    "extra_time_commitment":  "Students are expected to spend time on problem sets and preparing for exams."
                                            }
}