{
        "code":  "33-121",
        "name":  "Physics I for Science Students",
        "short_name":  "PHYSICS SCI STUD I",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [
                                        {
                                                "code":  "21-120",
                                                "id":  2627,
                                                "name":  "Differential and Integral Calculus",
                                                "units":  10.0
                                        }
                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This calculusbased course combines the basic principles of mechanics with some quantum physics and relativity to explain nature on both a microscopic and macroscopic scale. The course will build models to describe the universe based on a small number of fundamental physics principles. Some simple computer modeling will be done to develop insight into the solving of problems using Newtons laws. Topics covered will include vectors, momentum, force, gravitation, oscillations, energy, quantum physics, center of mass motion, rotation, angular momentum, statistical physics, and the laws of thermodynamics. No computer experience is needed.  Examples illustrating basic principles being presented will be taken from physics, chemistry, and biology. This course has a corequisite of 21120.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students who successfully complete this class will be able toConstruct and refine physical models including information about a systems position, momentum, angular momentum, energy, forces, torque, entropy, or temperature.Employ models to predict physical systems behavior using graphical, mathematical, andor computational techniques and representations.Select and apply foundational physics principles to models of physical systems, including the momentum principle, the energy principle, the angular momentum principle, and the entropy principle.Analyze, solve, and interpret results for a variety of problems using the foundational physics principles listed above.",
                                                    "key_topics":  "This course covers introductory topics in mechanics, including some discussion of relativity, thermal physics, statistical physics, and quantum physics.",
                                                    "prerequisite_knowledge":  "Although this class has no formal prerequisites, students should expect to apply skills from previous algebra and trigonometry courses. 21-120 is a corequisite for this course, and calculus will also be required.",
                                                    "assessment_structure":  "Homework, reading quizzes, in-class tests, class participation, and a final exam.",
                                                    "relevance":  "The students will learn to study, both qualitatively and quantitatively, the motion of things, interactions, energy, and the nature of matter.",
                                                    "learning_resources":  "Textbook, online resources, iClicker subscription",
                                                    "extra_time_commitment":  null
                                            }
}