{
        "code":  "33-100",
        "name":  "Basic Experimental Physics",
        "short_name":  "BASC EXPERMTL PHYSCS",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course provides students with a basic introduction to experimental physics. The content of the course and the particular experiments to be carried out are chosen to be especially useful for students who intend to work in the health sciences. Specific topics will range from mechanics to nuclear and atomic physics. This course is specifically geared toward prehealth students.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The successful student will achieve the following outcomes in this course1 Take measurements of physical properties in experimental settings.2 Estimate measurement errors and propagate them in calculations.3 Produce clear tables and graphs of experimental data.4 Use leastsquares fitting andor other analysis techniques to obtain results from experimentation.5 Synthesize experimental findings and interpret them in view of measurement errors, theoretical predictions, and experimental limitations.6 Communicate experimental processes and their results clearly and accurately.7 Follow experimental procedures and troubleshoot minor instrumentation problems with guidance.",
                                                    "key_topics":  "Data acquisition, analysis techniques, fitting data to models, and comparing results to theoretical predictions in a variety of physical settings.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Students are assessed with their lab notebooks, using rubrics that are aligned with course outcomes.",
                                                    "relevance":  "This course focuses on measurements, uncertainties, and propagating those uncertainties into final results and their margins of error. This course is about how we know what we know and how well we know it, and is applicable as a foundational skillset to any STEM field.",
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}