{
        "code":  "33-141",
        "name":  "Physics I for Engineering Students",
        "short_name":  "PHY I ENG STUD",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [
                                        {
                                                "code":  "21-120",
                                                "id":  2627,
                                                "name":  "Differential and Integral Calculus",
                                                "units":  10.0
                                        }
                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This is a first semester, calculusbased introductory physics course. Basic principles of mechanics and thermodynamics are developed. Topics include vectors, displacement, velocity, acceleration, force, equilibrium, mass, Newtons laws, gravitation, work, energy, momentum, impulse, torque and angular momentum, temperature, heat, equations of state, thermodynamic processes, heat engines, refrigerators, first and second laws of thermodynamics, and the kinetic theory of gases. This course has a corequisite of 21120.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "This course will provide a solid base for further study of aspects of mechanics related to your particular engineering discipline. In a nutshell, physics concerns learning and codifying explanations of how nature functions. We can then use this knowledge to perform interesting feats predicting the future of dynamical systems, or perhaps analyzing past behavior with an eye to improving a recurring process. These tasks are key to much of engineering.",
                                                    "key_topics":  "Kinematics, Dynamics, Energy and Momentum, Thermodynamics",
                                                    "prerequisite_knowledge":  "Basic algebra (e.g., solving simultaneous equations) and Trigonometry. Calculus 1 is co-requisite.",
                                                    "assessment_structure":  "Grade will be based on the final exam (30%), in-class exams (30%), in-class quizzes (21%), homework assignments (12%), online quizzes (2.8%), and recitation attendance (4.2%).",
                                                    "relevance":  "Our course covers Newtonian mechanics (kinematics, dynamics, conservation laws and systems) and thermodynamics. We will learn to apply the concepts to simple physical systems. Our somewhat idealized and simplified problems are really just vehicles to develop the toolkit you will need later to analyze more complex situations. You will acquire the ability to apply a few basic principles and concepts to a large variety of problems, to break complicated problems into parts that can be solved successively, and to identify and critique the assumptions and approximations involved in solving a particular problem. The library of examples and techniques developed in this course are the foundation of very practical abilities to independently model and analyze physical systems in the real world.",
                                                    "learning_resources":  "Reading Assignments\nLectures\nRecitations\nCourse Centers\nOffice Hours\nPiazza",
                                                    "extra_time_commitment":  null
                                            }
}