{
        "code":  "33-224",
        "name":  "Stars, Galaxies and the Universe",
        "short_name":  "STRS GLXS \u0026 UNIVERSE",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(33-131 [] at least D) or (33-111 [] at least D) or (33-121 [] at least D) or (33-151 [] at least D) or (33-106 [] at least D) or (33-141 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The study of astronomy has blossomed over the past few decades as a result of new groundbased and spacebased telescopes, and with the advantage of fast computers for analysis of the huge quantities of data. As our astronomical horizon expands, we are still able to use the laws of physics to make sense of it all. This course is for students who want to understand the basic concepts in astronomy and what drives astronomical objects and the universe. The course emphasizes the application of a few physical principles to a variety of astronomical settings, from stars to galaxies to the structure and evolution of the universe. Introductory classical physics is required, but modern physics will be introduced as needed in the course. The course is intended for science and engineering majors as well as students in other disciplines with good technical backgrounds. Computer lab exercises will be used to gain practical experience in astronomical techniques. In addition, small telescopes are available for personal signout for those who would like to use them, and outdoor observing sessions will be organized as weather permits.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The primary goal of the course is to introduce students to the concepts that are central to modern astrophysics. While it is important for students to become familiar with and able to describe in their own words the current state of astrophysical knowledge about the nature of stars, galaxies and the Universe, it is even more important that students learn the tools and techniques used to obtain these results.",
                                                    "key_topics":  "- Observed properties of stars\n- Internal structure of stars\n- Formation and evolution of stars, including exotic end-products (white dwarfs, neutron stars, black holes)\n- Extra-solar planets\n- Gravitational lensing\n- Structure of the Milky Way and other galaxies\n- Clusters of galaxies\n- Structure and dynamics of the Universe as a whole\n- Observational probes of cosmology\n- Evidence for dark matter, dark energy",
                                                    "prerequisite_knowledge":  "Algebra, trigonometry, differential and integral calculus, familiarity with concepts (e.g., Newton\u0027s laws, gravitation, energy) from high-school or first-semester University physics",
                                                    "assessment_structure":  "Students will be evaluated based on performance on written homework assignments, in-class examinations and in-class quizzes.",
                                                    "relevance":  "The course introduces students to a variety of topics in modern astrophysics. While it is designed as the first course along the astrophysics track within the Physics major, it is also accessible and welcoming to students focusing on other disciplines both within and external to the Physics curriculum.",
                                                    "learning_resources":  "The required textbook is \"Astrophysics in a Nutshell, 2nd Ed.\", by Dan Maoz",
                                                    "extra_time_commitment":  null
                                            }
}