{
        "code":  "33-211",
        "name":  "Physics III: Modern Essentials",
        "short_name":  "PHYS III: MOD ESSENT",
        "units":  10.0,
        "min_units":  10.0,
        "max_units":  10.0,
        "prereqs":  {
                                        "text":  "(33-107 [] at least D) or (33-142 [] at least D) or (33-122 [] at least D) or (33-132 [] at least D) or (33-112 [] at least D) or (33-152 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Physics III is primarily for thirdsemester students of physics, including all physics majors, but is open to any qualified student who wants an introduction to the physics of the 20th century. The course will have a strong component of Special Relativity, dealing with kinematics and dynamics, but not electricity and magnetism. See 33213 description. It will introduce students to a conceptual theory, which is mathematically simple but initially nonintuitive. The course also provides a broad exposure to quantum phenomena and early quantum theory without getting overly mathematical. It leads into the more formal Quantum Physics course 33234.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "After having taken this course, you should be able to do the following\nExplain why our Galilean notions of space and time required an overhaul. Summarize in what way the relativistic notion of spacetime differs from the Galilean notion of space and time, and give examples of phenomena where these two notions are starkly in conflict. Know when and how to perform Lorentz transformations between different frames of reference. Describe and use applications of relativistic kinematics, such as how velocities add, the relativistic Doppler effect, and the collimating of light beams emitted by moving observers. Understand how the notions of energy and momentum conservation translate into a relativistic framework, and then apply them to solve various problems of particles colliding, decaying, or being created. Regale anyone who would listen, at length, about why, indeed, E mc. Explain how Planck out of sheer desperation invented the idea of photons, which solved the longstanding problem of black body radiation. And how Einstein ran with that idea and explained the photoelectric effect. Name several experimental facts which support the idea that energy levels in atoms are quantized. Argue why Rutherfords scattering experiment supported the idea of an atom as a tiny heavy nucleus surrounded by orbiting electrons, and then show how Bohr combined this with the radical idea of angular momentum quantization to arrive at the first quantitative prediction of an atomic spectrumthat of hydrogen. Tell the story how Moseley quantitatively explained key patterns in the Xray spectra of elements, and this way finally put the periodic table of chemistry on a clear physical foundation. Review some of the phenomenological reasoning that ultimately leads to the Schrdinger equation.",
                                                    "key_topics":  "First (shorter) part: special relativity (Lorentz transformations, spacetime diagrams, time dilation, Lorentz contraction, twin paradox, Doppler effect; relativistic momentum and energy, E=mc², invariants, scattering problems, 4-momentum, a few words on general relativity. Second (longer) part: early quantum phenomenology (quantization of light, charge, mass; the nuclear atom; wavelike properties of particles; a first glimpse at the Schrödinger equation).",
                                                    "prerequisite_knowledge":  "Intro physics (like either one of 107, 112, 122, 132, 142, or 152) as well as basic algebra and calculus (but not in 3d)",
                                                    "assessment_structure":  "Homework, 2 midterm exams, final exam",
                                                    "relevance":  "This course covers the revolution that shook physics at the beginning of the 20th century. While learning about a lot of the things which we today almost take for granted (like atoms consisting of a nucleus and electrons that \"orbit\" them), we will also witness how some of the smartest physicists who ever lived mightily struggled to make sense of the many experimental data that flat-out conflicted with classical (Newtonian) thinking.",
                                                    "learning_resources":  "Lectures, homework problems, textbook, Piazza, weekly office hour",
                                                    "extra_time_commitment":  "This is a 10 unit course, so you should expect to spend ~6 additional hours outside regular meeting times per week (which are four 50-min slots)."
                                            }
}