{
        "code":  "33-226",
        "name":  "Physics of Energy",
        "short_name":  "PHYSICS OF ENERGY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(33-122 [] at least D) or (33-152 [] at least D) or (33-142 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will apply basic science, in particular introductory physics concepts, to a wide variety of topics related to energy. The course will closely follow a widely praised textbook The Physics of Energy, so be divided into 3 parts basic energy science energy sources and climate. This course fills the breadth requirement for Physics Majors or can be used as one of the 4 electives required for the Applied Physics Track.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Upon completion of this courses, students will understand and be able to apply fundamental physics laws to perform a wide variety of calculations that quantify the different forms of energy how heat and energy are transported the source of energy solar, nuclear, wind, fossil fuels how extensive the resources are how to extract them and the costs of using them. Students will also build simple onedimensional models of the temperature and develop the tools to set up the radiativeconvective equilibrium model. They will also be able to compute the changes in a model due to different forcing effects, such as increase in CO2 or ice melt.",
                                                    "key_topics":  "This course will provide a thorough discussion of Energy (Mechanical, Electrical, Thermal, Radiative, Heat, etc.),Global Energy Use, and Energy Sources (Nuclear, Solar, Wind, Fossil Fuels, etc.). Applications of energy to Climate science will also be discussed, including Atmospheric Physics, the Greenhouse Effect, the Carbon Cycle, and more.",
                                                    "prerequisite_knowledge":  "This course will build on foundational knowledge from introductory physics classes.",
                                                    "assessment_structure":  "Weekly homework, a project, a midterm, and final exam",
                                                    "relevance":  null,
                                                    "learning_resources":  "Textbook, additional readings as assigned.",
                                                    "extra_time_commitment":  null
                                            }
}