{
        "code":  "33-350",
        "name":  "Undergraduate Research",
        "short_name":  "UNDERGRAD RESEARCH",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Open to sophomore, junior, and senior physics majors. The student undertakes a project of interest under the supervision of a faculty member for 3 to 9 units of credit. May include research done in a research lab, extending the capabilities of a teaching lab, or a theoretical or computational physics project. The student experiences the less structured atmosphere of a research program where there is much room for independent initiative. Student should contact faculty directly to inquire about opportunities. Registration requires approval of the Director of Undergraduate Affairs.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will develop important disciplinespecific knowledge as well as professional skills such as technical communication. Outcomes will vary depending on the students project and Faculty Research Advisor.",
                                                    "key_topics":  "Students will work on a research project in an area of physics that may include: astrophysics \u0026 cosmology, biophysics, computational physics, condensed matter physics, nuclear \u0026 particle physics, or theoretical physics.",
                                                    "prerequisite_knowledge":  "Students should have completed first-year physics classes, although some Faculty Research Advisors may require additional or more specific experience and knowledge.",
                                                    "assessment_structure":  "Metrics that faculty research advisors will consider when assigning a letter grade for undergraduate research include the student\u0027s:\n-Development of specialized physics knowledge and/or technical skills important for their research project at a level appropriate for their experience.\n-Effectiveness and timeliness of communication with their research advisor and other group members as appropriate. This includes proactively seeking advice or feedback, responding to messages, and/or attending meetings as scheduled.\n-Demonstrated ability and willingness to take direction and accept feedback, adjusting their work accordingly, if required.\n-Demonstrated good effort at completing necessary steps for their research in a timely manner as appropriate for their level of experience and the number of units registered.\n-Creation and maintenance of an accurate record of their work, as directed by the faculty research advisor, such as in a lab notebook or through backup of digital files.\n-Overall professional behavior and adherence to university guidelines regarding academic integrity and responsible conduct of research.\n-Delivery of a paper (Fall), presentation (Fall), or poster (Fall or Spring).\n-Other metrics as specified by the Faculty Research Advisor",
                                                    "relevance":  "Research opportunities allow students to expand on and apply the knowledge and skills they develop in classes, and here at CMU that means they are working with our world-class faculty on projects at the scientific frontier. Undergraduate research is an essential step for students considering a research-based graduate degree, such as a Ph.D., but also provides valuable work experience for those seeking to enter the workforce directly after their undergraduate degree.",
                                                    "learning_resources":  "Resources will vary depending on the student\u0027s project and Faculty Research Advisor.",
                                                    "extra_time_commitment":  "Students will be required to present their work in the Department of Physics Undergraduate Research Symposium, held every April."
                                            }
}