{
        "code":  "36-226",
        "name":  "Introduction to Statistical Inference",
        "short_name":  "INTRO STAT INF",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(36-225 [] at least C) or (36-219 [] at least C) or (36-217 [] at least C) or (36-218 [] at least C) or (15-259 [] at least C) or (21-325 [] at least C)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [
                                            {
                                                    "code":  "36-326",
                                                    "id":  2599,
                                                    "name":  "Mathematical Statistics (Honors)",
                                                    "units":  9.0
                                            },
                                            {
                                                    "code":  "15-260",
                                                    "id":  10385,
                                                    "name":  "Statistics and Computing",
                                                    "units":  3.0
                                            }
                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is the second half of a yearlong course in probability and mathematical statistics. Topics include maximum likelihood estimation, confidence intervals, hypothesis testing, and properties of estimators, such as unbiasedness and consistency. If time permits there will also be a discussion of linear regression and the analysis of variance. A grade of C or better is required in order to advance to 36401, 36402 or any 3646x course.  Not open to students who have received credit for 36626.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Given a known or unknown distribution, students will be able to derive parameter estimates using multiple methods and understandcompare the properties of those estimates. Given a research question, students will be able to derive and apply hypothesis tests appropriately to make decisions.",
                                                    "key_topics":  "Parameter estimation, properties of estimators (bias, variance, consistency, sufficiency, etc.), the theory behind hypothesis tests and confidence intervals, linear regression, analysis of variance, and moment generating functions.",
                                                    "prerequisite_knowledge":  "Probability theory, random variables, joint/conditional distributions, the law of large numbers, the central limit theorem.",
                                                    "assessment_structure":  "Assignments, quizzes, exams, and a final exam.",
                                                    "relevance":  "Understanding statistical inference and its role in decision making and model building.",
                                                    "learning_resources":  "Lecture notes, case studies, textbooks, websites, articles, and sample code.",
                                                    "extra_time_commitment":  "None usually expected."
                                            }
}