{
        "code":  "36-208",
        "name":  "Regression Analysis",
        "short_name":  "REGRESSION ANALYSIS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "((21-112 [] at least D) or (21-120 [] at least D)) and ((36-201 [] at least D) or (36-220 [] at least D) or (70-207 [] at least D) or (36-247 [] at least D) or (36-207 [] at least D)) and ((73-100 [] at least D) or (73-102 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [
                                    {
                                            "code":  "36-202",
                                            "id":  607,
                                            "name":  "Methods for Statistics \u0026 Data Science",
                                            "units":  9.0
                                    },
                                    {
                                            "code":  "70-208",
                                            "id":  1525,
                                            "name":  "Regression Analysis",
                                            "units":  9.0
                                    },
                                    {
                                            "code":  "36-326",
                                            "id":  2599,
                                            "name":  "Mathematical Statistics (Honors)",
                                            "units":  9.0
                                    }
                            ],
        "long_desc":  "This is the second half of a year long sequence in basic statistical methods that are used in business and management. Topics include time series, regression and forecasting. In addition to two lectures a week, students will attend a computer lab once a week. Not open to students who have received credit for 36202, 36626. Crosslisted as 70208.  Students who have completed 36401 prior to 36208 will not receive credit for 36208.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "http://www.stat.cmu.edu/academics/courselist",
        "custom_fields":  {
                                                    "goals":  "Given a research question, students will be able to correctly identify variable types, choose appropriate graphs and visualizations, understand underlying randomness in data if applicable, build multivariate models for prediction and forecasting, and perform appropriate hypothesis tests to make decisions. Students will also be able to communicate their results.",
                                                    "key_topics":  "Regression, forecasting, time series analysis, interpreting and communicating results, the data analysis pipeline.",
                                                    "prerequisite_knowledge":  "Exploratory data analysis, basic probability concepts, hypothesis testing.",
                                                    "assessment_structure":  "Assignments, exams, projects, and a final exam.",
                                                    "relevance":  "Students will gain an awareness and appreciation of the data analysis pipeline and be able to apply intermediate level data analysis tools in the business and management contexts.",
                                                    "learning_resources":  "Lecture slides, case studies, textbooks, websites, and articles.",
                                                    "extra_time_commitment":  "None usually expected."
                                            }
}