{
        "code":  "36-247",
        "name":  "Statistics for Lab Sciences",
        "short_name":  "STATS FOR LAB SCIENC",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [
                                            {
                                                    "code":  "36-207",
                                                    "id":  604,
                                                    "name":  "Probability and Statistics for Business Applications",
                                                    "units":  9.0
                                            },
                                            {
                                                    "code":  "36-200",
                                                    "id":  605,
                                                    "name":  "Reasoning with Data",
                                                    "units":  9.0
                                            },
                                            {
                                                    "code":  "70-207",
                                                    "id":  1802,
                                                    "name":  "Probability and Statistics for Business Applications",
                                                    "units":  9.0
                                            }
                                    ],
        "equiv":  [
                                    {
                                            "code":  "36-220",
                                            "id":  357,
                                            "name":  "Engineering Statistics and Quality Control",
                                            "units":  9.0
                                    },
                                    {
                                            "code":  "36-201",
                                            "id":  606,
                                            "name":  "Statistical Reasoning and Practice",
                                            "units":  9.0
                                    }
                            ],
        "long_desc":  "This course is a singlesemester comprehensive introduction to statistical analysis of data for students in biology and chemistry. Topics include exploratory data analysis, elements of computer programming for statistics, basic concepts of probability, statistical inference, and curve fitting. In addition to three lectures, students attend a computer lab each week. Not open to students who have received credit for 36200, 3620770207, 36220, or 36226.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Given a research question, students will be able to correctly identify variable types, choose appropriate graphs and visualizations, understand underlying randomness in data if applicable, and perform appropriate hypothesis tests to make decisions. Students will also be able to communicate their results in written form.",
                                                    "key_topics":  "Exploratory data analysis, categorical/continuous variables, different data types, basic probability concepts, one/two variable hypothesis tests, the data analysis pipeline, interpreting and communicating results.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "Assignments, labs, exams, projects, and a final exam.",
                                                    "relevance":  "Students will gain an awareness and appreciation of the data analysis pipeline and be able to apply introductory level data analysis tools to applications both across disciplines (lecture/homework) and within the lab sciences (lab).",
                                                    "learning_resources":  "Lecture slides, case studies, textbooks, websites, and articles.",
                                                    "extra_time_commitment":  "None usually expected."
                                            }
}