{
        "code":  "36-200",
        "name":  "Reasoning with Data",
        "short_name":  "REASONING DATA",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [
                                            {
                                                    "code":  "36-207",
                                                    "id":  604,
                                                    "name":  "Probability and Statistics for Business Applications",
                                                    "units":  9.0
                                            },
                                            {
                                                    "code":  "36-247",
                                                    "id":  634,
                                                    "name":  "Statistics for Lab Sciences",
                                                    "units":  9.0
                                            },
                                            {
                                                    "code":  "70-207",
                                                    "id":  1802,
                                                    "name":  "Probability and Statistics for Business Applications",
                                                    "units":  9.0
                                            }
                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is an introduction to learning how to make statistical decisions and now to reason with data. The approach will emphasize the thinkingthrough of empirical problems from beginning to end and using statistical tools to look for evidence foragainst explicit argumentshypotheses. Types of data will include continuous and categorical variables, images, text, networks, and repeated measures over time. Applications will largely drawn from interdisciplinary case studies spanning the humanities, social sciences, and related fields. Methodological topics will include basic exploratory data analysis, elementary probability, significance tests, and empirical research methods. There will be onceweekly computer lab for additional handson practice using an interactive software platform that allows studentdriven inquiry.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "A student who has successfully completed the course should be able toDemonstrate conceptual understanding of the methods covered, and of the basic theory behind those methodsExhibit critical thinking about data scienceShow practical ability with the methods covered in the courseAdapt and apply R functions and structured code to the problem solving contextProduce data science workflows in a data analysis coding frameworkCommunicate results in written formExplain issues of data bias ethics in the use of data algorithms.",
                                                    "key_topics":  "Basic exploratory data analysis, elementary probability, significance tests, and empirical research methods.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Assignments, labs, exams, projects, and a final exam.",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Modeling - Other\nDietrich GenEd after Fall 2021: Computational Thinking\n\nStudents will gain an awareness and appreciation of the data analysis pipeline and be able to apply intermediate level data analysis tools to applications across disciplines.",
                                                    "learning_resources":  "Lecture slides, case studies, websites, articles, and sample code, with everything available on Canvas.",
                                                    "extra_time_commitment":  "None usually expected."
                                            }
}