{
        "code":  "36-202",
        "name":  "Methods for Statistics \u0026 Data Science",
        "short_name":  "METH STATDATASCI",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(36-247 [] at least D) or (36-220 [] at least D) or (36-207 [] at least D) or (70-207 [] at least D) or (36-200 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [
                                            {
                                                    "code":  "36-208",
                                                    "id":  609,
                                                    "name":  "Regression Analysis",
                                                    "units":  9.0
                                            },
                                            {
                                                    "code":  "70-208",
                                                    "id":  1525,
                                                    "name":  "Regression Analysis",
                                                    "units":  9.0
                                            },
                                            {
                                                    "code":  "36-309",
                                                    "id":  2343,
                                                    "name":  "Experimental Design for Behavioral \u0026 Social Sciences",
                                                    "units":  9.0
                                            },
                                            {
                                                    "code":  "36-401",
                                                    "id":  3947,
                                                    "name":  "Modern Regression",
                                                    "units":  9.0
                                            }
                                    ],
        "equiv":  [
                                    {
                                            "code":  "36-208",
                                            "id":  609,
                                            "name":  "Regression Analysis",
                                            "units":  9.0
                                    },
                                    {
                                            "code":  "70-208",
                                            "id":  1525,
                                            "name":  "Regression Analysis",
                                            "units":  9.0
                                    },
                                    {
                                            "code":  "36-326",
                                            "id":  2599,
                                            "name":  "Mathematical Statistics (Honors)",
                                            "units":  9.0
                                    }
                            ],
        "long_desc":  "This course builds on the principles and methods of statistical reasoning developed in 36200 or its equivalents. The course covers simple and multiple regression, basic analysis of variance methods, logistic regression, and introduction to data mining including classification and clustering. Students will also learn the principles of overfitting, training vs testing, ensemble methods, variable selection, and bootstrapping.   Course objectives include applying the basic principles and methods that underlie statistical practice and empirical research to real data sets and interdisciplinary problems. Learning the Data Analysis Pipeline is strongly emphasized through structured coding and data analysis projects. In addition to three lectures a week, students attend a computer lab once a week for handson practice of the material covered in lecture.  There is no programming language prerequisite.  Students will learn the basics of R Markdown and related analytics tools.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "A student who has successfully completed the course should be able toDemonstrate conceptual understanding of the methods covered, and of the basic theory behind those methodsExhibit critical thinking about data scienceShow practical ability with the methods covered in the courseAdapt and apply R functions and structured code to the problem solving contextProduce data science workflows in a data analysis coding frameworkCommunicate results in written formExplain issues of data bias ethics in the use of data algorithms.",
                                                    "key_topics":  "Single and multiple variable regression, residual diagnostics, logistic regression, one-way analysis of variance, classification models, clustering, model building, the data analysis pipeline, interpreting and communicating results, introduction to data analysis coding.",
                                                    "prerequisite_knowledge":  "Exploratory data analysis, basic probability concepts, significance testing.",
                                                    "assessment_structure":  "Assignments, labs, exams, projects, and a final exam.",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Modeling - Other\nDietrich GenEd after Fall 2021: Computational Thinking\n\nStudents will gain an awareness and appreciation of the data analysis pipeline and be able to apply intermediate level data analysis tools to applications across disciplines.",
                                                    "learning_resources":  "Lecture slides, case studies, websites, articles, and sample code, with everything available on Canvas.",
                                                    "extra_time_commitment":  "None usually expected."
                                            }
}