{
        "code":  "36-301",
        "name":  "Documenting Human Rights",
        "short_name":  "DOCUMENT HUMAN RIGHT",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will teach students about the origins of modern human rights and the evolution of methods to document the extent to which these rights are being upheld or violated. The need to understand and document human rights issues is at the center of the most pressing current events. From threats to democracy and civil rights to work holding perpetrators of mass harm accountable in legal proceedings to efforts to quantify and advance economic, social, cultural, and environmental rights, making human rights violations visible is fundamental to achieving a more just world. We will begin with an overview of the history of human rights, the main philosophical and political debates in the field, and the most relevant organizations, institutions, and agreements. We will then delve into specific cases that highlight methodological opportunities and challenges, including the identification of mass atrocity victims, the disappeared, and missing migrants efforts to estimate civilian casualties in war the documentation of police brutality and other human rights violations with smartphones as well as the use of satellite imagery and drone footage for the documentation of genocide, environmental rights, and war crimes. We will critically assess the technical challenges that arise in each context and how the human rights and scientific communities have responded. After reviewing these cases, we will conclude by reflection on why the documentation of human rights actually matters and what happens to evidence once it is gathered. Students will then take what theyve learned and do two multidisciplinary group projects, one involving the document of a rights violation in Western Pennsylvania and the other involving an international situation. Assignments include an essay, a data analysis assignment, and a group project that include a written component, quantitative andor qualitative data analysis, and a presentation.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "This course is a direct result of our desire to make the work that we do within the Center for Human Rights Science more accessible and relevant to undergraduates at Carnegie Mellon who have, or want to develop, skills and expertise that can support the work of the human rights community. Our ultimate goal is to encourage students from diverse fields to come together to contribute to the work of human rights documentation and advocacy.",
                                                    "key_topics":  "This course will examine the development of economic, social, cultural, civil, environmental, and human rights. We will study how the need to document whether rights are being upheld or violated in particular societies and around the world has evolved in tandem with the definition of rights in treaties and other instruments, and has led to the development of investigative modalities and measurement practices. We will both critically analyze those practices as well as practice implementing them in a local context.",
                                                    "prerequisite_knowledge":  "Students should have exposure to basic statistical concepts such as populations and samples, uncertainty, and hypothesis testing at an introductory level.",
                                                    "assessment_structure":  "There will be extensive reading, one essay, one case study/data analysis assignment, and a group project that includes a written component, quantitative and/or qualitative data analysis, and a presentation.",
                                                    "relevance":  "The need to understand and document human rights issues is at the center of the most pressing current events. From threats to democracy and civil rights at home and abroad to work holding perpetrators of mass harm accountable in legal proceedings to efforts to quantify and advance economic, social, cultural, and environmental rights, making human rights violations visible is fundamental to achieving a more just world.",
                                                    "learning_resources":  "Our students will have access to core human rights texts; human rights reports; the findings of human rights organizations, institutions, and tribunals; databases that we have permission to share with them; as well as access to notable human rights advocates and experts in our professional networks, several of whom will provide guest lectures.",
                                                    "extra_time_commitment":  "Students are expected to meet with their project groups outside of class and possibly conduct interviews with human rights advocates or subject matter experts on their own time."
                                            }
}