{
        "code":  "36-461",
        "name":  "Special Topics: Statistical Methods in Epidemiology",
        "short_name":  "SP TOP: STAT EPI",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "36-401 [] at least C"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Epidemiology is concerned with understanding factors that cause, prevent, and reduce diseases by studying associations between disease outcomes and their suspected determinants in human populations. Epidemiologic research requires an understanding of statistical methods and design. Epidemiologic data is typically discrete, i.e., data that arise whenever counts are made instead of measurements. In this course, methods for the analysis of categorical data are discussed with the purpose of learning how to apply them to data. The central statistical themes are building models, assessing fit and interpreting results. There is a special emphasis on generating and evaluating evidence from observational studies. Case studies and examples will be primarily from the public health sciences.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "http://coursecatalog.web.cmu.edu/schools-colleges/dietrichcollegeofhumanitiesandsocialsciences/depar",
        "custom_fields":  {
                                                    "goals":  "Students will be able to apply theoretical concepts from earlier courses to the development and application of methods in practice. They will also develop critical skills in evaluating evidence from different study designs.",
                                                    "key_topics":  "Analysis of categorical data; Issues in the analysis of observational and experimental studies of human subjects; Introduction to epidemiological methods.",
                                                    "prerequisite_knowledge":  "Probability distributions; Maximum likelihood estimation and properties of MLEs; Regression analysis",
                                                    "assessment_structure":  "Short multiple choice quizzes after each lecture; weekly homework assignments.",
                                                    "relevance":  "Students will be introduced to methods that are relevant for the analysis of data from different study designs, such as case-control studies and prospective studies, that will round out their advanced training. An emphasis on the appropriateness of methods and the interpretation of results will advance the student\u0027s ability to be a critical consumers of research.",
                                                    "learning_resources":  "Lecture notes; handouts, case studies",
                                                    "extra_time_commitment":  null
                                            }
}