{
        "code":  "36-402",
        "name":  "Advanced Methods for Data Analysis",
        "short_name":  "ADV METHODS DATA ANL",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "36-401 [] at least C"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course introduces modern methods of data analysis, building on the theory and application of linear models from 36401.  Topics include nonlinear regression, nonparametric smoothing, density estimation, generalized linear and generalized additive models, simulation and predictive modelchecking, crossvalidation, bootstrap uncertainty estimation, multivariate methods including factor analysis and mixture models, and graphical models and causal inference. Students will analyze realworld data from a range of fields, coding small programs and writing reports.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Given a research question, students will be able to identify appropriate statistical modeling approaches, justify these decisions using the relevant statistical theory, implement these approaches using R, evaluate their results and compare against other approaches, and communicate their results in written form.",
                                                    "key_topics":  "Tools for comparing statistical models, cross-validation and bootstrapping, nonparametric regression methods, logistic regression, generalized linear models, principles of causality, nonparametric density estimation, and unsupervised learning methods as time permits.",
                                                    "prerequisite_knowledge":  "Students should be familiar with basic linear algebra. Students must also be familiar with basic probability theory and principles of statistical theory, including random variables, confidence intervals and hypothesis testing, conditional expectations and variances, and maximum likelihood estimation. Students must have experience with linear regression. Students must have experience with the basic syntax of the R programming language, as well as using R to fit statistical models and construct graphics.",
                                                    "assessment_structure":  "Assignments, exams, data analysis reports, and short online quizzes about course concepts.",
                                                    "relevance":  "Students will be equipped with the tools needed to analyze complex datasets and compare different modeling approaches rigorously.",
                                                    "learning_resources":  "Lecture notes, textbooks, and some online resources.",
                                                    "extra_time_commitment":  "None usually expected."
                                            }
}