{
        "code":  "38-132",
        "name":  "DC Grand Challenge First-Year Seminar: Health in Unhealthy Times: Preventing, Ma",
        "short_name":  "SHORT TITLE: DC FIRS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "We live in times when health is a major global concern, whether we worry about the development of novel Covid19 mutations or continue to grapple with chronic illnesses such as obesity, diabetes, autoimmune diseases, cancer as well as depression and anxiety. Health and illness are key drivers of the human experience. And yet, health is fundamentally impacted by different human experiences. This first year Grand Challenges seminar will introduce students to core concepts in the life sciences that will enable them to better appreciate the scientific aspects of health. Building on this knowledge, students will then explore important psychosocial determinants, ethical constraints, and historical roots of health. Students will also develop a familiarity with the cultural and communicative skills required to argue about health, make decisions, and engage empathically with others in their health stories. We will read and discuss a broad variety of materials from medical science articles to social psychological experimental reports and personal or literary narratives about health. The course is divided into three components health and preventative behaviors coping with disruptive health experiences managing chronic health challenges. We will provide a broad overview for each category, followed by a deep dive focused on particular health issues diet and exercise prevention anxiety and depression management epidemicsCovid19cancer disruption. Given the broad array of topics discussed, we believe these components can engage students on a personal level.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Basic verbal and written communication practice basic introduction to framing a problem basic introduction to identifying argumentative framing basic introduction to collaborative practice.",
                                                    "key_topics":  "Grand Challenge Interdisciplinary First-Year Seminars in Dietrich College are team-taught courses that explore a pervasive societal problem with first year students. Faculty teams attend to topics ranging from social and economic inequality to racism to artificial intelligence to food production through a variety of disciplinary lenses, exposing students to the methods and forms of argumentation in respective disciplines. These courses will include field trips, guest speakers and community building activities in the college and in collaboration with other colleges at CMU. Students build relationships with their faculty team and classmates through collaborative inquiry on socially salient topics and practice communication skills. Intimate faculty-student relationships build as we cap ratios at one faculty member to every sixteen students.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "Students will be expected to read, write, and participate in group seminar conversations.",
                                                    "relevance":  "Students will engage in collaborative framing of a problem. They will also gain exposure to a variety of disciplines and their respective approaches to analyzing and proposing possible solutions to the topics presented.",
                                                    "learning_resources":  "Learning resources will vary from one seminar to the next but will incorporate texts, visual materials, data sets, etc.",
                                                    "extra_time_commitment":  "Supplemental field trips and lectures in addition to class time."
                                            }
}