{
        "code":  "38-230",
        "name":  "ENGAGE in Wellness: Looking Inward",
        "short_name":  "ENGAGE IN WELLNESS",
        "units":  1.0,
        "min_units":  1.0,
        "max_units":  1.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "ENGAGE in Wellness Looking Inward is a 1unit minicourse that MCS students will enroll in the spring of the sophomore year, designed to give students a holistic understanding of their own personal wellness. The course is structured around the concept of a Wellness Wheel, a model for personal wellness that is used to describe the various areas that students should reflect upon when describing, and ultimately improving, their overall wellness. The MCS Wellness Wheel has nine components intellectual, physical, emotional, spiritual, environmental, institutional or community, financial, social, and occupational health. During this first course, taken in the first mini of the sophomore year, students will select one of three areas on which to focus intellectual, emotional or physical health. They will be asked to engage in a recursive, reflective process to assess their own level of wellness in this area, develop shortterm goals for the next year and a statement of a longerterm goal in this area, identify possible resources and then choose activities that promote this aspect of wellness. Students should expect to devote 914 hours to the development and articulation of their plan in order to earn a passing grade. These hours are tied to completion of the requested assessments and not to the activities students elect to pursue in fulfillment of their wellness plan. THIS COURSE IS FOR SOPHOMORES ONLY.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "We created this course for MCS students to regularly assess their own wellness and to develop action plans for maintaining or improving multiple dimensions of their own wellness. In order to be successful as a student and professional, you must function from a state of wellness.",
                                                    "key_topics":  "Three areas (physical, emotional, intellectual) wellness were chosen as the focus of the first ENGAGE in Wellness course",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "This course does not meet but is completed entirely online and is a pass/fail course. An expectation for the completed assignment is a 2-3 page single-spaced document reflecting on one of the three areas of wellness and setting goals for improvement in that area. This is a Pass/No Pass Course",
                                                    "relevance":  "Given that the sophomore year can be a rigorous time academically, students sometimes engage in a life that lacks balance. In the midst of external pressures and demands (academic and otherwise), reflecting on and enhancing physical, emotional and intellectual wellness can serve to restore a sense of balance.",
                                                    "learning_resources":  "MCS MyCORE Canvas Site\nInstructor will be available weekly during office hours or by appointment",
                                                    "extra_time_commitment":  null
                                            }
}