{
        "code":  "48-095",
        "name":  "Spatial Concepts for Non-Architecture Majors",
        "short_name":  "SPTL CNCP NON-ARCTSI",
        "units":  10.0,
        "min_units":  10.0,
        "max_units":  10.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course serves as an introduction to the spatial concepts of architecture for students from other disciplines. The course is focused entirely on project design work this is not an historical survey, technical or lecture course. This course is very handson  Projects will explore the design and experience of spatial environments through a series of creative investigations. The semester will be broken in to 3 partsIntroExploration and a long term project. In IntroExploration, students will have many hands on opportunities to start to build a common language to describe spacial investigations as well as creating them. This will consist of short projects, with each design investigation progressively building upon the previous exploration these early projects will consist of both individual and group work. They will focus on Making.  The second half of the semester will consist of one long term project to be created individually, incorporating students personal theories of architecture based on an overarching question.  Studio work will be supported by group discussion based upon critical review of student work, readings, slide presentations, videos and films. There will also be a few field trips. Students are encouraged to explore their own areas of interest with respect to their work in class. Selfmotivation, class attendance and an open mind is mandatory, however, no prior architectural, engineering or artistic experience is required. Students are expected to perform work both inside and outside of class. Students should be prepared to purchase various supplies throughout the course. This course is in partial fulfillment of requirements for an Architecture Minor.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students gain basic understanding of architectural design process and visual communication skills",
                                                    "key_topics":  "Architecture design process, critique, analysis, and making",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Final project presentation and documentation",
                                                    "relevance":  "Learn how to communicate ideas in three-dimensional form",
                                                    "learning_resources":  "Texts via Canvas",
                                                    "extra_time_commitment":  null
                                            }
}