{
        "code":  "48-215",
        "name":  "Materials \u0026 Assembly",
        "short_name":  "MATERIALS \u0026 ASSEMBLY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "48-100 [] at least D"
                                },
        "co_reqs":  [
                                        {
                                                "code":  "48-200",
                                                "id":  3235,
                                                "name":  "Architecture Design Studio: Poiesis Studio 3",
                                                "units":  18.0
                                        }
                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course introduces and examines the fundamentals between design intent and construction materials, and the science of materials performance and their assemblies. Learning how materials and techniques inform spatial and form making decisions will be a central theme for the semester. Lectures and discussions will focus on the meaning, aesthetics and techniques related to the use of materials and the process of construction. A basic understanding of essential, wellknown systems of building construction will be our base line. Discussions and case studies of contemporary systems that extend, experiment with and question these known systems will introduce you to the great depth to which this basic knowledge can lead you. Joint assignments with the design studio will provide you with an opportunity for an indepth exploration of these fundamentals of construction through a direct application and synthesis of this new knowledge to your studio project.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://soa.cmu.edu/courses",
        "custom_fields":  {
                                                    "goals":  "Have a basic understanding of materials and their related assemblies as they relate to a site, climate, culture and sequence of construction. Develop skills on how and why to use a particular building material and its assembly. Develop skills on how to explore materials based on their inherent properties. Develop forms of communication that represent the constructability and use of materials. Develop an understanding that your designs must accommodate topics related to zoning, building codes and accessibility.",
                                                    "key_topics":  "\"48-215/ 48-647 introduces and examines the fundamentals between design intent and construction materials, the science of materials (performance) and their assemblies.\n\"",
                                                    "prerequisite_knowledge":  "A working understanding of Auto-CAD and Rhino is required.",
                                                    "assessment_structure":  "Each assignment will be discussed in detail through materials issued on Canvas. All assignments require exceptional graphics and time to do them well. Last minute efforts will result in low or failing work.",
                                                    "relevance":  "NAAB SPC B.3., Codes and Regulations: Ability to design sites, facilities, and systems that are responsive to relevant codes and regulations, and include the principles of life-safety and accessibility standards (introduced).\n\n­B.4\tTechnical Documentation: Ability to make technically clear drawings, prepare outline specifications, and construct models illustrating and identifying the assembly of materials, systems, and components appropriate for a building design (introduced).\n\nB.7\tBuilding Envelope Systems and Assemblies: Understanding of the basic principles involved in the appropriate selection and application of building envelope systems relative to fundamental performance, aesthetics, moisture transfer, durability, and energy and material resources\n(introduced).\n\nB.8\tBuilding Materials and Assemblies: Understanding of the basic principles used in the appropriate selection of interior and exterior construction materials, finishes, products, components, and assemblies based on their inherent performance, including environmental impact and reuse (introduced).\n\nB.9\tBuilding Service Systems: Understanding of the basic principles and appropriate application and performance of building service systems, including lighting, mechanical, plumbing, electrical, communication, vertical transportation, security, and fire protection systems (fire protection\nsystems introduced).\n\"",
                                                    "learning_resources":  "Fundamentals of Building Construction:¿Materials and Methods, 6th edition or later, by Edward Allen (can be purchased through Amazon.com)\n\nThe Architect\u0027s Studio Companion: Rules of Thumb for Preliminary Design, 5th edition or later, by Edward Allen (can be purchased through Amazon.com)",
                                                    "extra_time_commitment":  "Readings are required as part of the course as the lecture material provided will only give you a fraction of what you need to know in the studios ahead. An abstract of each reading is optional and will increase your final grade (1/8 of a letter grade for the course per submitted abstract). Abstracts will be reviewed by the TAs and revisions may be necessary based on their feedback before addtional credit is provided. Note abstracts are due as per the deadlines listed in the course calendar. No late abstract are acceptable. Requred revisions are acceptable up to one week later."
                                            }
}