{
        "code":  "48-315",
        "name":  "Enviroment I: Climate \u0026 Energy in Architecture",
        "short_name":  "ENVIR I",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Our commitment to designing net zero energy and indeed carbon positive buildings and communities is critical to environment equity and the UN Sustainable Development Goals. This course introduces architectural design responses for energy conservation and natural conditioning, human comfort, and the sitespecific dynamics of climate. The state of the art in building energy conservation and passive heating and cooling technologies will be presented in lectures and supported by readings and assignments.vAn overview of energy flows in buildings and energy design standards is illustrated by lectures on building energy conservation successes, and emerging demands for a broader definition of sustainability. To understand the significance of architectural design decisionmaking on energy consumption and comfort, students will compile a professional energy consultants report for a residentialscale building, designing the most viable energy conservation retrofit measures for their client from siting, massing, organization, enclosure detailing, opening control, to passive system integration and management.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://soa.cmu.edu/courses",
        "custom_fields":  {
                                                    "goals":  "students will complete an energy consultant report for a residential home analyzing site, thermal performance of building details, heat loss, total energy load breakdowns, prioritized retrofit recommendations and simple payback, as well as passive, low energy solutions.",
                                                    "key_topics":  "climate and architecture, energy and architecture, energy conservation, passive heating and cooling, sustainability and resiliency",
                                                    "prerequisite_knowledge":  "no prior knowledge required",
                                                    "assessment_structure":  "the course has 6 main assignments that are professionally assembled into a consulting report as the 7th deliverable, as well as a final exam to test overall understanding of climate and energy in buildings.",
                                                    "relevance":  "critical for architecture students, valuable for engineering and design students who are interested in sustainability",
                                                    "learning_resources":  "the course has all lectures posted on canvas, key readings from textbooks accessed through the library, and all assignment supporting materials on canvas.",
                                                    "extra_time_commitment":  null
                                            }
}