{
        "code":  "49-101",
        "name":  "Introduction to Engineering Design, Innovation, and Entrepreneurship",
        "short_name":  "INTRO TO EDIE",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will introduce formal innovation and design methods to form new opportunities, productservice solutions, and ventures within a teambased project, with particular emphasis on the translation and integration of technologies into products, services, and venture solutions. As engineers we are trained to develop solutions.  Solving problems is good.  Solving the right problems is better.  This course will teach the skills, processes, and mindset to identify the right problems that need to be solved and then develop innovative solutions to those challenges, ensuring these solutions provide value for those using it.  With this ability, the technical and problem solving skills of the other engineering disciplines can be brought to bear to create breakthrough products and services.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "One of the goals of this class is to create engineers that are prepared to be leaders in their professional fields. Understanding innovation as a skill and being comfortable with ambiguity in problem definition is something that differentiates innovators and engineering leaders from a conventional engineering graduate.When youve completed this course you should be able to do the following for a wide variety of situations and problem statementsDefine and differentiate between innovation, engineering design, and entrepreneurship and effectively relate these to other engineering disciplines.Analyze case studies and peer projects and assess how the design meets the needs and values of the user within the given engineering constraints.Apply the integrated New Product Development iNPD process to identify opportunities, determine design requirements, and conceptualize solutions.Incorporate human centered design principles in the realization of innovative engineering concepts and solutions.Evaluate and select between multiple opportunities and engineering solutions.Communicate processes and ideas in a variety of oral and written formats.Collaborate as a member of a product development team.Apply design thinking methodologies to solve realworld problems.Reflect on personal growth related to innovative thinking, creativity, and entrepreneurship and identify opportunities for improved engineering effectiveness and future possibilities.",
                                                    "key_topics":  "Innovation, Entrepreneurship, Engineering Design, Communication, Product Development, Conceptualization, User Research,",
                                                    "prerequisite_knowledge":  "An interest and curiosity in engineering and a willingness to ask questions and discuss.",
                                                    "assessment_structure":  "This is a group project-based course completed in steps throughout the semester and culminating with presentations of the innovation developed. Other low-stakes assignments, readings and reflections help build and strengthen component skills along the way.",
                                                    "relevance":  "This course teaches innovation and entrepreneurship from an engineering perspective. It enables engineers to leverage their core engineering skills with opportunities that expand their ability to be more effective innovators, entrepreneurs, and technology leaders in their chosen field and beyond. It also sets the foundational understanding of the integrated new product development process that will be applied throughout the EDIE major. The skills learned in this course can be applied to the for-profit sector and also in the context of projects for social good.\n\nDC: Disciplinary Perspectives: Engineering",
                                                    "learning_resources":  "Relevant readings, articles, and book sections will be made available to the students. We will consider and discuss real-life examples and how they apply. The course will also have guest speakers.",
                                                    "extra_time_commitment":  "It is expected that teams will meet outside of the classroom hours. We use the CATME system to identify compatible schedules."
                                            }
}