{
        "code":  "49-300",
        "name":  "Integrated Product Conceptualization",
        "short_name":  "INT PROD CONCEPT",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The Integrated Product Conceptualization course focuses on introducing students to some of the thinking, basic skills and methods used by industrial design, engineering, and business to generate new consumer product proposals within integrated teams. Teams will progress through three phases 1 identifying opportunities for new products or services, 2 understanding those opportunities through stakeholder research, value opportunity analysis, and competitive landscape assessment, then selecting one of which to focus, 3 conceptualizing the opportunity with the goal of meeting the value proposition. This course will combine lecture and studio activities including the generation of 2D visual representation skills and 3D lowfidelity physical modeling in support of course work.  An important part of this course is a design project that is carried out by interdisciplinary teams. In order to effectively contribute to their team, each student should have experience or coursework in at least one of the following design, the arts, engineeringtechnology, or business.  This course is reserved for junior and senior level students. Freshmen and sophomores will be admitted as space allows and with instructor permission.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will be able to identify, understand, evaluate, and conceptualize solutions for innovative opportunities.",
                                                    "key_topics":  "The course covers is an introduction to the methodology for innovation which will be practiced in-class through the means of a class project.",
                                                    "prerequisite_knowledge":  "This class is designed to be accessible by students of all backgrounds. However, each person should have demonstrated skills from their degree program that they can bring to bear on the project.",
                                                    "assessment_structure":  "Students will be assessed through project update reports, presentations, class participation, and individual reports.",
                                                    "relevance":  "This course is relevant to anyone interested in becoming an innovator and is meant to bring in skills from engineering and human-centered design. This class is primarily focused on getting to a product concept. This class is not focused on prototyping or on business plan writing.",
                                                    "learning_resources":  "The course will utilize a textbook (free via pdf), case studies, and web pages.",
                                                    "extra_time_commitment":  "Students are expected to work on their projects outside of class in order to conduct their research, synthesize their work, and prepare course deliverables."
                                            }
}