{
        "code":  "51-150",
        "name":  "Personal Dexign Futures",
        "short_name":  "PERSONDEXFUTURES",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "It is difficult to go on a life long journey without a plan or map. In the Design for Personal Futures microcourse, students take on the most important design project their own life. Students explore who they are, where they come from, and where they hope to go throughout their life. They describe their core values, what makes their life meaningful, and whom they hope to become in the future. While ones life is very personal, we use timetested design methods to explore each persons future. We explore readings from 1 Bill Burnett and Dave Evans approach to Designing Your Life How to Build a WellLived, Joyful Life 2 Verne Verne Wheelwrights person futures approach Its YOUR Future... Make it a Good One, and insights from Sohail Inayatullahs Personal Futures masterclass. By the end of the microcourse each student will have made a plan for their future. They will be able to explain what matters to them and have charted a way forward. Most importantly, they will know how to rechart their life plans as unexpected events require them to adapt their plans.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the microcourse each student will have made a plan for their future. They will be able to explain what matters to them and have charted a way forward. Most importantly, they will know how to rechart their life plans as unexpected events require them to adapt their plans.",
                                                    "key_topics":  "Design, personal futures, ontological design, plan your life, mattering maps",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "(1) Each student explores what matters in their life. There are step-by-step instructions to scaffold the learning experience. The project steps are graded with a rubric. The final project presentation is graded is with a rubric. (2) Readings and viewings have written comprehension questions. (3) weekly reflection posts on course material and commenting on two classmates\u0027 reflection posts is graded with a rubric. (4) In-class participation and engagement is graded.",
                                                    "relevance":  "Students explore who they are, where they come from, and where they hope to go throughout their life.",
                                                    "learning_resources":  "(1) Readings and viewings are assigned. Students answer questions on the readings before class. The readings and viewings are discussed in class. (2) Step-by-step activities are done together in small groups during class; finishing the in-class assignments can be done outside of class before the next session.",
                                                    "extra_time_commitment":  "The class dates are mostly on Wednesday, with one session on Saturday, Sunday, and Monday."
                                            }
}