{
        "code":  "51-218",
        "name":  "Concept Sketching: Quickly Aiding Understanding and Communication",
        "short_name":  "CONCEPT SKETCHING",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course explores concept sketching as a too l that aids the analysis and synthesis of information that is complex and abstract and informs the visualization of relationships that are inherent but often missed in content to support shared understanding. Students will study a topic that meets these criteria, such as decoding and comparing the approaches that various news media organizations take in highlighting and framing specific storiesWhat appears most important How is information organized How does the visual form describe the organization s values Etc. Next, students will learn how to visually depict their discoveries. They will create a visual language that is easy for people to gr asp and sketch relationships among pieces of information, such as comparisons, hierarchies, and timelines, to aid personal and shared understanding. Working in teams, students will look for similarities among their notes, build a cohesive narrative about their discoveries, and collaboratively presen t their findings to the class as realtime sketches to help them practice w hat they are learning.  Next, participants will use the key points of their presentations to inform the development of a speculative intervention that aims to address challenges they uncovered when investigating their topic. In the case of the news  media study, students will strive to help people become better informed citizens by encouraging them to think critically about their news consumption  habits not just the words but the forms of content and urging them to make comparisons among information sources. As a final step, students will use a combination of sketches and text to describe the facets and merit of their concepts in the context of a webbased post to solidify their grasp of visualization strategies and the broad application of them in their adjacent courses and professional practice.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}