{
        "code":  "51-238",
        "name":  "Learning to Design Effective Health Communications and Services",
        "short_name":  "DES HEALTH COMMUN",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Health literacy refers to how well a person can get the health information and services they need and understand them. Lack of health literacy relates directly to how often a patient speaks with a medical professional, access health information, follow medication dosage instructions, interpret health charts, make informed health decisions, and use medical tools for personal or family health care. Without these necessary skills, low health literate individuals face potential, serious risks related to medication errors, navigation challenges, and chronic condition management.  Students will learn basic communication and information design skills during this course so they can successfully create a communication design system that aids low health literate individuals at risk for chronic disease. By the end of the course, students will have designed, tested, and produced an effective health communications system that informs, motivates, and inspires people to make informed health decisions.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}