{
        "code":  "51-240",
        "name":  "Design, Brands, \u0026 Futures: Service Design Approaches and Pivots",
        "short_name":  "DES,BRANDS\u0026FUTURES",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This micro will introduce students to service design and help students develop skillsets and knowledge that will serve them in their particular area of study. This includes ways of analyzing existing businesses and services, empathizing with multiple stakeholders in a complex system, and developing ideas for ways that existing businesses and services could adapt and evolve to emerge from the pandemic more resilient. Students will also use the power of storytelling to develop presentations that communicate their ideas in compelling ways.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "This micro will introduce students to service design and help students develop skillsets and knowledge that will serve them in their particular area of study. This includes ways of analyzing existing businesses and services, empathizing with multiple stakeholders in a complex system, and developing ideas for ways that existing businesses and services could adapt and evolve to emerge from the pandemic more resilient. Students will also use the power of storytelling to develop presentations that communicate their ideas in compelling ways.",
                                                    "key_topics":  "Service design, brand strategy, user research, diagramming",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Homework completion (on time and thorough); Depth of stakeholder research; Thoroughness and level of clarity of service design mapping diagrams; Clarity of communication in the presentation; Evidence of engagement in reflection writing.",
                                                    "relevance":  "Service design is an approach to analyzing and designing complex systems that people experience over time. In this high-demand field, interdisciplinary teams work together to build empathy for diverse stakeholders and design ways for customers to seamlessly interact with employees, technology, touchpoints, and processes.",
                                                    "learning_resources":  "Students will be provided with PDFs of the lectures as well as online readings.",
                                                    "extra_time_commitment":  "There will be work required outside of class. Probably 4 hours per week."
                                            }
}