{
        "code":  "51-273",
        "name":  "Intro to Design for Climate Change",
        "short_name":  "DES FOR CLIMATE CHNG",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The United Nations Intergovernmental Panel on Climate Change IPCC issued a dire warning in October 2018 with the 1.5oC report. The report conservatively estimates that to avoid the catastrophic effects of climate change rapid decarbonization by at least 4050 by the year 2030 and 100 by the year 2050 is needed. Global mass movements are pressuring governments towards meaningful change global studentled strikes fashioned on Greta Thunberg, Extinction Rebellion in the United Kingdom, and so forth. Employee solidarity walkouts from major corporations coincided with the studentled strikes in September 2019 e.g., Amazon, Microsoft, Google, Ben and Jerrys.   In the Sciences of the Artificial book, Herbert Simon said Everyone designs who devises courses of action aimed at changing existing situations into preferred ones. What role might CMUQatar students take on during our defining existential challenge for the future of humanity and life on this planet In the Introduction to Design for Climate Change course, students explore how to become the agents of change around the challenges of the climate emergency focused on rapid decarbonization. Projects focus on different levels depending on student interest individual, campus, or community. This course is open to all students.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}