{
        "code":  "51-252",
        "name":  "Design, Brands, and Futures: Design Thinking for Sustainable Change",
        "short_name":  "DES: SUSTNBLE CHANGE",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Design Thinking is a powerful process that expands creative potential and drives sustainable innovation. Work with CMU Design faculty and acquire powerful creative tools that you can immediately put into practice as an agent of sustainable change.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "On completion of this microcourse, students will be able to HARNESS the power of Design Thinking as a tool for shaping sustainable change SYNTHESIZE commercial agendas with social and ecological concerns POSITION yourself within the Design Thinking debate, and develop a personal viewpoint ARTICULATE how your own discipline relates to Design Thinking, and how this connection might be leveraged to shape change",
                                                    "key_topics":  "Topics in this 3 unit micro-course include: understanding users more deeply; mapping wicked problems; ideation techniques; prototyping tricks and tools; pitching disruptive ideas; thinking in systems; and, sustainability leadership. Throughout the course, students produce theoretical models, critical reviews of texts, and creative design outcomes.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "There are two creative projects in this micro-course, which explore key aspects of Design Thinking, and its potential to drive change. Grades from both are aggregated, factoring-in their respective percentage weightings, to establish an overall grade for the micro-course.",
                                                    "relevance":  "Design is the process of turning existing situations into preferred ones. Design Thinking accelerates this change-making process through a powerful repertoire of tools, methods, and tactics. Through inspiring lectures, theoretical readings, and practical design challenges, students learn to harness the power of Design Thinking, and use it as an essential tool for social, environmental, and economic transformation.",
                                                    "learning_resources":  "Learning resources for this micro-course will comprise a mix of readings, videos, and podcasts. In particular, students will fully explore IDEO\u0027s extensive Design Thinking platform: https://designthinking.ideo.com. The \"resources\" section is especially helpful, with its rich repertoire of books, articles, videos, and tools.",
                                                    "extra_time_commitment":  "Students should spend 3--5 hours each week outside of class."
                                            }
}