{
        "code":  "51-261",
        "name":  "Communication \u0026 Digital Design Fundamentals",
        "short_name":  "COMM \u0026 DIG DES FUND",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "A onesemester course that introduces nonmajors to the field of communication design. Through studio projects, lectures, and demonstrations, students become familiar with the visual and verbal language of communication designers, the design process, and the communicative value of word and image. Macintosh proficiency required.  This course or 51262 is required for Design minors.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The course aims for students to illustrate an understanding for how context shapes, and is shaped by design, develop appropriate ideas in response to project assignments, build a proces for working that enables consistent, incremental growth, express, compose, and organize content visually, articulate ideas well, both verbally and visuall, collaborate with peers, and understand and integrate feedback into the creative working process",
                                                    "key_topics":  "This course introduces students to fundamental communication design principles, practices, and processes.",
                                                    "prerequisite_knowledge":  "Course is limited to undergraduate students non-design majors only",
                                                    "assessment_structure":  "As a project-based course, performance throughout course projects serve as the main form of assessment. Documentation of process, written reflections, and participation in class discussions are also reviewed.",
                                                    "relevance":  "This course engages students in common design processes through the practice of communication design grounded in projects and exercises. It also cements fundamental design principles and establishes a broad context for further study of design.",
                                                    "learning_resources":  "Classroom discussions, presentations, handouts, project briefs, timely and approriate website references, design examples and tutorials shared in class are all learning resources that are utilized.",
                                                    "extra_time_commitment":  "Studio classroom time is a mixture of group, peer, and one-on-one discussion, critique, process review, and technical presentaion. The projects themselves are designed, built, and documented on time outside of the specific scheduled class-time."
                                            }
}