{
        "code":  "51-217",
        "name":  "Photography \u0026 the Implied Narrative",
        "short_name":  "PHOTO: IMPLIED NARR",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This micro will be a creative photography class. In the end students will be better at making effective photographs. Along the way, they will learn how to deconstruct image narrative, meaning, and aesthetic choices, and be guided in the construction of photographic narrative, meaning, and aesthetics. Students will move from looking to seeing. They will learn how to embed narrative in their own pictures.   In addition, students will play with how photographers often perpetuate ideas. We will use image sequencing, editing, inclusion, and omission to build narrative around place. Well travel to a neighborhood and create a mass of photographs this could be as close as Education City or a slightly further location like Souq Waqif or Msheireb, or Katara. We will figure out what location works best forwith the people enrolled in the class. Once the set of images are created, participants will play with their order to tell multiple different stories based on given prompts for example, euphoric, sinister, joyful. In shifting time, space, characters, and how they play their parts, the photographers will tease out how their deliberate choices can either translate or trick, record or revise what was truly there.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}