{
        "code":  "51-214",
        "name":  "Introduction to DeXign Futures",
        "short_name":  "INTRO DEXIGN FUTURES",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "As corporations, governmental organizations, and nongovernment organizations face rapid change and uncertain times they are looking for new ways of thinking and acting. For designers trained to shape futures defined by change and uncertainty there are unprecedented opportunities. In this course, students explore the forces that drive change in the future i.e., social, economic, political, environmental, technological, and learn to align innovation strategically with the trajectories of those forces on longtime horizons. In the Introduction to Dexign Futures course students learn how to combine Design Thinking with Futures Thinking to create a new toolkit called Dexign Futures. Dexign is an experimental form of of design that aligns short term design of products and services with long term sustainability goals. The iDF course fills a much needed gap with skills and methods that are critically needed in our times to find product and service opportunities in a rapidly changing business environments characterized by volatility, uncertainty, complexity, and ambiguity VUCA.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}