{
        "code":  "51-229",
        "name":  "Digital Photographic Imaging",
        "short_name":  "DIGTL PHOTO IMAGING",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The objective of this course is to provide students with a practical, technical and theoretical foundation in digital imaging. The primary software for this course is Adobe Photoshop, with which students will explore construction, combination, manipulation, input, and output of image as a means of narrative creation. Through project critique and other discussion, we will also consider the aesthetic and political implications of the emergence of this and other new electronic imaging technologies.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course the student should be able to apply meaning to their illustrations, interpret others illustrations, create intended readings from their own images, create a print that is refined, explain their ideas, and manipulate a images using industry standard computer applications.",
                                                    "key_topics":  "Student will have knowledge of how: to articulate non-visual ideas visually, to understand the nuance of communicating narrative, to communicate complex ideas with little real state, to communicate both visually and verbally, to refine your crafting of 2d space, to learn the ins and outs of photoshop, to learn color management in a digital environment, to have fine crafted digital output, to digitally input, to learn digital workflow",
                                                    "prerequisite_knowledge":  "No prior knowledge is required",
                                                    "assessment_structure":  "There will be critiques on student\u0027s photographs every 2 weeks. Attendance and engagement are a requirement.",
                                                    "relevance":  "The course will provide an opportunity to make richer/more complex digital illustrations. It will teach you how to embed meaning and narrative into images.",
                                                    "learning_resources":  "Students will be given copies of readings for occasional group discussion. No textbook is required.",
                                                    "extra_time_commitment":  "Shooting and or creating of images outside of course. A fair amount of time will be needed to create illustrations/images."
                                            }
}