{
        "code":  "51-341",
        "name":  "How Things are Made",
        "short_name":  "HOW THINGS ARE MADE",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will provide a breadth of knowledge for current manufacturing, materials, and processes encountered in the industrial design field.  There will be an emphasis on actual productionmanufacture methods and not rapid prototyping methods. The class will consist of various lectures, media, electronic tools, and onsite visits to enable an understanding of how mass production affects design and design decisions.  Industrial Design Juniors  Seniors or permission of the instructor.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The student should be able to identify common materials, manufacture methods, and propose alternate processes for a designed product so that it can be made or improved through conventional manufacture and assembly processes.",
                                                    "key_topics":  "This course provides an overview of traditional manufacturing, materials, and processes necessary for the industrial design practice.",
                                                    "prerequisite_knowledge":  "A selective course for the industrial/product design track and following industrial/product design studio courses. Ability to observe, understand, and visualize in 2D mediums.",
                                                    "assessment_structure":  "Visualization assignments, two exams, and final tear-down project and presentations are given a score. Final project is weighted as 30%, two exams as 20% each, and visual assignments 30%.",
                                                    "relevance":  "Product Design track majors need to be exposed and understand the fundamental manufacturing processes and the relationship of material choice when designing for mass production and at scale.",
                                                    "learning_resources":  "Tangible examples, books, on-site tours, videos, online resources, lectures",
                                                    "extra_time_commitment":  "Expect three hours outside of class per week to complete assignments, readings, and other related research."
                                            }
}