{
        "code":  "51-328",
        "name":  "Design for Digital Systems",
        "short_name":  "DES FOR DIG SYSTEMS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Through tools and methods of user experience research and ideation, Design for Digital Systems uses webbased technologies to create functional prototypes for digital systems. Through demos, exercises, and a teambased transdisciplinary project, students will use design thinking, industrystandard UX software, and code to identify, propose, and generate novel ideas for user problems. Students will learn advanced HTML and CSS, along with basics of databasedriven web platforms using serverside technologies such as PHP and databases. The course is focused on screenbased interactions, but not exclusively so it considers what technologies are viable today while leaning into the future to solve problems. Experience with HTML, CSS, and JavaScript is recommended but not required. This course replaces 51328 and 51828 Advanced Web Design. There may be a lab fee for nondesign students.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will use design thinking, industrystandard UX software, and code to identify, propose, and generate novel ideas for user problems. This means that students will gain familiarity with methods utilized in generating and testing ideas, as well as gain experience with the technical material of these systems.",
                                                    "key_topics":  "Students will learn advanced HTML and CSS, along with basics of database-driven web platforms using server-side technologies such as PHP and databases. The course is focused on screen-based interactions, but not exclusively so; it considers what technologies are viable today while leaning into the future to solve problems. Experience with HTML, CSS, and JavaScript is recommended but not required.\"",
                                                    "prerequisite_knowledge":  "None, but HTML and CSS basics or other coding experience is highly recommended; those without prior experience will be expected to independently work through a primer learning resource, as instruction on HTML and CSS basics will be limited in this course.",
                                                    "assessment_structure":  "Work: quality, relevance, and ideas of final pieces, clarity of documentation as appropriate, technical craftsmanship employed, verbal presentation of work, and evidence of understanding of the key concepts in the project.\nParticipation and Attitude: articulation of ideas, contribution of constructive criticism, value/frequency of comments given, ability to work effectively with teams, attention to class activities, attendance, meeting deadlines, demeanor, and commitment to this class and work.\"",
                                                    "relevance":  "This course gives students a real taste of building a dynamic digital system to solve problems for users, from research methods to ideation to testing and building a functional system. Understanding how these things are made with help prepare students to better collaborate with others on these kinds of projects, as well as help students more mindfully design such systems with first-hand knowledge of how they are made from both a conceptual and technical perspective.",
                                                    "learning_resources":  "Demonstrations, readings, technical documentation/primers, critique, videos, workshop-style activities, and active learning, one-on-one meetings, assistance from TAs.",
                                                    "extra_time_commitment":  "Students are expected to spend 12 hours total on class each week, including instructional time. This translates into 5-8 hours a week outside of class, based on undergrad/graduate registration (51328/51828)"
                                            }
}