{
        "code":  "57-209",
        "name":  "The Beatles",
        "short_name":  "THE BEATLES",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will focus on the phenomenon of the Beatles. Their songs will be studied, with analysis of the musical and lyrical content and structural elements.  What musical styles do the songs address What were their musical influences  In what ways did their music change over the years Also, the musics social context will be studied. Why were the Beatles so popular and influential  What exactly caused Beatlemania How did the group form, grow, and end The Beatles are the most famous rock group in history the reasons for this are as much cultural as musical, and well study the two elements simultaneously. Open to all undergraduate students.This course counts as Music Support for undergraduate music majors.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will get a deeper understanding of the nature of the music they listen to and the greatness of the Beatles.",
                                                    "key_topics":  "The course will cover the history of the Beatles; their musical and social impact.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "There will be extensive readings, two quizzes, a mid-semester and final exam.",
                                                    "relevance":  "University students will understand how to listen to and analyze their musical choices.",
                                                    "learning_resources":  "Students will be required to read a main text and articles on the web.",
                                                    "extra_time_commitment":  null
                                            }
}