{
        "code":  "57-306",
        "name":  "World Music",
        "short_name":  "WORLD MUSIC",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "A study of major musical traditions from around the world, including classical music from Asia broadly defined and the Middle East, as well as traditional musics in Africa, Europe, and the Americas. This course will examine music in its sociocultural context, and will demonstrate how learning about music from diverse cultures increases crosscultural understanding. This course will engage with readings, listening examples, multimedia presentations, inclass discussions, musicmaking activities, and special guests virtual and in person.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Situate musical practices from around the world in their specific historical and socialcultural contexts aurally identify and describe significant musical features of diverse musical practices, using precise terminology synthesize key course questions with specific case studies in oral and written communication",
                                                    "key_topics":  "performance practice, culture, analysis, ethnomusicology",
                                                    "prerequisite_knowledge":  "Knowledge of musical terms and concepts in Euro-American classical music. Ability to read Euro-American classical notation is not required.",
                                                    "assessment_structure":  "Discussion board posts, research project, event report, preparation \u0026 participation, pop quizzes",
                                                    "relevance":  "No other course like this exists for music students to broaden their understanding of music cultures around the world. Their understanding of fundamental musical elements is challenged and expanded as different music cultures are studied.",
                                                    "learning_resources":  "Readings and listenings on Canvas",
                                                    "extra_time_commitment":  "Students need to attend one event. There are many options, including some on campus, most near to campus in Oakland. Students have all semester to attend one that fits with their schedule."
                                            }
}