{
        "code":  "60-105",
        "name":  "Cultural History of the Visual Arts",
        "short_name":  "HISTORY-VISUAL ARTS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Have you ever felt that you liked an artwork but couldnt explain why Do you have questions about art that you were always afraid to ask This course is conceived to give students the tools to feel at home when visiting a museum and talk about art in social, business and academic settings. It is organized over two semesters, but students can take only one of the two courses. Cultural History of the Visual Arts I in the fall covers the period from the 1500s to the 1800s and features masterpieces and lesser known works in Western and NonWestern art, organized chronologically and by theme. Some of the topics we will study include the controversy surrounding Leonardos and Michelangelos works, the role of censorship in the arts, the development of perspective experiments and visual theories from Antiquity onward, the concept of landscape and the status of the artist in the Ming dynasty, the impact of colonialism and postcolonial identity in South American Art, the rediscovery of Pompeii and Herculaneum and the Egyptian craze in the 1800s, the world of Opera and ballet, and the Impressionists ideas of what an artwork should be. The course also includes museum visits that will be organized taking in consideration the students schedule. No prerequisite required and open to students from all disciplines.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "What are the overall goals of this course that students will achieve after completing it\nto become acquainted with the history of art and art theory from 1500 to 1800.\nto be able to identify and critically evaluate works of art from different artistic movements and historical periods.\nto develop the ability to read and discuss key critical texts pertaining to art history, aesthetics and visual studies.\nto identify the changing social, political and theoretical context of artmaking across decades and geographic areas.",
                                                    "key_topics":  "Development of art and artistic critical theory from the 1500s to the end of 1800s.",
                                                    "prerequisite_knowledge":  "General knowledge of world history (1500-1800); General knowledge of the development of World Art (1500-1800)",
                                                    "assessment_structure":  "2 in-term exams; presentations; research essay",
                                                    "relevance":  "The course will offer students a systematic background in the historical and theoretical development of art, which constitutes a fundamental part of the artistic culture of today.",
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  "Additional visits to museums and exhibitions,"
                                            }
}