{
        "code":  "60-223",
        "name":  "IDeATe Portal: Introduction to Physical Computing",
        "short_name":  "PHYSICAL COMPUTING",
        "units":  10.0,
        "min_units":  10.0,
        "max_units":  10.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This practical projectbased course covers the basic technical skills including electronics, programming, and hardware needed to build simple interactive objects with embedded behavior using the Arduino microcontroller. A sequence of projects challenge students to apply their technical skills in creative ways. Sensor inputs covered include an ultrasonic ranger, thermometer, light sensor, and human inputs like buttons and knobs outputs to affect the world include actuators such as motors, LED lights, speakers, and haptic feedback devices. This introductory portal course has no technical prerequisites. Contact rzachariandrew.cmu.edu with any questions about the course. Students are encouraged to coregister for a fabrication course such as the micro course 99353 IDeATe Design Essentials for Laser Cutting andor 99359 IDeATe 3D Modeling and 3D Printing.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://courses.ideate.cmu.edu/60-223",
        "custom_fields":  {
                                                    "goals":  "This projectbased course provides a laddered sequence of technical learning interleaved with introduction of some basic design skills. It is useful to students in two primary domains physical computing and humancentered design thinking. These two skill sets are unrelated but each is individually portable to a wide variety of settings.",
                                                    "key_topics":  "elementary and intermediate Arduino use, including input sensors such as ultrasonic rangers, light sensors, and buttons and outputs such as motors, LEDs, speakers, and haptic feedback devices; elementary electronics; critique, feedback, reflection, and iteration",
                                                    "prerequisite_knowledge":  "Students need not have any prior training or knowledge to take this introductory-level course, though experience in programming in any language will make for an easier start.",
                                                    "assessment_structure":  "Students\u0027 technical skills are assessed through a quick sequence of exercises built-in to an asynchronous learning module. The bulk of the course grade is earned through individual and group project work and associated documentation and presentations.",
                                                    "relevance":  "This project-based course provides a laddered sequence of technical learning interleaved with introduction of some basic design skills. It is useful to students in physical computing (students learn how to quickly design and build a novel interactive device using the Arduino platform), and design thinking (students work with a client to make a custom device for them). These two skill sets are unrelated but each is individually portable to a wide variety of settings.",
                                                    "learning_resources":  "Asynchronous video lectures shared via Canvas guide students through a structured technical sequence in the first few weeks of the course. The course website includes tutorials on a variety of sensors and actuators. The instructor holds regular lab hours and is available for extra-help appointments outside of those fixed times. There is an enormous wealth of resources on the open internet, and students are expected to become adept at using forums, etc., to diagnose and solve technical problems they\u0027re encountering.",
                                                    "extra_time_commitment":  null
                                            }
}