{
        "code":  "62-371",
        "name":  "Photography, The First 100 Years, 1839-1939",
        "short_name":  "PHOTOG FIRST 100 YRS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Photography was announced to the world almost simultaneously in 1839, first in France and then a few months later in England. Accurate likenesses of people were available to the masses, and soon reproducible images of faraway places were intriguing to all. This course will explore the earliest imagemakers Daguerre and Fox Talbot, the Civil War photographs organized by Mathew Brady, the introduction in 1888 of the Kodak by George Eastman, the critically important social documentary photography of Jacob Riis and his successor, Lewis Hine, the PhotoSecession of Alfred Stieglitz, the Harlem Renaissance of James VanDerZee, the precisionist f64 photographers Ansel Adams, Imogen Cunningham, and Edward Weston, and other important photographers who came before World War II. The class will be introduced to 19th century processes, such as the daguerreotype, tintype, and ambrotype, as well as albumen prints, cyanotypes, and more.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "University students will understand the influence of photographic media on our visual culture in the areas of art, journalism, and advertising.",
                                                    "key_topics":  "The course will cover the history of photography from 1839 to World War II, with a focus on artistic and documentary developments in the field.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "There will be weekly readings, one group presentation, three written assignments, and two quizzes.",
                                                    "relevance":  "University students will understand the major history and influence of photographic media on our visual culture.",
                                                    "learning_resources":  "Students will be required to read \"Marien Photography: A Cultural History\" by Mary Warner Marien and other provided readings. The course is predominately slide lectures.",
                                                    "extra_time_commitment":  "Students will be expected to visit one off site photography exhibition ."
                                            }
}