{
        "code":  "66-132",
        "name":  "DC Grand Challenge First-Year Seminar: Health in Unhealthy Times",
        "short_name":  "DC FIRST-YR SEMINAR",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "We live in times when health is a major global concern, whether we worry about the increase in Covid19 cases, await our immunization, strive to understand the disproportionate impact of the disease on BIPOC populations, or debate mitigation measuresnot to mention ongoing concerns with common chronic illnesses such as diabetes, cancer, autoimmune disease, depression, anxiety, etc.. Health, or lack thereof, has always been a critical part of the human experience, and it is fundamentally impacted by different human experiences. This seminar will introduce students to the scientific aspects of health, its political and social determinants, ethical constraints, historical roots, as well as to the cultural and communicative skills required to dialogue about health, make decisions, and engage empathically with others in their health stories. We will read and discuss a broad variety of materials from medical science articles to social psychological experimental reports and personal or literary narratives about health. The course is divided into three components health and preventative behaviors, managing chronic health challenges, and coping with disruptive health experiences. We believe these components can represent a broad array of interest and engage students on a personal level.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Basic verbal and written communication practice basic introduction to interdisciplinary perspectives basic introduction to collaboration and teamwork.",
                                                    "key_topics":  "Grand Challenge Interdisciplinary First-Year Seminars in Dietrich College are courses that explore a pervasive societal problem with first-year students. These courses are often taught by interdisciplinary faculty teams, and occasionally by individual instructors with guest faculty from different disciplines. Faculty teams attend to topics ranging from social and economic inequality to racism to artificial intelligence to food production through a variety of disciplinary lenses, exposing students to the methods and forms of argumentation in respective disciplines. These courses often include field trips, guest speakers and community building activities in the college and in collaboration with other colleges at CMU. Students build relationships with their faculty team and classmates through collaborative inquiry on socially salient topics and practice communication skills.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "Students will be expected to read, write and participate in group seminar conversations",
                                                    "relevance":  "Students will engage in collaborative framing of a societal problem. They will also gain exposure to a variety of disciplines and their respective approaches to analyzing and proposing possible solutions to the topics presented.",
                                                    "learning_resources":  "Learning resources will vary from one seminar to the next but will incorporate texts, visual materials, data sets, etc.",
                                                    "extra_time_commitment":  "Supplemental field trips and guest lectures in addition to class time."
                                            }
}