{
        "code":  "66-137",
        "name":  "DC Grand Challenge Seminar: Causes and Consequences of Health Disparities",
        "short_name":  "DC FIRSTYEAR SEMINAR",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Why do some people live well into their nineties while others are more likely to die at an earlier age The answer to this question can be more complex than one might think. Life expectancy can be influenced by a host of individual and populationlevel factors. This course is designed to critically examine the social factors research has found to impact individual and population health experiences. This course will introduce students to the multiple approaches to researching the complex problem of health disparities in the United States with particular emphasis on perspectives from the social sciences and humanities. Specifically, students will examine how factors such as socioeconomic status, education, crime, housing, health care and food availability play important roles in the production of disparate health. Students will examine psychological factors that can create disparate health experiences and the impact of such disparities on psychological health. We will address health disparities at the individual and population levels, learning how disparate health experiences are historically and socially produced, and how such disparities produce negative physical and mental health outcomes for individuals and minoritized populations. At the end of the course, students will present a collaborative group project that examines a specific facet of US health disparities and offer a proposed solution. Using a multi disciplinary perspective, we will challenge students to discover just how important seemly unimportant interpersonal and structural factors can be in explaining health disparities and how important it is for society to take measures to address these disparities.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Basic verbal and written communication practice basic introduction to framing a problem basic introduction to identifying argumentative framing basic introduction to collaborative practice.",
                                                    "key_topics":  "Grand Challenge Interdisciplinary First-Year Seminars in Dietrich College are team-taught courses that explore a pervasive societal problem with first year students. Faculty teams attend to topics ranging from social and economic inequality to racism to artificial intelligence to food production through a variety of disciplinary lenses, exposing students to the methods and forms of argumentation in respective disciplines. These courses will include field trips, guest speakers and community building activities in the college and in collaboration with other colleges at CMU. Students build relationships with their faculty team and classmates through collaborative inquiry on socially salient topics and practice communication skills. Intimate faculty-student relationships build as we cap ratios at one faculty member to every sixteen students.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "Students will be expected to read, write and participate in group seminar conversations.",
                                                    "relevance":  "Students will engage in collaborative framing of a problem. They will also gain exposure to a variety of disciplines and their respective approaches to analyzing and proposing possible solutions to the topics presented.",
                                                    "learning_resources":  "Learning resources will vary from one seminar to the next but will incorporate texts, visual materials, data sets, etc.",
                                                    "extra_time_commitment":  "Supplemental field trips and lectures in addition to class time."
                                            }
}