{
        "code":  "66-146",
        "name":  "DC 1st Year Seminar: From Pandemics to Politics: Modeling Complex Social Systems",
        "short_name":  "DC FIRST YEAR SEMINA",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Most of the major issues confronting humanitysuch as injustice, discrimination, climate change, financial collapse, ecosystem survival, and disease epidemicsare the result of complex social systems. Such systems have multiple interacting parts that create a whole that is radically different than its constituent parts. Unfortunately, traditional scientific methods that focus on reducing systems to their parts and then analyzing each part provide little insight into complex systems. In this seminar, we will explore the behavior of complex social systems including issues such as discrimination and injustice. We will examine how to model and understand social issues using various tools such as computation and game theory, and various field perspectives including economics, finance, philosophy, political science, and sociology. As part of this class, students will collaborate in teams to develop their own models of social processes.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Basic verbal and written communication practice basic introduction to interdisciplinary perspectives basic introduction to collaboration and teamwork.",
                                                    "key_topics":  "Grand Challenge Interdisciplinary First-Year Seminars in Dietrich College are courses that explore a pervasive societal problem with first-year students. These courses are often taught by interdisciplinary faculty teams, and occasionally by individual instructors with guest faculty from different disciplines. Faculty teams attend to topics ranging from social and economic inequality to racism to artificial intelligence to food production through a variety of disciplinary lenses, exposing students to the methods and forms of argumentation in respective disciplines. These courses often include field trips, guest speakers and community building activities in the college and in collaboration with other colleges at CMU. Students build relationships with their faculty team and classmates through collaborative inquiry on socially salient topics and practice communication skills.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "Students will be expected to read, write and participate in group seminar conversations.",
                                                    "relevance":  "Students will engage in collaborative framing of a societal problem. They will also gain exposure to a variety of disciplines and their respective approaches to analyzing and proposing possible solutions to the topics presented.",
                                                    "learning_resources":  "Learning resources will vary from one seminar to the next but will incorporate texts, visual materials, data sets, etc.",
                                                    "extra_time_commitment":  "Supplemental field trips and guest lectures in addition to class time."
                                            }
}