{
        "code":  "66-139",
        "name":  "DC Grand Challenge Seminar: Reducing Conflict Around Identity and Positionality",
        "short_name":  "DC FIRSTYEAR SEMINAR",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Learning to reduce conflict requires understanding positionality and identities, and why and how societies build barriers in their populations. In this interdisciplinary course, students will learn how to talk to each other and strangers about identity its defining characteristics and how our bias influences our judgments. The social sciences elements will stress Social Identity Theory, bias, stereotypes, and ingroups and outgroups. The humanities elements will include closereading strategies and incorporate conceptual frameworks from cultural studies, literary studies, and narrative theory.   In addition to practicing the methodologies in these two disciplines, students will undertake two projects. In the first project, they will develop and implement a semistructured interview protocol for their campus peers centered around belonging. In the second project, students will employ close reading techniques to analyze Young Adult novels that address complex questions of identity, isolation, bias, and rejection. Working with one novel and Project 1 data, each team of social sciences, humanities, and data specialists will create a website to highlight inclusive successes and challenges. This final cohesive picture of themes pertaining to feelings of belonging on our campus will help guide the CMU community toward deeper understanding and acceptance practices.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Basic verbal and written communication practice basic introduction to framing a problem basic introduction to identifying argumentative framing basic introduction to collaborative practice.",
                                                    "key_topics":  "Grand Challenge Interdisciplinary First-Year Seminars in Dietrich College are team-taught courses that explore a pervasive societal problem with first year students. Faculty teams attend to topics ranging from social and economic inequality to racism to artificial intelligence to food production through a variety of disciplinary lenses, exposing students to the methods and forms of argumentation in respective disciplines. These courses will include field trips, guest speakers and community building activities in the college and in collaboration with other colleges at CMU. Students build relationships with their faculty team and classmates through collaborative inquiry on socially salient topics and practice communication skills. Intimate faculty-student relationships build as we cap ratios at one faculty member to every sixteen students.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "Students will be expected to read, write and participate in group seminar conversations.",
                                                    "relevance":  "Students will engage in collaborative framing of a problem. They will also gain exposure to a variety of disciplines and their respective approaches to analyzing and proposing possible solutions to the topics presented.",
                                                    "learning_resources":  "Learning resources will vary from one seminar to the next but will incorporate texts, visual materials, data sets, etc.",
                                                    "extra_time_commitment":  "Supplemental field trips and lectures in addition to class time."
                                            }
}