{
        "code":  "66-138",
        "name":  "DC Grand Challenge First-Year Seminar: Militarizing Freedom Arms in U.S. Culture",
        "short_name":  "DC FIRSTYEAR SEMINAR",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This seminar examines the way American culture and politics have utilized the tools, tactics, and values of the military during both war and peacetime. Utilizing several disciplinary perspectives, including history, rhetorical criticism, fictional narrative, and the discourse of public policy, we will consider the different ways that gun culture, military mobilization, veteran affairs, and police power have influenced American society, including how people relate toor fearone another. We will explore some historical roots of the U.S.s militarized culture, alongside the linguistic, argumentative, and narrative trends that have contributed to urgent democratic issues like police brutality, domestic terrorism, and the rise of the carceral state.  This course will address themes and questions such as     American exceptionalism Does violence play an extraordinary role in American and culture, in contrast to other nations What are its historical antecedents     The escalation of violence in American political culture Why does political polarization engender violence Do traditional appeals to freedom accelerate such violence      How has America become a country of prisons and mass incarceration     Global impacts How does the U.S.s militarized political culture impact nations and people beyond its borders",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Basic verbal and written communication practice basic introduction to interdisciplinary perspectives basic introduction to collaboration and teamwork.",
                                                    "key_topics":  "Grand Challenge Interdisciplinary First-Year Seminars in Dietrich College are courses that explore a pervasive societal problem with first-year students. These courses are often taught by interdisciplinary faculty teams, and occasionally by individual instructors with guest faculty from different disciplines. Faculty teams attend to topics ranging from social and economic inequality to racism to artificial intelligence to food production through a variety of disciplinary lenses, exposing students to the methods and forms of argumentation in respective disciplines. These courses often include field trips, guest speakers and community building activities in the college and in collaboration with other colleges at CMU. Students build relationships with their faculty team and classmates through collaborative inquiry on socially salient topics and practice communication skills.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "Students will be expected to read, write and participate in group seminar conversations.",
                                                    "relevance":  "Students will engage in collaborative framing of a societal problem. They will also gain exposure to a variety of disciplines and their respective approaches to analyzing and proposing possible solutions to the topics presented.",
                                                    "learning_resources":  "Learning resources will vary from one seminar to the next but will incorporate texts, visual materials, data sets, etc.",
                                                    "extra_time_commitment":  "Supplemental field trips and guest lectures in addition to class time."
                                            }
}