{
        "code":  "66-147",
        "name":  "DC Grand Challenge First-Year Seminar: (Mis)Trust in Research",
        "short_name":  "DC FIRST-YEAR SEMINA",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Why is there declining public trust in research and expertise What kinds of skills are needed to assess the quality of research, and how prevalent are they in the general public Finally, what can experts do to address the erosion of trust in research This course will allow students to investigate the various causes of declining trust in research, such as data manipulation, plagiarism, and conflicts of interest in how research is funded, among others. We will explore the various disciplinary perspectives on research validity, and compare and contrast these with public perspectives on research validity. Along the way, students will be introduced to evidence synthesis methodology, a broad research approach that allows researchers to assess large bodies of literature and find points of consensus in any topic area such as climate change, vaccines, economic inequality, etc. Students will work in teams to formulate their research questions on a topic of their selection and then conduct evidence synthesis projects related to mistrust in that research area. The evidence synthesis project will have multiple stages of design and implementation and culminate in a final presentation of their findings as to how trust in research can be improved.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Basic verbal and written communication practice basic introduction to interdisciplinary perspectives basic introduction to collaboration and teamwork.",
                                                    "key_topics":  "Grand Challenge Interdisciplinary First-Year Seminars in Dietrich College are courses that explore a pervasive societal problem with first-year students. These courses are often taught by interdisciplinary faculty teams, and occasionally by individual instructors with guest faculty from different disciplines. Faculty teams attend to topics ranging from social and economic inequality to racism to artificial intelligence to food production through a variety of disciplinary lenses, exposing students to the methods and forms of argumentation in respective disciplines. These courses often include field trips, guest speakers and community building activities in the college and in collaboration with other colleges at CMU. Students build relationships with their faculty team and classmates through collaborative inquiry on socially salient topics and practice communication skills.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "Students will be expected to read, write and participate in group seminar conversations.",
                                                    "relevance":  "Students will engage in collaborative framing of a societal problem. They will also gain exposure to a variety of disciplines and their respective approaches to analyzing and proposing possible solutions to the topics presented.",
                                                    "learning_resources":  "Learning resources will vary from one seminar to the next but will incorporate texts, visual materials, data sets, etc.",
                                                    "extra_time_commitment":  "Supplemental field trips and guest lectures in addition to class time."
                                            }
}