{
        "code":  "66-151",
        "name":  "DC Grand Challenge First-Year Seminar: Equity and the Environment",
        "short_name":  "DC FIRST-YEAR SEMINA",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "How does air quality in one city differ from air quality in another Do citizens have a right to clean air, regardless of where they live How does global climate change impact the discussion of environmental and human health The answer to these and other questions about environmental quality are complex and manifest at global and local levels. Access to environmental justice, that is, the right to a healthy environment, is linked to social factors like race, ethnicity, indigenous identity, income, educational status, and geographic location, among others.By analyzing the case of Pittsburgh, a city in the rust belt and Appalachian region that is working to reimagine its environmental identity, students will trace past environmental issues and define current environmental concerns that may manifest both locally and globally. They will use environmental justice as a framework to examine how environmental issues are defined and how policies are created and enacted when different voices are included. Students will explore these topics as they relate to multiple sectors e.g., air and water quality, agriculture, industry, transportation, architecture and environmental impacts like human physical and mental health or global climate change. Students will also be introduced to concepts like sustainable science and sustainable humanities, and study how environmental problems and solutions are framed in different cultures, communities, and academic disciplines ranging from science to social science and art.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Basic verbal and written communication practice basic introduction to interdisciplinary perspectives basic introduction to collaboration and teamwork.",
                                                    "key_topics":  "Grand Challenge Interdisciplinary First-Year Seminars in Dietrich College are courses that explore a pervasive societal problem with first-year students. These courses are often taught by interdisciplinary faculty teams, and occasionally by individual instructors with guest faculty from different disciplines. Faculty teams attend to topics ranging from social and economic inequality to racism to artificial intelligence to food production through a variety of disciplinary lenses, exposing students to the methods and forms of argumentation in respective disciplines. These courses often include field trips, guest speakers and community building activities in the college and in collaboration with other colleges at CMU. Students build relationships with their faculty team and classmates through collaborative inquiry on socially salient topics and practice communication skills.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "Students will be expected to read, write and participate in group seminar conversations.",
                                                    "relevance":  "Students will engage in collaborative framing of a societal problem. They will also gain exposure to a variety of disciplines and their respective approaches to analyzing and proposing possible solutions to the topics presented.",
                                                    "learning_resources":  "Learning resources will vary from one seminar to the next but will incorporate texts, visual materials, data sets, etc.",
                                                    "extra_time_commitment":  "Supplemental field trips and guest lectures in addition to class time."
                                            }
}