{
        "code":  "66-182",
        "name":  "Grand Challenges Seminar: Preserving History with Blockchain Technology",
        "short_name":  "GRAND CHALLENGE",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Historical information, artifacts, and relics provide a window to our past and help us understand our present and foresee and prepare for the future. During times of conflict and internecine warfare, it is essential to preserve objects of historical and cultural heritage. Blockchain is a block of data chained together. It does three noteworthy things 1. digitization, 2. tracing, and 3. security. For any nondigital historical data, Blockchain can provide digitization. For any data that requires tracing, such as scientific findings, religious information, or scriptures including Hadithsayings of the Prophet s, so on, tracing can play a pivotal role in going back to the originator and understanding the change on the way, as well as preserving it from any changes which is part of security. Blockchain also involves a mining process, which includes stakeholders that audit the information of any newly added block of data, making Blockchain auditable, which is significant for history.   Using topics from blockchain technology, history, preservation, and science, this course provides students with the grand challenge of understanding how bitcoin and cryptocurrency can assist in providing potential solutions to the problems of authorship, impermanence, managing shared ownership, and stewardship of artifacts taken through war or colonialism. Many institutions and archives are considering and advocating the merits of blockchainbased repositories. In this Grand Challenge course, we want to examine how the seemingly opposed fields of study  history and blockchain technology  can be synergized to create a futuristic museum that captures monuments and artifacts, making them accessible to future generations.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students taking this course will be able toLearn the basic concepts of blockchain technology, and its use in archiving, sourcing, preserving, and restitution of ownership rights of historical relics, texts, and artifacts.Perform historical research using both published and archival sources.Work collaboratively in groups and share research presentations on blockchain technology and its use in documenting history. Perform critical thinking and write reflection journals and participate in class discussions. Understand the differences in the role of blockchain technology in digitization, traceability, and security aspects of history.",
                                                    "key_topics":  "This course explores the potential of blockchain technology in the field of history. It aims to bridge the gap between history and blockchain and introduces students to the intersection of these seemingly unrelated disciplines. Through a combination of historical analysis, technical exploration, and real-world case studies, students will understand how blockchain can be harnessed to preserve, authenticate, and revolutionize the preservation of history. This course combines lectures, group discussions, and research projects to give students a deep understanding of blockchain technology and its applications in history.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Class participation and engagement: 10%\nQuizzes and assignments: 60%\nGroup projects and presentation: 30%",
                                                    "relevance":  "Information Systems, History",
                                                    "learning_resources":  "The readings will be identified on a weekly basis and updated on Canvas.",
                                                    "extra_time_commitment":  null
                                            }
}