{
        "code":  "66-134",
        "name":  "DC Grand Challenge First-Year Seminar: Native Americas: Facts and Fictions",
        "short_name":  "DC FIRST-YR SEMINAR",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "How did Indigenous people respond to the challenges of populating the American hemisphere and creating complex, diverse and dynamic cultures, languages and political entities How did they survive, adapt to, and resist the conquest and colonization of their lands, and ensuing social and cultural dislocations How have they resurged politically, culturally, artistically and intellectually in recent years This course considers the history, experiences, and perspectives of native populations across the Americas. It seeks to reckon with the facts of the Native American experience, while challenging the fictions of stereotypes and narratives that have often relegated Indigenous people to the social and cultural margins of the nations in which they now live. After introducing students to a few of the myriad Indigenous groups of North, Central and South America, we will then survey the implications of the era of European conquest and colonization. Well consider the implications of the rise of new nations in the Americas, as new and intensifying campaigns of violence were unleashed against Indigenous populations. We will consider the rise of Native American civil rights and political and cultural sovereignty movements from the late 20th century forward, as they coalesced into major political challenges to native marginalization and demands for recognition and reparation of historical injustices. Finally, we will explore how contemporary Indigenous artists, authors, and political and social activists are reimagining indigeneity the condition and experience of being Indigenous in ways that demonstrate how indigeneity is not a fixed kind of identity, not one that is confined or defined in any way by a static conception of tradition, but rather one that challenges the present and reimagines the future in dynamic and creative ways.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Basic verbal and written communication practice basic introduction to interdisciplinary perspectives basic introduction to collaboration and teamwork.",
                                                    "key_topics":  "Grand Challenge Interdisciplinary First-Year Seminars in Dietrich College are courses that explore a pervasive societal problem with first-year students. These courses are often taught by interdisciplinary faculty teams, and occasionally by individual instructors with guest faculty from different disciplines. Faculty teams attend to topics ranging from social and economic inequality to racism to artificial intelligence to food production through a variety of disciplinary lenses, exposing students to the methods and forms of argumentation in respective disciplines. These courses often include field trips, guest speakers and community building activities in the college and in collaboration with other colleges at CMU. Students build relationships with their faculty team and classmates through collaborative inquiry on socially salient topics and practice communication skills.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "Students will be expected to read, write and participate in group seminar conversations.",
                                                    "relevance":  "Students will engage in collaborative framing of a societal problem. They will also gain exposure to a variety of disciplines and their respective approaches to analyzing and proposing possible solutions to the topics presented.",
                                                    "learning_resources":  "Learning resources will vary from one seminar to the next but will incorporate texts, visual materials, data sets, etc.",
                                                    "extra_time_commitment":  "Supplemental field trips and guest lectures in addition to class time."
                                            }
}