{
        "code":  "66-236",
        "name":  "Introduction to Environmental Ideas",
        "short_name":  "ENVIRONMENTAL IDEAS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "By recognizing that environmental problems are themselves complex and require insights from social, political, and scientific perspectives, the interdisciplinary Program in Environmental and Sustainability Studies ESS prepares students to gain proficiency in different disciplinary habits of thinking. As part of this endeavor, students take part in informed discussions about interpretive lenses ways of seeing and thinking about social, cultural, and historical contexts for interpretations of environment and sustainability.  This seminarstyle course introduces key methods and approaches for interdisciplinary inquiry within a framework of Environmental Humanities and Environmental Justice. Scholar Giovanna de Chiro writes The term environmental justice emerged from the activism of communities of color in the United States in the latter half of the twentieth century...They advocate for social policies that uphold the right to meaningful, democratic participation of frontline communities in environmental decision making.  The implications of disciplinary narratives and approaches to questions of environment and sustainability, and the implications for social justice, are a key and repeated question in the course. The role of poverty as a cultural, political, and historical phenomenon is a motif in many of our discussions. Well explore contrasting historical, cultural, and disciplinary explanations for hunger, famine, and food insecurity. Further, well explore how socalled environmental explanations for food scarcity, which rationalize the persistence of hunger and poverty in the 21st century, have distracted from decades of expertise, reminding us that hunger and poverty are social problems. In contrast to these socalled environmental explanations, there is no scarcity of food in the present era. This course will examine how these narratives contradict each other, and why it matters.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Identify historical and narrative differences in approaches to environment and sustainability, from the late 19th century until present and the implications of these narratives for social justice. Assess differing narratives of causation for problems of environment and sustainability. Contextualize disciplinary perspectives from population ecology historical demography sociology development economics history of science literary criticism anthropology systems analysis with largescale computing as they apply to particular questions of environment and sustainability. Examine ones own perspectives and disciplinary contributions and recognize alternative disciplinary approaches and contributions.",
                                                    "key_topics":  "Interdisciplinary humanistic, social, and science perspectives for the study of Environment and Sustainability - Concepts about Population from the subdiscipline of Population Ecology, and the history of attempts to apply human-environment models across disciplines (attitudes towards poverty, racism and eugenics, \"tragedy of the commons,\" \"population bomb\") - Environmental Justice: the application of social justice for environmental problems, typically related to pollution and its impacts",
                                                    "prerequisite_knowledge":  "None, but this course should not be taken in the first year. It is primarily geared towards sophomore and junior students.",
                                                    "assessment_structure":  "Course requirements - complete all course readings as assigned - participate in class discussion - participate in small group activities during class time - complete short written assignment for each week of class - complete a group project with an individual essay component, to be submitted on Canvas.",
                                                    "relevance":  "This course fulfills a requirement for the Minor and Addl Major in ESS. Environmental problems are complex and require insights from both scientific and social perspectives. For example, it is not enough to tackle climate change solely by knowing the science; it is also very important to communicate well, and to understand the relevant ethics, economics, policy, and business aspects. In addition to the example of climate change, this course includes and draws awareness to concepts coming from different disciplines, especially humanistic disciplines, calling these \"Environmental Ideas.\" The course builds competence for students to identify, and name, different approaches for dealing with complex problems of environment and sustainability.",
                                                    "learning_resources":  "Mostly ebooks available through CMU Libraries and pdfs linked on Canvas. The course relies heavily on Canvas web-based resources.",
                                                    "extra_time_commitment":  null
                                            }
}