{
        "code":  "67-135",
        "name":  "Discover, organize, and synthesize: Building your research toolkit beyond Google",
        "short_name":  "BUILD RESEAR TOOLKIT",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The world of academic research literature is growing exponentially across all disciplines, leaving researchers and decisionmakers with a conundrum how do we effectively identify research gaps and how do we make sense of what we already know, given the millions of research articles published every year This micro course will equip students with techniques and tools for a systematic approach to finding, assessing and making sense of research knowledge, applying principles from wellestablished synthesis methods. Students will explore the scholarly research in interdisciplinary topics and topics in their own subject areas. Students will gain skills they can apply to any research course, and will be able to use these techniques in their future careers as practitioners for making sound, evidence and researchbased decisions.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "After taking this course, students will be able to 1. Describe the landscape of the scholarly literature and the different approaches to navigating it including keyword searching, citation tracing and the use of AIdriven tools. 2. Construct effective strategies for finding, accessing, and organizing scholarly research on a given topic. 3. Assess and discuss the relevance and methodological approach of a scholarly article toward answering a research question. 4. Manage a streamlined research workflow with free andor open source tools and software. 5. Identify and recognize the value of open science principles and practices in the conduct of collaborative literature review research and its implications for evidencebased practice.",
                                                    "key_topics":  "Finding and evaluating scholarly research Using software tools like Zotero and Obsidian to organize research papers and workflows Applying open science principles for more effective knowledge synthesis and evidence-based practice in the real world",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Learning toward the course goals will be assessed through brief assignments and in-class activities and participation. Assessments structures will include: 1. Class participation including contributions to class discussions, interactions with peers and instructors, and engagement with in-class activities. 2. Brief individual assignments demonstrating students\u0027 comprehension of the in-class material and the effective use of tools like Zotero, LibKey Nomad and Obsidian. 3. A collaborative assignment in which students conduct independent screening of search results for relevance to a research question and resolve conflicts by discussion and consensus. 4. Reflective journaling: Students will be asked to write brief weekly reflections on their learning journey, prompting introspection about their own research practices and workflows in the context of evidence-based practice and open science principles.",
                                                    "relevance":  "The concepts, tools and skills learned in this course will be immediately applicable to other courses and scholarly activities that involve engaging with the existing scholarly literature, including finding and accessing scholarly articles, assessing and interpreting scientific findings, and organizing and synthesizing research knowledge. Students will also learn about and reflect on current research on learning, scholarly identity and/or scientific literacy in their disciplines and apply this knowledge to their own learning journeys.",
                                                    "learning_resources":  "Students will search library databases, use freely available bibliographic knowledge graph tools, and use library services to access full text articles. Students will collaborate to identify research studies that address the research question and will present, in a journal-club-like format, the findings of one relevant study. Students will use free research management tools to manage, organize and annotate research papers and related notes, incorporating research workflow practices that will facilitate effective research synthesis and mitigate accidental plagiarism. Finally, students will be encouraged to reflect on their own learning journey and the implications of open research practices and principles for more effective knowledge synthesis and evidence-based practice in the real world.",
                                                    "extra_time_commitment":  null
                                            }
}