{
        "code":  "67-102",
        "name":  "Concepts of Information Systems",
        "short_name":  "CONCEPTS OF INFO SYS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is an introduction to the world of Information Systems IS. It introduces the core concepts of IS and its importance in the modern world around us. The course provides a general overview on the implications of information systems on organizations, by describing what an information system is presenting some IS app. This course provides an introduction to the world of Information Systems IS. It introduces the core concepts of IS and its importance in the modern world around us.  The course provides a general overview of the implications of information systems to organizations, by describing what an information system is, presenting some IS applications, and discussing the implications of information systems on social and human aspects. The course also provides an initiation to essential information systems skills such as teamwork and project management. Classes will typically consist of lectures, guest speakers, labs with handson applications projects, and a semesterlong team project.  lications and discussing the implications of information systems on social and human aspects. The course also provides an initiation to essential information systems skills such as team work and project management.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}