{
        "code":  "67-202",
        "name":  "The Softer Side of Software",
        "short_name":  "SOFT SIDE OF SOFTWAR",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Even the most skilled technologist relies on soft skills to reach their maximum potential in their careers. Beyond hiring and promotions, these skills will help students advocate for themselves and handle a variety of challenging situations. We all struggle with some soft skills areas, but those skills can be identified and improved. This mini course allows students an opportunity to focus on these soft skills in three major areas building consensus, inspiring change, and embracing confrontation. Students practice soft skills throughout the course, and are expected to participate in reflection journaling, individual and group projects, and discussions, activities, games and simulations in class.  An understanding of Information Systems in the enterprise is preferred. This course has some space available to students outside of the Information Systems program.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Assess their own abilities on soft skills as they learn and practice them. Develop approaches to improve their abilities for a given soft skill. Synthesize learning from readings, discussion, skill building exercises and role plays and apply it in a professional context. Communicate ideas effectively in a formal setting, e.g. presentation. Communicate ideas effectively oneonone or in small groups.",
                                                    "key_topics":  "A focus on soft skills, exploring a breadth of topics. Specific topics include: leadership, facilitation, presentations, vulnerability, and self-advocacy.",
                                                    "prerequisite_knowledge":  "An understanding of Information Systems in the enterprise is preferred.",
                                                    "assessment_structure":  "Students are expected to participate in in-class activities and discussions, complete weekly reflection journal entries, and complete 3 short projects related to specific skills: a presentation, an email revision, and a meeting facilitation (done by a group).",
                                                    "relevance":  "Students will gain experience practicing key soft skills and evaluating their improvement. Corporate senior leaders and hiring managers emphasize the importance of soft skills to success of their employees. Beyond hiring and promotions, these skills serve students advocating their ideas and handling a variety of challenging situations.",
                                                    "learning_resources":  "Readings, videos and guest lecturers. Readings are from a variety of sources-all are available in either Canvas or the library website.",
                                                    "extra_time_commitment":  null
                                            }
}