{
        "code":  "67-223",
        "name":  "Digital Trace and Identity",
        "short_name":  "DIGITAL TRACE \u0026 IDEN",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course introduces students to the principles and applications of digital forensics. Students become aware of the digital traces they leave behind and how these traces can be used in forensics.  Students are introduced to the typical lifecycle of a digital trace. They develop their practical digital investigation skills in computer laboratory classes by studying this lifecycle with the help of computer tools.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The course aims to introduce the theory and practical of digital forensics. Students will learn the forensics lifecycle using various computer tools.",
                                                    "key_topics":  "Introduction to digital trace and identity\nDigital forensics process and steps\nProcessing the crime scene for digital evidence\nForensic copy or \u0027imaging\u0027\nAnalysis of digital evidence\nAnalysis of Windows artefacts\nAnalysis of Internet and Network artefacts\nAnalysis of Internet and Application artefacts\nPresenting and reporting on digital evidence\nIntroduction to MacOS and Linux artefacts",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Quizzes, Computer Lab, Take Home Assessment",
                                                    "relevance":  "Information security remains one of the main concerns in the digital world. Irrespective of the available preventive measures (such as encryption), attacks in the cyberspace are happening almost in daily basis. Such attacks are not limited to the digital world only. In the past, digital information and the computer have also been used for launching attacks in the physical world (e.g., in kidnapping someone). This course aims to study the aftermath of such attacks to understand how such attacks happened. This is essential for (i) bringing the culprit into justice, (ii) limiting the influence of an ongoing attack, and (iii) being better prepared for future attacks.",
                                                    "learning_resources":  "Quizzes, Computer Lab, Take Home Assessment",
                                                    "extra_time_commitment":  "2-3 hours per week"
                                            }
}