{
        "code":  "67-384",
        "name":  "Digital and Cybercrime",
        "short_name":  "DIGITAL \u0026 CYBERCRIME",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "15-112 [] at least D"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will discuss various types of cybercrime and ways to deal with them. Students will learn who are doing this cybercrime, and how the technology and peoples psychology can be manipulated by them to do a cybercrime. Taking multimediabased cybercrime as an example, the course, will then discuss how to deal with such cybercrime. To that end, students will be introduced various multimediabased cybercrime tools, and they will develop their practical digital investigation skills through the use of computer laboratory classes. Cybercrime involving the advanced technologies, such as deepfake, LLM, etc. will also be introduced.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The course aims to introduce the theory and practical of cybercrime. Students will learn how the combination of technology and psychology can be used to launch cybercrime. They will then learn how to deal with such cybercrime to keep our society and business houses safe.",
                                                    "key_topics":  "Introduction to Cybercrime, Cybercrime types, and Government response to Cybercrime.\nTechnology behind Cybercrime (DoS, Dynamic IP, Botnet, encrypted channels, etc.).\nSocial engineering: The psychological tools of Cybercrime\nOnline harassment and misinformation: Cyberstalking, Cyberbullying, Trolling, Hate speech, and Fake news\nMultimedia-based Cybercrime: Child porn, Revenge porn, Media tampering, and Deepfake\nDealing with multimedia-based cybercrime (multimedia forensics)\nDealing with multimedia-based cybercrime (multimedia forensics) Cont.\nElectronic theft, Corporate espionage, Intellectual property theft\nRole of privacy in Cybercrime and Anti-forensics.",
                                                    "prerequisite_knowledge":  "15-112",
                                                    "assessment_structure":  "Quizzes, Computer Lab, Take Home Assessment",
                                                    "relevance":  "The proliferation of digital transformation is increasing the cybercrime cases everyday. Cybercriminals are finding ways to do a crime using a new technology. Similar to how we deal with crime in our physical world, such crime in the cyber space needs to be dealt with to keep our society and business safe. This subject aims to teach students about the cybercrime, how they happen, and how to deal with them.",
                                                    "learning_resources":  "Social Engineering: The Art of Human Hacking\nHandbook of Digital Forensics of Multimedia Data and Devices\nHandbook of Digital Forensics and Investigation by Eoghan Casey",
                                                    "extra_time_commitment":  "2-3 hours"
                                            }
}