{
        "code":  "67-352",
        "name":  "Electronic Business and Design Thinking",
        "short_name":  "ELECTRONIC BUSINESS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The objective of this course is to give students a good understanding on how ebusiness is conducted and managed including opportunities, limitations, issues, and risks. Ebusiness applications require certain technological infrastructures and other support mechanism in areas of businesstoconsumer, businesstobusiness, and consumertoconsumer. Topics will cover the technologies, skills and business concepts that surround the emergence of electronic business and the impacts of applying these information technologies to different commercial processes from both an operational and strategic perspective. The course will also explore the problems surrounding electronic business such as security, privacy, intellectual property rights, legal liabilities and global issues.  The course provides a contemporary exposure to concepts and practices associated with a new and dynamic digital environment in the real business world. The information technologies associated with the delivery of Internet sites as well as internal operations will be discussed. After completion of this course, students are expected to have appropriate level of knowledge, skills, and concept of the digital operations in a modern business world.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Discuss current and future trends of ebusiness models and technologies by applying critical, analytical and technical skills. Critically evaluate ebusiness opportunities and challenges in various business and technology platforms. Discuss the benefits, issues and risks involved in the development, implementation and ongoing maintenance of an ebusiness project. Discuss how organizations and individuals can use the internet technologies and ebusiness for competitive advantage. Develop an ebusiness initiative and business plan.",
                                                    "key_topics":  "This course introduces students to Introduction to E-commerce, E-commerce Business strategies, E-commerce Marketing and Advertising, Online Retail and Services, Online communities.",
                                                    "prerequisite_knowledge":  "67-272 is a prerequisite for this course unless otherwise approved by the instructor. Junior and Senior students are suitable for enrolment.",
                                                    "assessment_structure":  "Assessments in the course typically include major e-business development project, design thinking assessment, case analysis, presentation, field studies.",
                                                    "relevance":  "This course is relevant to all IS students. It provides possible carrer paths in Ebusiness analysts, E-business strategist, E-business developer, and Enterprenur, IT consultant and management consultant.",
                                                    "learning_resources":  "The course has has a combination of online materials consisitng of scholarly articles, government publication, and industry reports, as well as relevant textbook .",
                                                    "extra_time_commitment":  "This is a 9 units course. On average, a student is expected to spend 9 hours a week on this course, consisiting of 3 hours in class and 6 hours of self study."
                                            }
}