{
        "code":  "67-427",
        "name":  "Privacy and Security Capstone",
        "short_name":  "PRIVACY AND SECURITY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is the capstone course for the Privacy and Security concentration in Information Systems.  It requires students to engage in a substantive project related to Privacy andor Security that will be primarily independent but guided by faculty.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1.Synthesize and apply the principles of Information Systems.2.the knowledge, skills, and abilities related to Privacy and Security.3.Demonstrate the ability to apply the learning from throughout the major and concentration to a substantive project",
                                                    "key_topics":  "This course is the capstone course for the Privacy and Security concentration in Information Systems. It requires students to engage in a substantive project related to Privacy and/or Security that will be primarily independent but guided by faculty.",
                                                    "prerequisite_knowledge":  "Completion of at least two IS concentration courses and enrolled concurrently in a third",
                                                    "assessment_structure":  "Assessments in this course could typically include class discussions, debates, research reports, presentations, assignments, homework, quizzes, case studies, and a term project. Assessments adopt an individual perspective and a team perspective. Refer to the course outline for specific details.",
                                                    "relevance":  "The course is relevant to all students in the Privacy and Security concentration as it acts as the synthesis of the material learned throughout there is program and concentration.",
                                                    "learning_resources":  "The learning resources primarily consist of textbooks, scholarly articles, industry reports and case studies, as well as online materials.",
                                                    "extra_time_commitment":  "This is a 9 unit course. On average, a student is expected to spend 9 hours a week on this course, consisting of 2.5 hours in class and 6.5 hours of self-study"
                                            }
}