{
        "code":  "67-425",
        "name":  "Special Topics - Capstone course in Digitalization",
        "short_name":  "CAPSTN DIGITAZATION",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Most organizations including your future employers use enterprise systems to run their business processes such as sales, procurement, and production. This course discusses key business processes in organizations and the role, functions and technical foundations of enterprise systems such as Enterprise Resource Planning ERP systems and Customer Relationship Management CRM systems. Through handson use of enterprise systems in multiple case studies, the students will become familiar with the key concepts in such systems and demonstrate practical knowledge on how such systems allow organizations to run endtoend business processes such as ordertocash or maketoorder. The course also addresses the lifecycle of enterprise systems projects and their various phases such as selection, implementation, operation and maintenance.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "On the successful completion of this course, students will be able to 1Explain what business processes are and the importance of business process management2Explain the role, value, and architecture and the different types of enterprise systems3Describe key processes in organizations and how enterprise systems support them4Demonstrate working knowledge of SAP ERP systems to execute various business processes5Explain the lifecycle of selecting, implementing, and operating enterprise systems",
                                                    "key_topics":  "This course introduces the students to business processes and enterprise systems such as Enterprise Resource Planning systems (ERP) and Customer Relationship Management systems (CRM). The course also addresses the lifecycle of selecting, implementing, operating and maintaining enterprise systems.",
                                                    "prerequisite_knowledge":  "This is a capstone course for the concentration Digitalization. Students should have already passed 67-272 and two electives from that concentration. Senior students are suitable for enrolment",
                                                    "assessment_structure":  "Assessments in the course typically include homework assignments, quizzes, exams, graded in classwork and a project.",
                                                    "relevance":  "This course focuses on enterprise systems as a key enabler for Digitalization and for the digital transformation of today\u0027s organizations. Students will learn about a variety of enterprise systems, which they will find later in their future workplace. Also, students will learn about the lifecycle for selecting and implementing enterprise systems.",
                                                    "learning_resources":  "Enterprise systems such as ERP/CRM, textbooks, case studies, online resources",
                                                    "extra_time_commitment":  "This is a 9 units course. On average, a student is expected to spend 9 hours a week on this course, consisting of 3 hours in class and 6 hours of self-study."
                                            }
}