{
        "code":  "67-430",
        "name":  "AI and Emerging Economies",
        "short_name":  "AI EMERGING ECON",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In this course, we will explore the intersection of artificial intelligence AI with emerging economies. Our focus will extend beyond traditional AI research and development to address the unique challenges and opportunities faced by countries experiencing rapid economic growth. Through a combination of theoretical discussions, case studies, and practical projects, students will gain insights into how AI can drive positive change in diverse socioeconomic contexts.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By completing this course, you will achieve the followingAppreciation of the AI project triad Data, Domain Knowledge Tools Methods Understand the why aspects of AI and data as well as some tradeoffs in lowresource settings.Understanding the role of Digital Public Infrastructure How it can promote along with AI frugal innovation jugaad.Developing Country Impact Outlook Evaluate AIs unique impact on emerging economies, including its role in job creation, economic growth, and social development.Ability to incorporate Ethical Considerations Assess the ethical implications of AI in emerging economies, addressing privacy, bias, and transparency.Craft AI Solutions Form global teams and design simple AIbased solutions to address challenges faced by emerging economies e.g., healthcare, education, financial services overlapping with UN SDGs.Effective Communication via Global Teaming Brainstorm new ideas among global team members Advocate for responsible AI practices by effectively communicating the benefits and risks of AI to stakeholders.Develop critical and creative thinking Especially with respect to sociotechnical issues and problem solving using AI and frugal innovation jugaad.",
                                                    "key_topics":  "Innovative Initiatives: We delve into bold and imaginative initiatives that have the potential to transform societies. These initiatives may range from localized AI applications to large-scale infrastructure projects. By capturing the imagination of researchers and system builders, we aim to foster groundbreaking solutions.\nRaj Reddy\u0027s Vision: We revisit the visionary perspective laid out by Turing Award winner and Moza Bint Nasser University Professor at CMU, Dr. Raj Reddy, in his 1988 Presidential address to the Association for the Advancement of Artificial Intelligence. Dr. Reddy\u0027s insights serve as a guiding light as we assess progress over the past three decades.\nChallenge Goals: While some AI milestones, such as world-champion chess machines, were achieved swiftly, others¿like self-replicating systems¿demand sustained effort and breakthroughs. We critically evaluate the progress made and identify areas where further focus is needed.\nNew Decade, New Challenges: As we step into the current decade, we propose a fresh set of challenges. These challenges span three critical spheres:\nHealth: How can (Gen) AI improve healthcare access, diagnostics, and treatment outcomes in emerging economies?\nWealth: What role can AI play in economic development, job creation, and poverty alleviation?\nWisdom: How can AI enhance education, governance, and decision-making processes?\nThought Leadership: Drawing from insights shared by thought leader guest speakers, we will explore diverse viewpoints and stimulate informed discussions.\nStudent Engagement: Students actively participate in class discussions, critically evaluating progress and proposing their own challenge ideas. Emphasis is placed on solutions that address the unique needs and contexts of emerging economies.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Quiz: 15%\nClass Participation: 15%\nFinal Project (write-up, work products incl. interim deliverables): 70%",
                                                    "relevance":  "¿\tCritical Thinking and Problem-Solving: The course emphasizes critical and creative thinking, equipping you with novel problem-solving approaches.\n¿\tPractical Projects: You will work on practical projects that apply AI knowledge to real-world scenarios.\n¿\tGlobal Teamwork: The experience of working effectively in global, multi-campus teams (that span UGs and graduate students) will be a valuable takeaway.\n¿\tOpportunities and Challenges: By the course\u0027s end, you\u0027ll have a deep understanding of the opportunities and challenges posed by AI in emerging economies.\n¿\tSkills and Experience: You\u0027ll acquire the skills and practical experience necessary to navigate the AI landscape in a global context.",
                                                    "learning_resources":  "¿\thttps://ojs.aaai.org//index.php/aimagazine/article/view/950 (Raj Reddy\u0027s original article) and my update to it:\nhttps://www.andrew.cmu.edu/user/ganeshm/GrandChallengesAIMagazineSpring2021.pdf with commentary from six thought leaders incl. Francesca Rossi, AAAI President and Frank Chen of VC firm a16z. Many of the references in my article will also be used as background reading.\n¿\tOther references such as https://www.nature.com/articles/s41467-019-14108-y (AI and UN SDGs) and https://cacm.acm.org/magazines/2021/12/256930-digital-agriculture-for-small-scale-producers/fulltext\n¿\thttps://crfm.stanford.edu/open-fms/paper.pdf (On the Societal Impact of Open Foundation Models)\n¿\thttps://www.wired.com/story/clever-strategy-distribute-covid-aid-satellite-data/\n¿\tChatGPT and related resources, e.g., https://writings.stephenwolfram.com/2023/02/what-is-chatgpt-doing-and-why-does-it-work/\n¿\tWritings by guest lecturers (specific articles will be pointed out and assigned for weekly readings).\n¿\tJupyter notebook / Google Colab / Kaggle / Chatbots and LLM APIs (for the group, hands-on project)",
                                                    "extra_time_commitment":  "NA"
                                            }
}