{
        "code":  "69-001",
        "name":  "Fitness Instructor Training",
        "short_name":  "FITNS INSTRCT TRNG",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Fitness Instructor Training will prepare students with the knowledge, foundation and formula to lead a Group fitness class.  The essentials of Exercise Physiology and Kinesiology (movement), health-risk assessment, programming for cardio, strength and flexibility are all addressed throughout the course.  We will cover how to teach, cue and discuss the areas that you will need to know when teaching to a group.  You will learn the basic steps and then put these steps together into a song to create your first class.  You will be given the tools and resources needed to teach a safe workout that emphasizes core stability with dynamic movements.  The various styles of group fitness classes will be covered.  Students will lead a class taught to their peers for evaluation purposes.  Classes will be both lecture and workshop to combine academic foundations, training principles and hands on training.  Participation is required.  This class is designed to provide students with many of the skill sets and critical knowledge required to start helping individuals achieve their health-fitness and performance goals.  You will walk away with all you need to know and ready to lead a group fitness class.",
        "student_sets":  [

                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}