{
        "code":  "70-245",
        "name":  "Innovation \u0026 Entrepreneurial Mindset",
        "short_name":  "ENTREP MINDSET",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is designed to introduce students to the theory and frameworks used to develop and implement innovative solutions to societal and entrepreneurial problems.  The curriculum incorporates the latest on innovative behavioral traits and frameworks with a highly experiential format to expose undergraduate students to out of the box thinking.  For example, the instructor would use the lecture section of the class to explain the behavioral techniques that lead to innovative solutions based on the Innovators DNA by Clayton Christensen.  Teams of 36 students each would then examine a problem and be asked to generate 3 potential solutions and a proposed solution, using the techniques presented. Volunteers from the local Carnegie Mellon and entrepreneurial community will serve as mentors and judges, thereby providing a real world learning and networking experience.  Ultimately, the best solution will be selected, using a shark tank format.  While the selection of a winning solution will be fun for the class, the students will be graded on their having demonstrated the theory  techniques presented in class.  Each week will address a new and important topic related to the innovative  entrepreneurial mindset.  Weekly format will include one day of lecture and one day of application of the theory introduced in a fun and competitive format.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}