{
        "code":  "70-238",
        "name":  "Topics in Chinese Culture: Merchants, Scholars, Artists in Imperial Times",
        "short_name":  "TPCS IN CHNS CLTR",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course explores various aspects of Chinese civilization, focusing on three key figures scholars, artists, and merchants. Representing distinct societal strata and perspectives, these figures provide multifaceted insights into the cultural, social, and economic dynamics that have shaped China through the ages. We aim to uncover the life stories and legacies of pivotal figures, scrutinizing how they navigated and influenced the intertwining realms of aesthetics, politics, philosophy, and economics. We will explore critical questions such as How did scholarly ideas shape perceptions of art and commerce In what ways did aesthetic values influence popular culture and markets How did economic shifts and the advent of consumer society impact the education system and the evolving identity of scholars Additionally, we will examine how global trade dynamics catalyzed transformations in political and philosophical thought, ushering China into the modern era. With an interdisciplinary approach, this course covers a wide array of topics, including political institutions, religion and philosophy, gender and kinship, commerce and economy, art and literature, and material culture. Engaging with the stories of ambition, creativity, and resilience, students will gain a nuanced perspective of Chinas past, an appreciation of its cultural depth, and insights into its role in the contemporary world.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}