{
        "code":  "70-244",
        "name":  "Contract Law and Strategy for Entrepreneurs",
        "short_name":  "CONTRACT LAW \u0026 STRAT",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course explores the legal principles underlying contracts and their strategic implications in business settings. Through case studies, discussions, and practical exercises, students will develop a deep understanding of contract law and its application to realworld business scenarios. Emphasis will be placed on negotiating, drafting, and managing contracts, to further master key legal concepts and their strategic application in related areas of intellectual property, corporate governance, transactions, and risk management. Examining the importance of contracts and other legal issues facing entrepreneurs is critical to anticipating challenges that may arise as a company grows.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Gain an understanding of how contracts are used to allocate and mitigate risk.Familiarity with contracts and how they relate to intellectual property, purchase agreements, employment agreements, and corporate governance.Understanding of the importance of norms, bargaining power, and leverage when it comes to negotiating.Identifying the critical parts of a contract that should be addressed in a negotiation.Familiarity with pitfalls of signing legal documents without thorough review.",
                                                    "key_topics":  "Contract Basics\nEmployment Agreements\nComplex Contracts\nIntellectual Property\nGovernance/Securities",
                                                    "prerequisite_knowledge":  "No prior legal training is assumed, but the professor will assume that students have a basic understanding of core business concepts. Students from outside of the BA program are encouraged to join the class but they may benefit from some self-study to fill in gaps in their business knowledge as the course progresses.",
                                                    "assessment_structure":  "The final grade will be based on 33% class participation, 33% ongoing assignments and homework and 33% on a final exam or project.",
                                                    "relevance":  "Entrepreneurs frequently are required to make decisions and enter into contracts that have lasting impact due. This course should give a student some background and knowledge that will aid in spotting issues that may have an impact on strategic business decisions. Similarly, it should help position an entrepreneur to understand the various aspects of a contract that are critical to address in a negotiation.",
                                                    "learning_resources":  "Selected readings will be provided to support student learning.\nWorking With Contracts, What Law School Doesn\u0027t Teach You, Charles M. Fox, Practicing Law Institute\nConcepts and Case Analysis in the Law of Contracts, Marvin A. Chirelstein\nThe Entrepreneur\u0027s Guide to Business Law, Constance E. Bagley and Craig E. Dauchy",
                                                    "extra_time_commitment":  "Reading and digesting material prior to class to be prepared for class discussion and participation"
                                            }
}