{
        "code":  "70-201",
        "name":  "Professional and Service Projects",
        "short_name":  "PROFSSNL \u0026 SRVC PROJ",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Professional service is important in career development because it creates opportunities to use skills and knowledge, develop leadership abilities, develop professional networks, and to learn the importance of community involvement and social values in business practice.  Students complete a variety of activities with these objectives over a period of up to four semesters to satisfy this course requirement.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "After completing the course, students will be able to Learn the importance of service in professional life Learn to use ones professional skills and knowledge in practice Recognize the importance of community involvement and social responsibility and develop awareness of critical issues and their connections to the achievement of personal and organizational goals",
                                                    "key_topics":  "Leadership, Professional Development, Community Service",
                                                    "prerequisite_knowledge":  "Since this is a service project course focused on analyzing an issue/opportunity within an organization, having strong problem solving, mathematical skills along with polished writing and presentation skills would be appropriate.",
                                                    "assessment_structure":  "Class participation, short assignments, mentoring program, group project and final presentation.",
                                                    "relevance":  "The course is for undergraduate business seniors. It reflects upon the skills learnt throughout the undergraduate experience.",
                                                    "learning_resources":  "We will use readings, cases, videos, short topic memos via Canvas.",
                                                    "extra_time_commitment":  "There will be a few meetings with assigned mentees outside regular class time."
                                            }
}