{
        "code":  "70-258",
        "name":  "Developing Blockchain Use Case",
        "short_name":  "DEV BLOCKCHAIN CASE",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Blockchains, or distributed ledger and consensus technologies, hold tremendous promise for improving markets and organically handling private, secure data. As CMU develops its own blockchain and tokenCMU Coina central concern is to determine the set of applications that such technology would be most useful for. This course is designed for students to propose and, potentially, develop applications or use cases for a campus blockchain. httptinyurl.comcmucoincourse The course begins with a brief introduction to blockchain using Bitcoin as an example of a blockchain protocol. We will examine the market failure Bitcoin was intended to resolve as well as the role of cryptography and distributed systems in enabling this new technology to create societal value. The course will go on to discuss the boundaries of the role of cryptography in blockchain. Next, we will use these tools to evaluate existing, realworld blockchain use cases with an eye towards developing our own applications of these emerging technologies. Along the way, we will learn practical development skills in distributed ledger technologies to understand blockchain programming and application development. Finally, students will propose their own blockchain use cases for CMUs own proprietary blockchain. No formal prerequisites, but familiarity with programming is highly recommended.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of this course, students will be able to Describe the intrinsic value of leading cryptocurrencies, Bitcoin and Ethereum Explain the role cryptography plays in securing blockchainbased cryptocurrencies Understand and program a smart contract on the Ethereum test network Build a Decentralized Application running on a decentralized peertopeer network Understand risks to the usefulness of different blockchains and propose and evaluate use cases for a new blockchain andor cryptocurrency",
                                                    "key_topics":  "Blockchain; Smart Contracts; Secure Data; Cryptography",
                                                    "prerequisite_knowledge":  "No formal prerequisites, but familiarity with programming is highly recommended.",
                                                    "assessment_structure":  "Course project (50%); Assignments and Lab work (40%); Participation (10%)",
                                                    "relevance":  "This course is for students interested in blockchain and cryptocurrency, and having hands on experience building blockchain based solutions to real world problems -- including what the future of CMU-Coin should be.",
                                                    "learning_resources":  "Weekly office hours, lecture slides, lecture notes, and texts/articles (made available on the course webpage).",
                                                    "extra_time_commitment":  null
                                            }
}