{
        "code":  "70-387",
        "name":  "Strategy for High-Tech Products and Services",
        "short_name":  "STRAT HIGH-TECH PROD",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will focus on the strategies of technologybased products and services. We will examine how technology productsservices differ from nontechnologybased products and how the unique attributes of hightechnology productsservices influence the marketing strategies and tactics of those products. We will cover issues such pricing of technology productsservices including versioning, bundling and dynamic pricing the impact of network effects within product markets competition in technologyfocused product arenas the design, launch and governance of platform markets. Examples of technologyintensive industries that we will discuss are computer hardware and software, media and entertainment, telecommunications, ecommerce, and the sharing economy. Students explore the unique economic circumstances facing firms in these industries and identify strategies that enable firms to succeed given these circumstances. This course is ideal for students who want to pursue a career as a product manager for a technology company.  This course helps students understand the unique economic characteristics seen in todays technologyintensive markets and how they impact the strategic interactions among firms and consumers.  In order for students to understand how firms strategically interact in technologyintensive industries this course will use a combination of simple but rigorous analytical models, emerging theories, and formal case studies.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The purpose of the course is to provide you with several general frameworks that you can then use to analyze any hightechnology industry.\nIt is not the express purpose of this class to update you on the latest developments in specific technological areas, though efforts will be made to keep the examples as relevant as possible.\nFrameworks, theories, and models provide you with tools you can continue to use as technology develops and changes over your career.",
                                                    "key_topics":  "Pricing in Technology Markets, Platform Business models",
                                                    "prerequisite_knowledge":  "Knowledge of microeconomics",
                                                    "assessment_structure":  "Midterm plus final project",
                                                    "relevance":  null,
                                                    "learning_resources":  "Cases, notes, required book",
                                                    "extra_time_commitment":  null
                                            }
}