{
        "code":  "70-366",
        "name":  "Intellectual Property and E-Commerce",
        "short_name":  "INTEL PROPRTY \u0026 ECOM",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  "(76-102 [] at least D) or (76-101 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The course is intended to instruct students on the creation of the Internet and the World Wide Web, including the creation of the Domain Naming System. The course will provide an understanding of how the Web operates from its creation to the present, how the laws of various countries interact with the Web how issues of privacy are addressed and the role of private parties and government in monitoring privacy. The course will examine how intellectual property is created and protected who owns the property and the role of ownership of the intellectual property interacts with antitrust laws. The course examines how contracts are formed and administered on the Web by entities created to minimize taxes and personal liability risks for the ownersshareholders of those entities. This course may use thirdparty course material that is not available for individual purchase from the publisher.   If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided.   The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "After taking this course, a student will be able to make informed decisions on how to manipulate the web.",
                                                    "key_topics":  "Creation of the web, doing business on the web, contracting on web, intellectual property, domain name systems and challenges.",
                                                    "prerequisite_knowledge":  "Students interested in the course should be those who wish to understand how the World Wide Web works, how to obtain and protect intellectual property and how every day matters such as contracts are transformed from \"bricks and mortar\" world to the Web",
                                                    "assessment_structure":  "there will be two quizzes and a final, plus extra credit book report.",
                                                    "relevance":  "No one escapes the web. This course explains creation, maintenance and challenges of the web.",
                                                    "learning_resources":  "A casebook is created for the course.",
                                                    "extra_time_commitment":  "Prep for course meeting"
                                            }
}