{
        "code":  "70-302",
        "name":  "Restaurant Builder",
        "short_name":  "RESTAURANT BUILDER",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Create your own oncampus restaurant.  Restaurant Builder is the experiential learning platform where our class will buildout a new studentrun restaurant concept on campus.  This course takes our class through the entire process of starting a restaurant business.  We focus on the conceptdevelopment, financials, human resource processes, menudevelopment, operational efficiencies and supply chain elements of this massive 1.1 trillion industry in the United States.  Throughout the class, students will meet with both successful restaurant entrepreneurs as well as architectural and design professionals, as they apply lessons already learned in their scholastic background, while also learning key fundamentals of entrepreneurship in the hospitality industry.At the end of this class, we will be entering our newlycreated restaurant into the Carnegie Mellon Dining program, as a new studentled business.Application Required for course, please email ubaandrew.cmu.edu for application link",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Build financial Pro Formas for starting and operating a businessLearn about regulatory policy surrounding the restaurant startup businessGain experience in operating a business in a leased space ensuring the cooperation with other building stakeholdersDevelop supply chain skills through building and utilizing order guides and par sheetsUtilize their brand management skills through development of logos and menusDevelop full ProfitLoss statements on a weekly, monthly and semesterly cadence",
                                                    "key_topics":  "We focus on the: concept-development, financials, human resource processes, menu-development, operational efficiencies and supply chain elements of the restaurant industry. We also discuss the impact of real estate in the restaurant industry.",
                                                    "prerequisite_knowledge":  "A keen interest in learning about the hospitality industry, and an entrepreneurial mindset.",
                                                    "assessment_structure":  "Students will have weekly case studies as a part of their overall journal responsibilities (30%)\nThe final project and presentation of their Restaurant Builder concept with their team will consist of a full written and oral/audiovisual presentation of their brand (40%)\nExperiential working in the Capital Grains restaurant with a written paper on lessons learned throughout the semester (20%)\nClass participation (10%)",
                                                    "relevance":  "Experiential learning is a key element in the development of our students. Our students are currently learning from world-renowned professors at the Tepper School, as well as other colleges within the university. Restaurant Builder is designed to take these scholastic lessons, and apply them in a real-world scenario on campus. This incredible resume builder for our students will be a testing ground for their future entrepreneurial advancements.",
                                                    "learning_resources":  "Weekly journal case studies\n100 Yards of Success book",
                                                    "extra_time_commitment":  "Saturday and or Sunday hours working in the current Capital Grains restaurant (minimum 4 hours per week)"
                                            }
}