{
        "code":  "70-333",
        "name":  "Communication Design for Business",
        "short_name":  "COMM DESIGN FOR BUS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Communication design is the practice of conveying information visually through graphic elements such as typography, images, and layout. This course explores foundational principles of communication design essential for effective business communication. Through handson projects and industrystandard software like Figma, students learn to create visually impactful materials for various business contexts. Topics include understanding the psychology and use of color, studying fonts and their typographic arrangement, curating visual elements for balance and impact, utilizing negative space, and using icons, symbols, and visual storytelling for effective communication. Students will develop a strong visual literacy and personal identity, enabling them to convey complex ideas and enhance understanding in business communications, giving them a competitive edge in the professional world.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "This creative, handson course combines lectures, workshops, case studies, and projects to immerse students in the world of business visual communication. By the end of the course, students will achieve the following goals Apply Fundamental Principles Demonstrate understanding and application of fundamental principles of visual design in business contexts. Contextual Research and Innovation Conduct contextual research and draw inspiration from diverse sources to generate innovative design ideas. Audience Consideration Consider the delivery and impact of visual communication on different business audiences. Effective Communication Communicate effectively using designled techniques in various project types. Proficient Tool Use Utilize industrystandard software like Figma to design and produce visual content efficiently and professionally. Participation and Collaboration Actively participate in design project development methods and embrace design studio culture.",
                                                    "key_topics":  "- Visual Design Principles: Explore color theory, typography, and composition.\n- Visual Communication Tools: Master industry-standard software like Figma for visual design features (no interaction design).\n- Data Visualization: Present data visually using charts, graphs, and infographics.\n- Visual Identity: Understand branding and develop your own visual style.\n- Visual Storytelling: Learn to convey messages effectively through visuals.\n- Ethical Visual Communication: Discuss representation and transparency.\n- Collaborative Design: Work effectively in small design teams.\n- Design Review: Give and receive feedback, and discuss design work with others.",
                                                    "prerequisite_knowledge":  "None. This course is open to individuals from diverse backgrounds and does not require prior design knowledge or experience. A basic understanding of business concepts and proficiency in using digital tools and software applications like Google and Microsoft would be beneficial.",
                                                    "assessment_structure":  "Grades from team and individual projects are aggregated, factoring in their respective percentage weightings, to establish an overall grade for the course.\n\n- Team projects [20%]\n- Individual projects [40%]\n- Figma quizzes [10%]\n- Classroom participation [23%]\n- Class attendance [7%]",
                                                    "relevance":  "The power of visuals to make a lasting impression and shape communication perception is often overlooked, presenting a missed opportunity for competitive advantage. This course emphasizes the pivotal role of visual impact in communication, highlighting its ability to engage people in an information-overloaded environment. Proficiency in visual communication is a valuable skill that can significantly enhance one\u0027s ability to present information effectively in academic and professional settings. By developing this skill, students can foster stronger connections internally and externally, facilitate a greater understanding of key concepts, and increase success in projects and careers. By the end of this course, students will have designed their own set of business communications ready to share with their network.",
                                                    "learning_resources":  "Learning resources for this course will comprise an inspirational collection of design-related videos, podcasts, websites, and articles. Readings will be scanned and made available to all enrolled students by the start of the semester.",
                                                    "extra_time_commitment":  null
                                            }
}