{
        "code":  "70-378",
        "name":  "Business of Healthcare",
        "short_name":  "BUSINESS OF HEALTHCA",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "U.S. healthcare industry promises numerous opportunities for significant improvements. This course uses the lens of business and economics to bring some clarity to the way we think about healthcare and its impact on our nations wellbeing. We describe the major actors and institutions within the US healthcare system, and the key strategic, managerial, and financial issues facing industry executives and public policymakers. We start with an initial big picture of the healthcare system and lay out some of the principles by which it operates. We introduce a host of players and policy issues. The players are the various healthcare sectors e.g., provider organizations, medical professions, technology suppliers the policy issues concern the nagging problems of quality improvement, cost control, improving access, and reducing inequity. The course also covers some of the major intermediaries that connect these segments insurance companies, pharmacy benefit managers PBMs, and wholesalers. Finally, we examine the producers of the innovative products in the healthcare industry  pharmaceutical, biotechnology, and medtech sectors on a global basis.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Foster awareness and a breadth of knowledge about an important sector of the U.S. economy Understand the issues in healthcare system design and operation Apply business principles to address the nations health system challenges Introduce students to people and resources in the healthcare industry",
                                                    "key_topics":  "Payers (Medicare/Medicaid), providers (hospitals, healthcare workforce), and producers of innovative healthcare products; financing and delivery of healthcare; management and performance of healthcare systems.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Homeworks, case studies, midterm, final project",
                                                    "relevance":  "Health professions, public health, pharmaceutical, biotechnology, healthcare IT",
                                                    "learning_resources":  "Textbook, Cases, Readings, Lecture Notes",
                                                    "extra_time_commitment":  null
                                            }
}