{
        "code":  "70-377",
        "name":  "Managing and Assessing Tech Talent and Organizations",
        "short_name":  "MAN TECH TALENT",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In todays technologydriven economy, businesses across industries rely on effective technical teams to drive innovation and success. This course is designed for both technical students preparing for roles in software development, data science, and engineering, as well as business students who will manage, assess, and collaborate with technical teams. Students will learn best practices for hiring and evaluating technical talent, leading software teams, and implementing strategies for effective performance management.The course covers key aspects of technical hiring, including whiteboard coding interviews, system design interviews, and data science assessmentsboth from the perspective of applicants and hiring managers. Additionally, students will explore agile project management, objectives and key results OKRs, technical performance reviews, and strategies for improving team effectiveness. By bridging the gap between technical expertise and managerial leadership, this course equips students with the skills needed to successfully lead and assess software teams in dynamic business environments.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Assess and Manage Technical Talent Develop skills to evaluate technical candidates through interviews, performance assessments, and team management strategies.Bridge Technical and Business Leadership Learn how to effectively hire, lead, and assess software teams using industry best practices in agile management, OKRs, and performance evaluation.Prepare for Leadership Roles in TechnologyDriven Organizations Gain practical knowledge to succeed in roles that involve managing, collaborating with, or working within technical teams.",
                                                    "key_topics":  "Interviewing Approaches and Strategies for Software Development Roles\n•\tInterviewing Approaches and Strategies for Data and Quantitative Roles\n•\tCase Interviews and Behavioral Interviews\n•\tOnboarding Technical Talent\n•\tRunning Technical Projects\n•\tManaging Performance, Promotion, and Termination",
                                                    "prerequisite_knowledge":  "There are no required prerequisites for this course, and it is open to all students, regardless of technical background. While no prior experience in software development is necessary, familiarity with software development concepts or an interest in technology firms will enhance the learning experience. The course is designed to be accessible to both technical and business students, providing foundational knowledge and practical strategies for managing and assessing technical teams.",
                                                    "assessment_structure":  "Mock Interviews and Reflections (50%) - Students will conduct and participate in multiple technical interviews, gaining experience from both the interviewer and interviewee perspectives. Each interview will be accompanied by a brief reflection analyzing key takeaways.\n•\tNew Hire Onboarding Packet (10%) - Students will create a concise welcome packet to support the onboarding of a new technical hire, applying best practices in team integration.\n•\tGroup Case Analyses (40%) - Students will collaborate on case studies that explore real-world challenges in managing and evaluating technical teams, applying course concepts to practical scenarios.",
                                                    "relevance":  "As technology continues to shape industries across the global economy, the ability to manage and assess technical teams has become a critical skill for both technical professionals and business leaders. This course is designed for students who aspire to work in or alongside technology-driven organizations, whether as software developers, data scientists, product managers, or business leaders responsible for hiring, evaluating, and leading technical talent.\n\nBy exploring best practices in technical hiring, team leadership, and performance management, students will gain a comprehensive understanding of how to build and sustain high-performing software teams. The course equips students with essential skills such as conducting technical interviews, implementing agile project management techniques, setting and evaluating objectives and key results (OKRs), and managing technical performance.\n\nThis interdisciplinary approach makes the course highly relevant to business students seeking leadership roles in technology firms, as well as technical students preparing for careers in software development, data science, or engineering management.",
                                                    "learning_resources":  "Instructor Materials - Lecture slides, discussion prompts, and supplementary readings to reinforce key concepts.\n•\tCase Studies - Real-world scenarios that illustrate challenges in hiring, onboarding, and managing technical talent.\n•\tManagement and Leadership Frameworks - Materials on agile development, objectives and key results (OKRs), and best practices for evaluating and improving technical team performance.\n•\tTechnical Hiring and Assessment Guides - Readings from widely used books and online resources covering coding interviews, system design interviews, and data science assessments.",
                                                    "extra_time_commitment":  null
                                            }
}