{
        "code":  "70-350",
        "name":  "Acting for Business",
        "short_name":  "ACTING FOR BUSINESS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Perception may or may not be Reality. But Perception is, in fact, what Influences people. This experiential communications course focuses on how you as a Leader can choose to more effectively express yourself  influence others using practical, handson tools from Acting in professional, live Theatre.  You will choose to effectively Influence your Listeners perception of you through the use of  Action Assertiveness, Confidence  Expressiveness ACE the Visual, Aural  Temporal Communication Tools and the incorporation of The Seven Steps Of Effective Influence or core competencies. This course may use thirdparty course material that is not available for individual purchase from the publisher.   If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided.   The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "To assertively Influence others through knowledgeable use of Actions toward a Goal to grab and hold audience attention interest to project greater SelfConfidence manage tension or stage fright to better shape your relationship with your Listeners to aspire to an empathetic assertive SpeakertoListener mindset to begin to master outer communication tools, such as eye contact, body language, movement stillness, gesture, key words, inflection, vocally commanding a room, dynamic diversity.",
                                                    "key_topics":  "Practical skills from live, stage acting that are applicable to public speaking and business communications.",
                                                    "prerequisite_knowledge":  "This is an introductory course on this subject. Bring to it your life experience \u0026 your interest in being a better communicator. Leave behind any prejudices you may have about acting.",
                                                    "assessment_structure":  "Participants will complete thirteen assignments -- two written, \u0026 eleven performed in class, and participate in in-class discussions. Participants are given spoken \u0026 written feedback on each assignment, including: Describing Your Best Possible Self (written); Influencing Through A Shouted Action; Playing Three Actions with Three Versions of The Same Sentence; The Empathetic Observation; Two Structured Improvisations or Three-Action Exercises; The Map Of Actions (written); The Duet Scene: First, Intermediate \u0026 Final Performances; The Monologue: First, Intermediate \u0026 Final Performances. There is no final exam in exam week. Students will be graded based on competency in: 1-attendance \u0026 punctuality; 2-active participation in in-class discussions; 3-full preparedness for each assignment, including outside rehearsals \u0026 memorization as needed;4-full compliance with instructions \u0026 completion of all assignments; \u0026 5-mastery of \"The Seven Steps Of Effective Influence\" (or core competencies).",
                                                    "relevance":  "The course will not improve your PowerPoint - but will improve the communicator standing in front of your PowerPoint. It challenges participants to \"get out of themselves\", to expand their comfort zones when communicating in public, to choose to take risks \u0026 to think more flexibly - all toward becoming more assertive, confident \u0026 expressive leaders. The course has been referred to as: \"Cross Training For Business People\"; \"Ethical Acting\"; \"teaching an important life skill\"; \u0026 even \"Charisma 101\".",
                                                    "learning_resources":  "An extensive course package provided on Canvas, including: Acting For Business: Overview, Backstory \u0026 Index; The Syllabus; Instructions for All Assignments; What We Do \u0026 Why; The Seven Steps Of Effective Influence; The Communication Tools; The Duet Scenes; The Monologues; \u0026 An Acting Toolbox Full Of Tools.",
                                                    "extra_time_commitment":  "Outside rehearsals in assignments with partners or alone, \u0026 memorization as needed."
                                            }
}