{
        "code":  "70-349",
        "name":  "Color Reproduction \u0026 Management",
        "short_name":  "COLOR REPRO MGMT",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Today, we are bombarded by color media in many forms. In the competitive advertising world, the accurate reproduction of color in various media is both a challenge and a necessity. This course examines topics related to the use of color and its reproduction in a variety of media, including photography, print, television, cinema, the Internet. Of prime importance are issues related to the successful specification, transfer, measurement, and application of color to maximize communication efficiency. Students will study the physical nature of light and properties of color, as will the perceptual and psychological aspects of color. The separation of color and the control parameters for optimum color realism will be examined. Modern methods for managing color files to achieve consistent color appearance through different media will be an important focus of the course.  The course contains a laboratory component consisting of a series of indepth exercises in Adobe PhotoShop giving students an opportunity to apply color correction and image manipulation techniques, and to become more adept at using this important software tool. Although this course is open to undergraduates of all class years, it is aimed at 3rd and 4th year students.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}