{
        "code":  "70-389",
        "name":  "Design Thinking with AI",
        "short_name":  "DESIGN THINKING",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Design thinking is a powerful process for tackling complex challenges through creativity, empathy, and collaboration. Learn how to apply AI technologies like natural language processing NLP, large language models LLMs, big data and generative design to enhance creativity and create humancentered solutions. This course introduces design thinking principles, methods, and tools and explores essential techniques and frameworksfrom problem framing and creative ideation to prototyping and user testing. We will fuse AI tools with design thinking methods to engage with the UN Sustainable Development Goals to bring positive changes to people and the planet and shape a more prosperous future for all.This course may use thirdparty course material that is not available for individual purchase from the publisher. If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided. The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of this course, students will be able to Master the Design Thinking process Gain a comprehensive understanding of the steps and principles involved in Design Thinking. Foster creativity and innovation Develop the skills and mindset to think creatively and generate innovative ideas. Embrace a usercentered approach Cultivate empathy and learn techniques to understand user needs and preferences. Enhance collaboration and teamwork Improve the ability to work effectively in teams and leverage diverse perspectives. Apply Design Thinking to business challenges Use Design Thinking methods to solve realworld problems in a business context.",
                                                    "key_topics":  "1) Design Thinking Introduction: Overview of the design thinking process, emphasizing empathy and creativity.\n2) Human and AI collaboration: Integrate design thinking with AI to enhance problem-solving workflows and decision-making.\n3) Design Thinking in Business: Using design thinking as a strategy to drive innovation.\n4) Human-Centered Problem Solving: Conducting user research, understanding user needs, and developing products and services for specific audiences.\n5) UN Sustainable Development Goals: Explore a values-led framework for sustainable innovation.",
                                                    "prerequisite_knowledge":  "This course is open to individuals from diverse backgrounds and does not require prior Design Thinking knowledge or experience. All that is needed is a curious mind and a willingness to embrace new ways of problem-solving.",
                                                    "assessment_structure":  "This Design thinking course will incorporate project-based learning to provide students with hands-on experience in applying design thinking principles to real-world challenges. The projects are designed to foster critical thinking, problem-solving, collaboration, and creativity.\n\nThere are two assessed projects in this course. Grades from both are aggregated, factoring in their respective percentage weightings, to establish an overall grade for the course.\n\nProject 1 - Design Thinking: A Creative Process for Tackling Complex Problems\nStudents work in teams using Design Thinking to tackle a social or environmental problem. They conduct design research to understand the needs of the target community, ideate innovative solutions, develop prototypes, and test ideas with the end-users or peers. The result is a creative and inspiring project to create positive social and/or ecological impacts. Final projects are presented in class at the end of the course, with Q\u0026A from faculty and peers.\n\nProject 2 - Design Thinking Journal: A Journey of Insights\nStudents develop a reflective journal in Figma to document their learning journey, ongoing critical reflections, and insights as they emerge through the course. All journals will be shared at the end of the course with faculty and student peers.",
                                                    "relevance":  "Design turns existing situations into preferred ones. Design thinking, therefore, accelerates this change-making process through a repertoire of creative tools, innovative methods, and designerly tactics. Leverage AI technology to create innovative, user-centered solutions. This course equips students with practical problem-solving skills, vital for addressing complex business and global challenges, driving organizational change, and creating lasting value.",
                                                    "learning_resources":  "Learning resources for this course will comprise an inspirational collection of design-related videos, podcasts, websites, and articles. Readings will be scanned and made available to all enrolled students by the start of the Spring semester.",
                                                    "extra_time_commitment":  "Students are expected to conduct approximately 4-hours of study outside of scheduled class times each week."
                                            }
}