{
        "code":  "70-376",
        "name":  "Energy Systems",
        "short_name":  "ENERGY SYSTEMS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will provide students with an understanding of the systems and markets that provide energy to businesses and consumers. Students will be introduced to the sources and uses of energy, and how they have evolved and the possible paths over which they may evolve in the next decades. The course places an emphasis on electric energy, the single largest energy source in many industrial economies, but also covers natural gas, oil, and selected other primary energy sources. Students will learn the energy flows in the USA and the world, as well as the businessrelevant characteristics of the engineered systems that provide the energy in various forms. Both traditional and emerging energy sources will be discussed, and students will understand the difference between an energy carrier and an energy source. We will also discuss some of the issues that arise without  proper management of the physical risks of energy systems. Students will learn some of the history of electric power regulation and the inconsistent subsidy structures that have provided opportunities and challenges for energy companies and investors, including discussion of how emissions restrictions affect fuel, engineering, investment, and project finance  choices. The history of electric power markets will be discussed, with an eye to examining the opportunities that market changes create for business.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}