{
        "code":  "70-449",
        "name":  "Social, Economic and Information Networks",
        "short_name":  "SOCL ECON INF NETWKS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "((36-200 [] at least D) or (73-230 [] at least C) or (36-201 [] at least D)) and ((36-201 [] at least D) or (70-207 [] at least D) or (36-207 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Interaction is a fundamental part of social science firms market products to consumers, people share opinions and information with their friends, workers collaborate on projects, agents form alliances and coalitions. In this course, we will use the emerging field of social networks to put structure on this diverse mass of connections. Using a mixture of theoretical, empirical, and computational methods, we will learn about the structure and function of social networks. We will look at how an individuals position in a social network reflects her role in the community. We will learn to identify tastemakers and trendsetters by looking at how information moves through our increasingly connected society. We will consider how our own position in the social network affects our behavior, opinions, and outcomes. And we will explore where social networks come from, and what affects their structure. The material in this course will be interdisciplinary, drawn from the fields of math, computer science, physics, sociology, political science, and economics. By the end of the course, you will have the tools and knowledge needed to analyze social networks on your own. The course is capped with a project where you will use your skills to answer your own questions. This course may use thirdparty course material that is not available for individual purchase from the publisher.   If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided.   The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}