{
        "code":  "70-417",
        "name":  "Topics in Entrepreneurship",
        "short_name":  "TPCS IN ENTREPRNRSHP",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course covers Design Thinking, Artificial Intelligence AI, and Entrepreneurship. This course covers the emergence of 5 new bodies of knowledge that will be increasingly important to society and to new job creation. These bodies of knowledge concern Design Thinking, Artificial Intelligence AI, Collective Intelligence, Secrets of Highly Successful Teams, and Entrepreneurship.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will better understand emerging business opportunities as well as be able to make better political assessments and choices.",
                                                    "key_topics":  "The course covers entrepreneurship, collective intelligence, the secrets of highly successful teams, artificial intelligence, and design thinking.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Students take quizzes after every lecture. There are also a midterm exam and a final exam. They are also expected to participate in classroom discussions. It\u0027s up to faculty discretion to decide the level of classroom participation.",
                                                    "relevance":  "This course is appropriate for anyone interested in understanding how to organize and manage business development or national economies.",
                                                    "learning_resources":  "the professor has articles which he assigns as reading assignments for the students. The list of articles is long and is constantly being updated to accommodate late-breaking news.",
                                                    "extra_time_commitment":  "None. Students are expected to spend a few hours between classes on the reading assignments but nothing more than the average."
                                            }
}