{
        "code":  "70-423",
        "name":  "Technology-Based Entrepreneurship",
        "short_name":  "TECH-BASED ENTREPSHP",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is offered only at Carnegie Mellons campus in Qatar.  This course is designed as an introduction to entrepreneurship and basic business concepts for engineering and science students. There are no prerequisites. Students learn basic business concepts, business models, entrepreneurial thinking, idea generation, opportunity recognition, and the basics of accounting, marketing and strategy development. There is no final examination. Instead, students, working in teams, generate an original idea for a startup business and prepare a business plan and an investor presentation, which sets forth the basic strategies, business models and evaluates the opportunity afforded by their original idea. This course also is consistent with the broad mission of Carnegie Mellon University in Qatars entrepreneurship program, which is described below. The broad mission of the entrepreneurship program at Carnegie Mellon University in Qatar is threepronged a.To encourage and develop entrepreneurial and innovative thinking in a business setting, whether or not it is a startup company b.To obtain the basic skills to start a new venture c.To stimulate selfevaluation for life direction.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}