{
        "code":  "70-477",
        "name":  "Real Options: Creating Value Beyond NPV",
        "short_name":  "REAL OPTIONS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [
                                        {
                                                "code":  "70-371",
                                                "id":  6482,
                                                "name":  "Operations Management",
                                                "units":  9.0
                                        }
                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Real options analysis is an approach to the management of operational assets that exploits managerial flexibility in decisionmaking and combines it with marketdriven valuation of cash flows. It is thus particularly useful when managing projects that involve dynamic and statecontingent choices among alternatives options, especially of a strategic nature. The valuation of financial options is the conceptual basis of real options management but this course does not assume prior knowledge of this topic. Real options analysis extends this fundamental marketdriven valuation approach to a much broader spectrum of business applications that feature dynamic decisionmaking. It thus contrasts the standard net present value rule used by static discounted cash flow analysis. The resulting managerial decisions and asset valuations can be very different when real options analysis is used rather than static discounted cash flow analysis. The course learning objectives are to i develop the students ability to take an unstructured problem and implement real options analysis in a structured manner ii integrate marketdriven valuation and dynamic decisionmaking techniques into a practical, yet rigorous, business analytics toolkit and iii provide examples of successful practice and applications in a variety of industries. This course may use thirdparty course material that is not available for individual purchase from the publisher.   If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided.   The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}