{
        "code":  "70-468",
        "name":  "Advanced AI and Business Strategy",
        "short_name":  "ADV AI \u0026 BUS STRAT",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course explores the dynamic intersection of leadingedge Artificial Intelligence AI technologies and business strategy, equipping students with the knowledge and skills to harness the transformative potential of advanced AI for organizational success. In an era characterized by datadriven decisionmaking, AIdriven innovation, and evolving market landscapes, businesses need strategic leaders who can navigate the complexities of AI adoption effectively.This course is designed for students with a background in technology, business, policy, management, or related fields who aspire to become strategic leaders in organizations leveraging AI. We will combine lectures, case studies, group discussions, handson labs and projects, and industry guest speakers to provide with a holistic understanding of AIs role in shaping business strategy. If students are interested in a career as data scientists or data analysts, this class will help students understand how these data roles impact a companys business or policies. If students are interested in more managerial or business roles, this class will provide them with a foundation to understand data and analytics processes so that they may interface with these roles in their organizations.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1. Understand AI fundamentals. Develop a comprehensive understanding of the core concepts, methods and limits underpinning the most recent advanced AI technologies, including deep learning, natural language processing, spatialtemporal data mining, image video mining, LLMs and generative AI.2. Analyze AI contexts. Analyze the contexts surrounding the use of advanced AI technologies. Describe the challenges of implementing advanced AI and business analytics in realworld organizations.3. Evaluate AI applications. Analyze realworld case studies and applications of AI in different industries to assess how AI can drive innovation and create value in various business contexts.4. Implement and present AI insights. Learn to implement some of the advanced AI tools to solve realworld problems, and to communicate AI insights to executives.5. Ethical and regulatory considerations. Examine the ethical implications of AI in business, and explore how to navigate legal and regulatory challenges associated with AI deployment.",
                                                    "key_topics":  "This course draws upon the most recent development of AI technologies, and discuss the corresponding strategic applications and impacts for today\u0027s business and policy decision making. Some of the technologies that will be covered in the course include:\n\n• Deep Learning\n• Image \u0026 Video Mining\n• Temporal-Spatial Data Mining\n• Big Data Analytics\n• Natural Language Processing\n• Generative AI and Foundation Models\n• Ethics and Responsible AI\n\nThe projects in this course will provide students with an opportunity to work on real world problems with real world data. This will be more unstructured than many of the projects students are accustomed to, but will provide experience with the challenges of realistic data problems.\n\nThis course uses a combination of lectures on case studies and readings, lectures on advanced AI techniques and industry guest speakers.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Final grade will be based on a combination of homework assignments (30%), class participation (20%, pre-class case survey, class discussion, attendance, etc.), in-class Quiz (20%), and final project (30%).",
                                                    "relevance":  null,
                                                    "learning_resources":  "1) Course Readings. Free course readings (those not protected by copyright and that can be shared by the professor) will be shared via Canvas prior to each class.\n\n2) Business Cases. A number of the sessions in this course require students to prepare by reading business cases. These cases can be downloaded directly from the Harvard Business Press website.",
                                                    "extra_time_commitment":  "2-5 Hours per Week"
                                            }
}