{
        "code":  "70-458",
        "name":  "Advanced Data Management",
        "short_name":  "ADV DATA MGMT",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "70-455 [] at least D"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Theres a lot of data out in the world. ALOT. Its not only being generated, captured, stored, and analyzed at a rate unlike anything seen in human history, but the rate at which all of this is happening is accelerating. Rapidly. For better and for worse, a lot of this data does not fit nicely into the clean, precise, and carefully structured tabular formats perfected by computer scientists and IT professionals in the latter part of the 20th century. Rather, this data youve probably heard it called Big Data, Unstructured Data, LooselyStructured Data, 4k Video, etc. comes in all sorts of shapes and sizes, and in volumes that are so large they require new ways of thinking about capturing, managing, and working with it.   In this course, you will learn to work with big, looselystructured data sets to better understand the world and make better decisions as you operate within it. We will explore a wide variety of different approaches to representing data graphs, data documents, key,value pairs, geopolygons, Big Tables, massive text indices, etc. and the tools that use those data stores to uncover insights and help you make good business decisions.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students who attend class and complete the assigned work will learn to work with a wide range of data representations and data management tools. They will build on their previous experience working with highlystructured data stored in relational database by learning to work with looselystructured data represented with graphs, data documents, geographic information systems, and text.More specifically, by the end of the course students should be able to do the followingUse a graph database to represent networks of interesting things, the relationships between those things, and useful data associated with the things and the relationships.Use a graph database to analyze the graph and its elements to discover interesting and useful properties of the network structure it represents, and the specific elements it contains.Capture, store, model, and manage geographic data using GeoJSON and other commonly used geographic and location data representations.Query and retrieve data from databases using location data and geographic attributes.Build sophisticated data models in MongoDB using JSON data documents.Perform complex, multistage queries, transformations, and analyses of data stored in MongoDB.Find, acquire, and refine data from commercial, government, and publicdomain sources to address business, social, and policy questions.Use freeform search based retrieval tools to gather and analyze textual data.Work efficiently with terabytescale databases stored in the cloud",
                                                    "key_topics":  "Managing, querying, analyzing, and wrangling \"loosely-structured\" data using modern NoSQL tools. These tools will include graph databases, document databases, text databases (search), and geo-spatial datastores.",
                                                    "prerequisite_knowledge":  "Students should arrive to the course knowing how to do basic data queries and manipulation with SQL, and understand how to interpret and design databases using the relational data model. Completion of an introductory programming course is very helpful but not a formal pre-requisite.",
                                                    "assessment_structure":  "Assessment in the course revolves around a set of challenging labs that require the student to wrangle, retrieve, analyze, and interpret increasingly complex and \"loosely-structured\" data. Students will also be assessed on their ability to present their findings from their analyses and recommendations based on those findings.",
                                                    "relevance":  "Collecting, analyzing, and computing with complex, \"loosely-structured\" data is a fundamental set of skills that anybody hoping to pursue a career in business (or data) analytics should develop. This course will help you develop those skills through lectures, labs, and hands-on practice.",
                                                    "learning_resources":  "Students will work with a variety of modern tools for storing, managing, querying, and analyzing data, as well as visualizing and communicating their results. There is no single textbook for the course. Materials are largely available online and through the CMU Library\u0027s online resources.",
                                                    "extra_time_commitment":  "Students should plan to spend, on average, 4-6 hours outside of class on readings, exercises, and labs. Failure to keep up with the work on a regular basis can lead to some weeks with substantially more than six hours of work required to complete the labs. Keeping up with the weekly exercises and assignments will typically keep the weekly load in the 4-6 hours/week range."
                                            }
}