{
        "code":  "70-467",
        "name":  "Machine Learning for Business Analytics",
        "short_name":  "ML FOR BUS ANALYTICS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "((21-254 [] at least D) or (21-256 [] at least D) or (21-259 [] at least D)) and ((36-225 [] at least D) or (36-220 [] at least D) or (36-200 [] at least D) or (70-207 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course introduces students to the machine learning tools and software that drive modern predictive analytics in business settings. Students will gain an understanding of a variety of popular machine learning algorithms including linear and logistic regression, random forests, and neural networks. Each algorithm will be introduced with realworld business applications, and students will learn to implement these algorithms on data. The course is taught in the programming language R prior programming experience is not required.This course may use thirdparty course material that is not available for individual purchase from the publisher.   If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided.   The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will gain knowledge in machine learning algorithms and learn to connect to realworld business applications.",
                                                    "key_topics":  "Gain an understanding of the most popular machine learning algorithms including linear and logistic regression, trees and random forests, clustering, and neural networks.\n\n-See use-cases of these algorithms in real-world applications drawn from finance, marketing, operations, healthcare, and more.\n\n-Learn to implement all of these algorithms on real-world data drawn from these applications. The course will introduce students to Python, a programming language ubiquitous in modern analytics ecosystems. Prior programming experience is not required.",
                                                    "prerequisite_knowledge":  "Calculus, Statistics, and Introductory Business Knowledge",
                                                    "assessment_structure":  "Students will be assessed using homework assignments, class participation, a midterm and a final exam.",
                                                    "relevance":  "The most important emergent theme in business over the last decade can be represented in one word: data. As firms across just about every industry continue their respective arms races to collect increasing amounts of increasingly-complex data, there is accelerating demand for analysts, consultants, and scientists with the ability to transform that data into actionable models and insights, a process dubbed predictive analytics. To that end, the goal of this course is to introduce students to the machine learning tools and software that drive modern predictive analytics in business settings.",
                                                    "learning_resources":  "- Slides/notes/code that will be uploaded to Canvas with each lecture\n- Textbooks: the following book is optional for students interested in additional resources. Bertsimas, O\u0027Hair, and Pulleyblank, The Analytics Edge, 1st edition.",
                                                    "extra_time_commitment":  null
                                            }
}