{
        "code":  "70-447",
        "name":  "Client Consulting Project: Strategic Management of the Enterprise",
        "short_name":  "CLIENT CONSULTING PR",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "(70-381 [] at least D) and (70-371 [] at least D) and (70-122 [] at least D) and (70-311 [] at least D) and (70-391 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This is a project course for senior business majors offered in partnership with realworld client companies students must apply for the course and enrollment is by special permission. Students will learn about the challenges of the multidimensional and complex issues faced by managers, including learning the concepts and skills to handle ambiguity, perform a persuasive data analysis, and communicate the findings effectively. Students will develop a deeper understanding of how organizations can coordinate and leverage synergies across a range of disciplines by effective deployment of technologies and organizational structures and processes. Teams will have an opportunity to work with clients on a wide mix of problems spanning multiple functions, including strategy, operations, technology and marketing. Specifically, teams will address issues such as big data, mobile application strategies, supply chain, digital media, complexity management, health care delivery models and healthcare marketing strategy. Regular meetings with the instructor will be scheduled to guide teams during client engagement and coordinate with the executives at their client company. The deliverables will be in the form of a reportprototype and a final presentation to the clients executive team. No classes to attend, but weekly team meetings with times to be determined. This course may use thirdparty course material that is not available for individual purchase from the publisher. If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided. The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The projects that you will be engaged in shall reflect the reality that often the solution space is unbounded that there are significant challenges in identifying the real problem and that conducting your analysis in a transparent way to achieve buy in from the key stakeholders is important. Taken together, this implies that you will in this course, learn the concepts and skills to handle ambiguity, perform a persuasive data analysis and communicate the findings effectively. Also it should help you develop a deeper understanding of how organizations can coordinate and leverage synergies across a range of disciplines by effective deployment of technologies and organizational structures and processes. You will get an opportunity to work with client companies on a wide mix of problems spanning multiple functions strategy, operations, technology and marketing, all of which will put your Carnegie Mellon education to the test.",
                                                    "key_topics":  "Client Consulting Project is an experiential learning course for a senior that features a broad range of exciting real world projects. It is an innovative project course being offered in partnership with select sponsoring companies to sensitize you to the real world challenges of the multi-dimensional and complex issues managers face today. You will be assigned to a team of five to six students and given a client to engage with for the fall semester on a specific consulting project assignment.",
                                                    "prerequisite_knowledge":  "Students should have completed the core courses in key functional areas in business such as marketing, operations, finance, economics and IS. Preference will be given to students with all round skills or/and high GPA.",
                                                    "assessment_structure":  "Regular meetings with the course faculty will be scheduled to guide you during the fall engagement and co-ordinate with the executives at your client company. Participation in these meetings will count towards the final grade. The deliverables shall be in the form of a report or prototype and a final presentation and Q/A with your client executive team. The final presentation will be evaluated by all the executives sponsoring the course and shall be both on an individual and team basis.",
                                                    "relevance":  "Specifically, teams will address issues such as big data, mobile application strategies, supply chain, digital media, complexity management, health care delivery models and healthcare marketing strategy. The overall experience will help you to take on the several challenges that you will likely face in consulting and functional roles in private and public sector and also sharpen your analytical and presentation skills.",
                                                    "learning_resources":  "Specific documentation and data will be shared by the client company. The weekly meetings with client and site visit will provide additional learning opportunity to interact with client to better understand all dimensions of problems at hand.",
                                                    "extra_time_commitment":  "Students are expected to put in approximately 8 to 10 hours per week on the project during the entire semester and attend all weekly meetings with client and team members leading to the final presentation."
                                            }
}