{
        "code":  "70-484",
        "name":  "Data Science for Finance",
        "short_name":  "DATA SCIENCE FOR FIN",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(70-391 [] at least D) and ((36-208 [] at least D) or (36-202 [] at least D) or (70-208 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course first reviews the fundamentals of Financial Data Science with Python.  The course then introduces several financial applications that rely heavily on data analytics, including 1 Algorithmic Trading, 2 Quantitative portfolio management, and 3 Smart beta and performance analysis. The class uses tools from statistics, machine learning and natural language processing. This course may use thirdparty course material that is not available for individual purchase from the publisher.   If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided.   The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The goal of this course is to expose students to the research, analysis and modeling process involved in developing and implementing effective trading strategies. The course seeks to do so by introducing an appropriate conceptual framework and the necessary analytical tools.",
                                                    "key_topics":  "Data analytics in finance; Computational statistical methods; Technological tools for financial systems",
                                                    "prerequisite_knowledge":  "Basic calculus, probability theory and statistics.",
                                                    "assessment_structure":  "There will be three assignments, class contribution and two quizzes.",
                                                    "relevance":  "This course is about the application of analytical and technological tools within a big data environment. The dramatic increase in financial transactions over the previous decade has generated significant amounts of new data. Processing this data into information requires significant analytical and technological skills. This process can, however, yield insights that confer significant competitive advantage. In this class, students will explore the application of technology to deepen their understanding of how contemporary financial models are used in practice.",
                                                    "learning_resources":  "There are three recommended (but not required) books, and lecture notes.",
                                                    "extra_time_commitment":  "Students will need to spend some time on their assignments and preparing for quizzes."
                                            }
}