{
        "code":  "70-427",
        "name":  "Modern Banks: Strategy and Regulation",
        "short_name":  "FUND BANKING INST",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(70-391 [] at least D) and (70-122 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "What is the main role that banks play in the economy Are banks safe and trustworthy What are the main business areas of a modern full service bank and how does it make profit in each area What are the main risks that they face and how do they manage those risks How can the public assess the risks a bank faces and measure its performance Does the regulation governing banking address these risks effectively The main goal of this course is to examine these and related questions by focusing on the analysis of banks financial reports. Students will learn how accounting and disclosure rules for financial instruments and institutions convey detailed information that is useful to evaluate their risks and performance. Potential limitations of the current financial reporting requirements facing banks will also be discussed. The course covers crucial topics in modern banking strategy and regulation such as interest rate risk, provision on loan losses, fair value accounting for financial instruments, repos, securitization, capital requirements, and derivative and hedge accounting. This course may use thirdparty course material that is not available for individual purchase from the publisher.   If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided.   The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}