{
        "code":  "73-155",
        "name":  "Models, Math, and Markets",
        "short_name":  "MKTS MDLS AND MATH",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The Markets, Models and Math M3 course is designed to allow students to reflect on the thought processes that drive science, viewed through the lens of economics.  While the economics focus will highlight the way economists use data and models to understand the economic phenomena we see in the real world, the course is also designed to add depth of understanding for students who major in some other discipline, for the simple reason that the things economists study touch on all aspects of human existence, whether it is understanding the costbenefit tradeoffs in architectural design, in the engineering of new products or production technologies, or understanding the grand arc of political discourse in history or the way it has shaped our laws.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "As a component course in the GenEd Mathematical Reasoning category, one objective of the course is to give students the opportunity to analyze the role of scarcity in shaping human cultural and economic evolution, and on the remarkable transformation that human ingenuity, working through technology, has brought about in the last 5000 years.A second objective is to allow students to continue to develop their own information literacy skills in using research resources that go beyond Google in working through the course assignments.A third objective is to give students an opportunity to explore the field of economics with an eye for some of the more creative things that economic science has to offer, and to help those students who wish to major in the subject explore these interests in some depth. The focus here will be the forest rather than the trees. Some of the specific economic skills include using economic models based on data analysis and experiments to discipline argumentation about policy issues, and communicating the models or policy issues in creative visual, oral, and written ways.",
                                                    "key_topics":  "Data and models, scarcity and the human condition, growth and the role of technology, patents and copyrights, income inequality, and competition and monopolies, business cycles - booms or busts.",
                                                    "prerequisite_knowledge":  "Calculus 21-111",
                                                    "assessment_structure":  "4 problem sets, participation, mid-term case study / debate, essay-based final exam",
                                                    "relevance":  "Dietrich GenEd Prior to Fall 2021: Modeling - Math\nDietrich GenEd After Fall 2021: Logic / Mathematical Reasoning\n\nThe course is meant to introduce, in an intuitive way, the kinds of mathematical tools and reasoning that economists use, what the economic historian Philip Mirowski has called \"the unreasonable efficacy of mathematics in economic analysis\". Anyone who is interested in doing consulting on policy issues would benefit from the ability to interpret models and understand their applications and limitations.",
                                                    "learning_resources":  "Canvas links to course materials and readings, several course texts, specialized library resource page.",
                                                    "extra_time_commitment":  null
                                            }
}