{
        "code":  "73-104",
        "name":  "Principles of Microeconomics Accelerated",
        "short_name":  "PRIN OF MICRO ACCEL",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is a rigorous introduction to microeconomic principles and how to think like an economist. The students are expected to have a successful, prior exposure to fundamental concepts and therefore, the course is at a faster pace than its sister course, 73102, and covers additional topics.  The questions typically take the form What is the optimal consumption pattern for me as an individual What is the profit maximizing pattern of labor and capital goods for a firm When do we want businesses to go bust Should the government fund student tuition How can firms hire the best match for them Whay kind of informational asymmetries exist in doublesided markets Its my hope that the students start to think about everyday questions from an economic lens Why were cars so hard to find during the pandemic Is Uber surge pricing just a ripoff Is illegal streaming bad for consumers Throughout the semester, we will build a toolkit to allow us to understand how these decisions interact and explain market successes, market failures, and the role of the third parties in the marketplace. Some later topics include credible threats, commitment problems, and the strategic use of information. Knowledge of basic calculus as covered in 21111 would be helpful for the students.  Only students with an AP Microeconomics Exam score of 4 or 5 and qualifying IBCambridge Economics exam scores are eligible to enroll in this course. Students without exam credit should enroll in 73102 Principles of Microeconomics.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the semester, students should be able to1 Discuss human behavior in the context of rational decision making and cognitive biases for a broad set of human goals.2 Use the tools of demand, supply, and equilibrium to think about the outcomes of complex human interactions.3 Identify the role of externalities and possible interventions to reduce their impact.4 Use tools of game theory to analyze strategic interactions among agents in various economic situations.5 Apply these tools to thinking about everyday events and your own choices.6 Support andor criticize proposals using mathematical models and graphical argumentation.",
                                                    "key_topics":  "Individual Choice; Competitive Markets; Market Power; Game Theory; Information Theory; and Government Policy",
                                                    "prerequisite_knowledge":  "Comfort with basic algebra and basic microeconomic concepts as covered in AP in Microeconomics",
                                                    "assessment_structure":  "Homework assignments, quizzes, and exams",
                                                    "relevance":  null,
                                                    "learning_resources":  "Weekly Office Hours, lecture slides. Piazza, textbook, SASC tutoring, current events and news",
                                                    "extra_time_commitment":  null
                                            }
}