{
        "code":  "73-369",
        "name":  "Islamic Economics",
        "short_name":  "ISLAMIC ECON",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is designed to introduce students to the basics of Islamic Finance.  The course will start with an analysis of the Shariah rules that define Islamic Finance.  Students will then look at the main investment structures and map these against the traditional conventional banking products.  The course wraps up with a critique of complex project finance structures through a Shariah compliance lens to identify the gaps between theory and practice.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Upon completing this course, students should have the capacity to1 Examine the foundational concepts and principles of Islamic economics.2 Distinguish between conventional monetary policy and monetary policy in alignmentwith Islamic principles.3 Understand the functions and significance of various Islamic institutions, such as zakat,waqfs, and microtakaful, in advancing social justice.4 Engage in discussions regarding the potential influence of Islamic principles on theprogress of nations.",
                                                    "key_topics":  "This course will cover foundational issues in Islamic economics, Islamic macroeconomics,\nIslamic monetary policy, social justice, and the long divergence phenomenon.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Grading will include in-class quizzes, and tests, and 1-2 small team projects",
                                                    "relevance":  "This course is tailored to students aspiring to build careers in finance and public policy within institutions that adhere to Sharia principles and guidelines, such as investment banks, national wealth funds, and various government agencies.",
                                                    "learning_resources":  "The course will be built on the following reading list:\n(1) Almarzoqi, R. M., Mansour, W., \u0026amp; Krichene, N. (2018). Islamic Macroeconomics: A Model for\nEfficient Government, Stability and Full Employment. Routledge.\n(2) Azid, T., \u0026amp; Sunar, L. (2019). Social Justice and Islamic Economics. London: Routledge\n(3) E¿ri, T., \u0026amp; Orhan, Z. H. (Eds.). (2020). Islamic Monetary Economics: Finance and Banking in\nContemporary Muslim Economies. Routledge.\n(4) Kizilkaya, N. (Ed.). (2019). Methodology of Islamic economics: Problems and solutions.\nRoutledge.\n(5) Kuran, T. (2012). The Long Divergence. Princeton University Press.",
                                                    "extra_time_commitment":  "6 hours/week outside 3 hours of class"
                                            }
}