{
        "code":  "73-354",
        "name":  "Sports Economics",
        "short_name":  "SPORTS ECONOMICS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "((73-102 [] at least D) or (73-104 [] at least D) or (73-100 [] at least D)) and ((70-208 [] at least D) or (36-202 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "his is an Economics elective course that will allow students to apply economic concepts to the world of sports. This course assumes that sport contests provide a useful venue to study and analyze many economic theories and concepts. Given that 1 sports are played with welldefined rules known to all participants, 2 the objective is clear and accurately measured at all times and, 3 the payoffs and rewards are oftentimes large and meaningful,they serve as an ideal environment to study human behavior and decision making. The course begins with a detailed analysis of labor markets, and pricing and market power. Students will then study discrimination in several forms and domains and strategic decisionmaking. The course concludes by analyzing several topics through the lens of Behavioral Economics, such as studying whether players underperform in highstakes situations, understanding momentumin contests and exploring whether market participants incorrectly reward luck in these contests.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course, the student should be able to1. Explain the theoretical causes and effects of monopsony power and utilize basic graphical models to illustrate labor market dynamics2. Define and empirically measure the marginal product of players3. Identify the types, sources, and impacts of labor market discrimination4 Understand basic equilibrium concepts e.g., Nash equilibrium and Mixed strategy Nash equilibrium and apply these concepts to simple strategic situations in sports settings5 Understand how important empirical findings such as rewarding luck contradict the predictions of standard economic models and explain intuitively why humans make these seemingly irrational choices.",
                                                    "key_topics":  "Labor markets; pricing strategies; strategic decision making; behavioral economics",
                                                    "prerequisite_knowledge":  "Microeconomics and regression analysis",
                                                    "assessment_structure":  "Problem sets, in-class exams and a group project",
                                                    "relevance":  "This course will be of interest to students looking to \"think like an economist\". Within the growing world of professional sports, there is increased demand for Sports Economists to work for teams, leagues or as sports agents. The course should count both towards the Economics minor and the Global Economics and Business concentration.",
                                                    "learning_resources":  "Students use a textbook and other reading materials (articles, papers etc.). The class structure will include lectures, whole class discussions, and case discussions.",
                                                    "extra_time_commitment":  "3 hours of in-class instruction per week, plus 6 hours of outside study per week"
                                            }
}