{
        "code":  "73-332",
        "name":  "Political Economy",
        "short_name":  "POLITICAL ECONOMY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "((73-160 [] at least D) or (73-230 [] at least D)) and ((70-207 [] at least D) or (36-200 [] at least D) or (36-201 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The Political Economy course looks at how groups within society organize for selfgovernance.  The course will begin with an overview of the ways groups of individuals organize for collective action by examining different types of political institutions, the role these institutions play in different contexts, and the economic and strategic microfoundations that give rise to these institutions.  We will then examine the empirical evidence supporting this taxonomy, leading to a more detailed consideration of institutions that moderate social conflicts.  The next part of the course examines basic results in social choice theory the Condorcet paradox, Arrows Impossibility Theorem, majority rule, median voter theories, and modern treatments of probabilistic voting models that allow for strategic behavior, misrepresentation of preferences, and policy manipulation.  From this basis for understanding collective choice mechanisms, we will then examine how institutions foster cooperation, looking in detail at problems of public goods allocation, redistribution of income, the organization of clubs  interest groups and lobbying associations in the private sector, and the organization of legislative activities in the public sector.  In our examination of voting and electoral mechanisms, we will look at practical applications of the theory to problems of gerrymandering, voter suppression, and propaganda that feature prominently in contemporary political discourse.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}