{
        "code":  "73-337",
        "name":  "Business of Blockchain",
        "short_name":  "BUS OF BLOCKCHAIN",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "((73-104 [] at least D) or (73-102 [] at least D)) and (73-103 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Economics and business strategy is fundamental for the design and development of blockchain use cases. This course will introduce students to foundational economic concepts to help them understand the role cryptocurrencies play in securing blockchains, how different tokenomics models impact cryptocurrency prices, the different means to create liquidity or resolve illiquidity in decentralized finance DeFi applications such as stablecoins, collateralizedlending, yield farming, or automated market making, the roles of Central Bank Digital Currencies, as well as models to evaluate the valueadded of blockchainbased versus traditional business propositions. This course may use thirdparty course material that is not available for individual purchase from the publisher. If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided. The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Understand the economic foundations of blockchains and their securityMeasure price risks of cryptocurrencies and other digital assetsLearn different approaches to creating liquidity via cryptocurrenciesEvaluate the risks associated with different blockchain business modelsDescribe the purpose of three key areas of Decentralized Finance including stablecoins, collateralized lending, and automated market makingExplain the arguments for or against establishing Central Bank Digital CurrenciesAnalyze the valueadded of blockchainbased business solutions.",
                                                    "key_topics":  "Blockchain, Cryptocurrency, Digital Assets and Tokens, Decentralized Finance",
                                                    "prerequisite_knowledge":  "Principles of Microeconomics, Principles of Macroeconomics",
                                                    "assessment_structure":  "Final grades will be computed according to performance on Written (take-home) Problem Sets, 1 in class Midterm Exam, 1 in class Final Exam, an in class group presentation, and a class participation.",
                                                    "relevance":  "Economics and business strategy is fundamental for the design and development of blockchain use cases. This course will introduce students to foundational economic concepts to help them understand the role cryptocurrencies play in securing blockchains, how different ``tokenomics\u0027\u0027 models impact cryptocurrency prices, the different means to create liquidity or resolve illiquidity in decentralized finance (DeFi) applications such as stablecoins, collateralized-lending, yield farming, or automated market making, the roles of Central Bank Digital Currencies, as well as models to evaluate the value-added of blockchain-based versus traditional business propositions.",
                                                    "learning_resources":  "Course material will include written lecture notes and slides provided by professor, and a course textbook.",
                                                    "extra_time_commitment":  null
                                            }
}