{
        "code":  "73-408",
        "name":  "Law and Economics",
        "short_name":  "LAW \u0026 ECONOMICS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(21-120 [] at least D) and ((73-102 [] at least D) or (73-104 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will provide a broad overview of the scholarly field known as law and economics.  The focus will be on how legal rules and institutions can correct market failures.  We will discuss the economic function of contracts and, when contracts fail or are not feasible, the role of legal remedies to resolve disputes.  We will also discuss at some length the choice between encouraging private parties to initiate legal actions to correct externalities and governmental actors, such aas regulatory authorities.  Extensive attention will be given to the economics of litigation, and to how private incentives to bring lawsuits differ from the social value of litigation.  The economic motive to commit crimes, and the optimal governmental response to crime, will be studied in depth.  Specific topics within the preceding broad themes include the Coase Theorem the tradeoff between the certainty and severity of punishment the choice between ex ante and ex post sanctions negligence versus strict liability property rules remedies for breach of contract and the American rule versus the English rule for allocating litigation costs.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "At the end of the course, students should be able to1.Synthesize and integrate the material learned in their previous microeconomics coursework into an analysis of market failures2.Identify and explain the legal rules and institutions that can correct market failures3.Apply economic methodologies to evaluate the efficiencies of legal rulings4.Explain how private incentives to bring lawsuits differ from the social value of litigation",
                                                    "key_topics":  "Economics, law, contracts, incentives, property rights, economics of litigation, Coast Theorem, punishment, social goods, court system",
                                                    "prerequisite_knowledge":  "Introductory-level microeconomics.",
                                                    "assessment_structure":  "Subject to change: quizzes (15%), homework assignments (15%), project (20%), exams (40%), class participation (10%).",
                                                    "relevance":  "Students interested in pursuing careers in law, business, economics, consulting, and public policy will benefit from understanding the way in which the field of law and economics models behavior - in particular, understanding whether and how market solutions may improve upon court decisions in the areas of torts, contract, property, and crime.",
                                                    "learning_resources":  "Office hours, lecture slides, lecture notes, Piazza, textbook and accompanying study guides, and additional articles (made available on the course web).",
                                                    "extra_time_commitment":  null
                                            }
}