{
        "code":  "76-100",
        "name":  "Reading and Writing in an Academic Context",
        "short_name":  "READ WRITE ACAD CNTX",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Designed as an entry point for other firstyear writing courses at Carnegie Mellon, 76100 is an academic reading and writing course for multilingual students which offers a space for learners to recognize and use the communicative strengths that are created by knowing two or more languages. Experiences in the course give students the opportunity to draw on multiple cultural and linguistic understandings and practices when analyzing and creating meaningful texts. The course emphasizes critical reading and research strategies for a variety of sources which become the basis for individually and collaborativelyproduced texts. The course introduces students to rhetorical choices within and across languages at the sentence, paragraph, and whole text or genre levels. Students will explore a variety of practices in academic writing e.g., paraphrase, synthesis, counterargument and refutation, citation as they relate to genre, audience, purpose, and other factors of a communicative situation. We discuss and practice explicit rhetorical and linguistic conventions for writing in academic English so that writers make choices to connect with readers in academic and professional discourse communities. Students who take this course identify as multilingual students who use English skillfully but perhaps with less comfort as they use another language. These students complete an online placement process that guides them through making their own informed course placement. Students may also skip the placement process and enroll directly into the course. For some students, 76100 is a prerequisite requirement for other firstyear writing courses therefore, students should check with their academic advisors regarding how 76100 fulfills their general education course requirements. All 76100 courses are structured by the learning objectives shared across sections of the course, but sections present different themes in their readings.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://www.cmu.edu/dietrich/english/academic-programs/writing-and-communication/index.html",
        "custom_fields":  {
                                                    "goals":  "The goals for students as multilingual writers at Carnegie Mellon stretch beyond the context of 76100. Students will1take on a readerdisciplinarycentered perspective and not a correctnesscentered perspective when you write in English 2employ a planned approach toward your English writing tasks 3engage in reflective writing processes that allow for your continuing rhetorical and linguistic development over time.In the service of these goals, by the end of this course, students will be able toApply a range of strategies for reading and analyzing academic English.Develop writing processes that enable you to plan, write, revise, and edit your own writing.Use the building blocks of sourcebased writing e.g., quoting, paraphrasing, summarizing, comparing, and arguing.Take a position on a controversial issue and argue with evidence for that position. Build linguistic and compositional strategies for controlling your writing in English.Identify and write with conventions that fit standard, academic genres within a U.S. academic university context.Engage in collaborative peer review processes for your writing.Identify your strengths and ongoing challenges as multilingual writers of academic English.",
                                                    "key_topics":  "second language writing strategies, advanced reading strategies, analyzing source material, thesis-driven argument, whole-text coherence, reader-based writing, portfolio-based",
                                                    "prerequisite_knowledge":  "English language proficiency for reading nonfiction and arguments, engaging in discussions about reading, and producing summaries of readings.",
                                                    "assessment_structure":  "Papers: Summary, Comparison, and Position\nLow-stakes Homework and Daily Assignments\nAttendance and participation\nFinal Portfolio",
                                                    "relevance":  "76-100 is a pre-requisite component of the First-Year Writing requirement for some students whose first or primary language is not English. These students may be required to take a placement exam administered by the university prior to the Fall semester. Students who take this course qualify through this placement exam. Alternatively, students can choose to forgo the placement exam if they prefer to enroll in 76-100 during their first semester.\n\n76-100 requires a different set of written assignments and focuses on a different set of skills than the other First-Year Writing course offerings. It is not an easier version of these other courses; it is a completely different course. Whether or not you are placed in 76-100 is dependent on which skills you demonstrated mastery of on your placement exam.",
                                                    "learning_resources":  "materials available through Canvas",
                                                    "extra_time_commitment":  "1:1 writing conferences with faculty"
                                            }
}