{
        "code":  "76-102",
        "name":  "Advanced First Year Writing: Special Topics",
        "short_name":  "ADV FY WRITING",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [
                                            {
                                                    "code":  "76-101",
                                                    "id":  4568,
                                                    "name":  "Interpretation and Argument",
                                                    "units":  9.0
                                            }
                                    ],
        "equiv":  [
                                    {
                                            "code":  "76-101",
                                            "id":  4568,
                                            "name":  "Interpretation and Argument",
                                            "units":  9.0
                                    },
                                    {
                                            "code":  "76-108",
                                            "id":  8680,
                                            "name":  "Writing about Public Problems",
                                            "units":  4.5
                                    },
                                    {
                                            "code":  "76-107",
                                            "id":  8681,
                                            "name":  "Writing about Data",
                                            "units":  4.5
                                    },
                                    {
                                            "code":  "76-106",
                                            "id":  8682,
                                            "name":  "Writing about Literature, Art and Culture",
                                            "units":  4.5
                                    }
                            ],
        "long_desc":  "76102, Advanced FirstYear Writing courses are designed for students who have demonstrated an understanding and practice of academic writing that most incoming freshmen have not, both in terms of mindful writing knowledge and experiential range. Because of the students level of preparedness, the FirstYear Writing Program provides intensive, advanced courses for students to work closely with senior faculty within the English department. Advanced courses assume that students have established strong reading and synthesizing skills, as well as a demonstrated interest in writing and communication, prior to entering Carnegie Mellon. The course topics shift each semester, but for every advanced firstyear writing course, the core goals are to deepen students rhetorical knowledge and production skills that align with the faculty members specialty. Because the course emphasizes authentic stakes and purposes for communicating with academic audiences, students will regularly share their work with their peers in oral and written forms within an interactive and collaborative classroom environment. Students enroll through special invitation, after completing an application process. There are no prerequisites for the course.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://www.cmu.edu/dietrich/english/academic-programs/writing-and-communication/index.html",
        "custom_fields":  {
                                                    "goals":  "Genre and Language Knowledge to observe and adapt models for writing your own text that connects with readers.Academic Inquiry and Research Knowledge to construct a relevant academic contribution that comes from inquiry and engagement with multiple existing perspectives.Argument Knowledge to invent and produce reasonable arguments that convince readers in an academic discourse community.Multimodal Knowledge and Collaboration to use visual and oral modes of communication to communicate your argument.Composition and Cognitive Process Knowledge to manage your knowledge and writing processes to meet new rhetorical situations.",
                                                    "key_topics":  "humanistic research, advanced academic authorship, academic argument genres (thesis-driven essay, research proposal, and research article), using models, advanced source-based writing, argument analysis, synthesis",
                                                    "prerequisite_knowledge":  "Students should enjoy reading and writing if they take this class and should welcome challenges for humanistic reading, writing, and inquiry. They should be able to synthesize academic research, read intensively and closely, work comfortably with summary, paraphrase and basic citation methods to support source-based writing; should be familiar with basic argument skills for both reading and writing; should not only exercise control over language choices but should use advanced strategies for using language; should exercise control over composition processes; should be familiar with a variety of strategies for planning and writing texts.",
                                                    "assessment_structure":  "3 higher Stakes Writing Assignments (Critical Lens Analyses, Proposal, Contribution)\t\n\nWriting Process \u0026 Peer Review Assignments\t\t\t\nReading Analysis Assignments\t\t\t\t\t\nGroupwork \u0026 Participation, including a presentation",
                                                    "relevance":  "Advanced First-Year Writing courses are designed for students who have demonstrated an understanding of academic writing that most incoming freshmen have not. Because of the students\u0027 level of preparedness, the First-Year Writing Program provides intensive, advanced courses for students to work closely with senior faculty within the English department. Advanced courses assume that students have established strong reading and synthesizing skills, as well as a demonstrated interest in writing and communication, prior to entering Carnegie Mellon. The course topics shift each semester. Students enroll through special invitation. Class size for 76102 is capped at 18 and students are accepted by application/invitation only.",
                                                    "learning_resources":  "materials available through Canvas",
                                                    "extra_time_commitment":  "1:1 conferences with faculty about your writing"
                                            }
}