{
        "code":  "76-101",
        "name":  "Interpretation and Argument",
        "short_name":  "INTERPRETN \u0026 ARGMNT",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [
                                            {
                                                    "code":  "76-102",
                                                    "id":  4567,
                                                    "name":  "Advanced First Year Writing: Special Topics",
                                                    "units":  9.0
                                            }
                                    ],
        "equiv":  [
                                    {
                                            "code":  "76-102",
                                            "id":  4567,
                                            "name":  "Advanced First Year Writing: Special Topics",
                                            "units":  9.0
                                    },
                                    {
                                            "code":  "76-108",
                                            "id":  8680,
                                            "name":  "Writing about Public Problems",
                                            "units":  4.5
                                    },
                                    {
                                            "code":  "76-107",
                                            "id":  8681,
                                            "name":  "Writing about Data",
                                            "units":  4.5
                                    },
                                    {
                                            "code":  "76-106",
                                            "id":  8682,
                                            "name":  "Writing about Literature, Art and Culture",
                                            "units":  4.5
                                    }
                            ],
        "long_desc":  "Interpretation and Argument, an inquirydriven writing course, is one of a number of firstyear writing course options available to students at Carnegie Mellon. A fullsemester course experience, 76101 introduces students to foundational practices for reading, synthesizing and producing scholarly knowledge within an academic context. Within the course, students learn transferable, genrebased skills applicable to a variety of different fields. Students use a comparative genre analysis method for using models to complete new writing tasks, including an academic research proposal and a research article that contributes to an ongoing academic conversation. Faculty who teach 76101 typically select a range of texts e.g., scholarship, journalism, film about an unresolved issue, so that students can identify relevant questions to frame their own research projects. Students should expect explicit, researchbased instruction within the course, reflecting upon their writing processes, as well as planning, drafting and revising drafts. Because the course emphasizes authentic stakes and purposes for communicating with academic audiences, students will regularly share  their work with their peers in oral and written forms within an interactive and collaborative classroom environment. Due to the limits of our schedule, we are unable to meet each students individual preferences for course topics, but we do offer a wide variety from which to choose.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://www.cmu.edu/dietrich/english/academic-programs/writing-and-communication/index.html",
        "custom_fields":  {
                                                    "goals":  "Genre and Language Knowledge to observe and adapt models for writing your own text that connects with readers.Academic Inquiry and Research Knowledge to construct a relevant academic contribution that comes from inquiry and engagement with multiple existing perspectives.Argument Knowledge to invent and produce reasonable arguments that convince readers in an academic discourse community.Multimodal Knowledge and Collaboration to use visual and oral modes of communication to communicate your argument.Composition and Cognitive Process Knowledge to manage your knowledge and writing processes to meet new rhetorical situations.",
                                                    "key_topics":  "academic authorship, academic argument genres (thesis-driven essay, research proposal, and research article), using models, advanced source-based writing, argument analysis, synthesis",
                                                    "prerequisite_knowledge":  "Students should be able to work comfortably with summary, paraphrase and basic citation methods to support source-based writing; should be familiar with basic argument skills for both reading and writing; should exercise control over language choices and should exercise control over composition processes; should be familiar with a variety of strategies for planning and writing texts.",
                                                    "assessment_structure":  "Higher Stakes Writing Assignments (CGA, Proposal, Contribution)\t\n\nWriting Process \u0026 Peer Review Assignments\t\t\t\nReading Analysis Assignments\t\t\t\t\t\nGroupwork \u0026 Participation, including a presentation",
                                                    "relevance":  "76-101 is a full-semester course and one of the course options that students can choose to fulfill their First-Year Writing requirement. The other option is to take two half-semester mini courses. If you like the idea of engaging in a sustained focus throughout the semester, this full-semester course may be a good option for you. Our full-semester courses offer students the opportunity to read deeply about a controversial issue or topic. Students acquire strategies for reading, forming research questions, and writing research proposals and articles, in order to contribute an original argument to an ongoing field of inquiry. Some students report a flexible, \"marathon\" pace throughout the course, driven by the lack of a mid-semester break.",
                                                    "learning_resources":  "materials available through Canvas",
                                                    "extra_time_commitment":  "1:1 conferences with faculty about your writing"
                                            }
}