{
        "code":  "76-108",
        "name":  "Writing about Public Problems",
        "short_name":  "WRTG ABT PUB PROBS",
        "units":  4.5,
        "min_units":  4.5,
        "max_units":  4.5,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [
                                    {
                                            "code":  "76-102",
                                            "id":  4567,
                                            "name":  "Advanced First Year Writing: Special Topics",
                                            "units":  9.0
                                    },
                                    {
                                            "code":  "76-101",
                                            "id":  4568,
                                            "name":  "Interpretation and Argument",
                                            "units":  9.0
                                    }
                            ],
        "long_desc":  "This mini or halfsemester course one of two minis students can choose to fulfill their FYW requirement centers on introductory professional writing and offers students the opportunity to develop a proposal for change students will examine a public problem of their choice, conduct primary and secondary research, and create a publicfacing presentation. This course asks students to recognize that many problems we encounter in our communities require an invested stakeholder, like ourselves, to conduct a careful investigation of perspectives and constraints before proposing a feasible solution that considers diverse stakeholders values and viewpoints. Students will learn how public problems are defined and argued in the proposal genre by reading a range of expert texts and analyzing a variety of sample proposals. Students will conduct various forms of social research email, interview, survey, andor observation to gain perspective on a problem and develop a solution mindful of others expertise and experience. Students will also synthesize relevant secondary research to rhetorically frame a proposal in ways that will compel their intended audience to take action. By the end of the course, students will write and present their own change proposal that identifies a communitybased problem, proposes a thoughtfullyresearched solution, and recommends a feasible plan for change in one of their own communities. Because the course emphasizes authentic stakes and purposes for communicating with professional and academic audiences, students will regularly share their work with their peers in oral and written forms within an interactive and collaborative classroom environment.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://www.cmu.edu/dietrich/english/academic-programs/writing-and-communication/index.html",
        "custom_fields":  {
                                                    "goals":  "Students will engage with meaningful communication projects that enable them to build strong rhetorical reasoning skills and powerful writing and communication strategies. Students learn to be communicators who can understand their environments, assess rhetorical needs, and utilize their knowledge and resources strategically to craft documents that build consensus and connect with readers. Specifically, students will becomeWriters who can adapt their linguistic and rhetorical knowledge to write readercentered texts across a variety of academic and nonacademic contexts.Writers who can read and use complex texts to understand and contribute to culturally significant problems.Writers who can position themselves as knowledge makers or agents of change within a discourse community, so that they can make meaningful contributions to others in that community.Specific objectives or academic literacy practices that students will be able to perform includeAnalyze models of problemsolution texts for their genre norms and situations Produce readercentered email and powerpoint communication Design multimodal documents that employ basic principles of visual hierarchy Adapt superstructures for writing problemsolutionfeasibility textsConstruct readeroriented researchlegwork plans for nonacademic communicationWrite a readercentered proposal for an audience who is a decision makerRead and synthesize relevant information from research genres like white papers and IMRD research articlesDemonstrate ethical consideration of stakeholders when communicating about an organizational or policy problemReview peers communication as professional communication that must prompt actionDevelop metacognitive strategies for controlling your writing processes",
                                                    "key_topics":  "Non-academic writing, Change Proposal, Rhetorical situation, professional writing, visual-verbal communication, perspective taking, collaboration, Organizational Communication",
                                                    "prerequisite_knowledge":  "Students should be able to work comfortably with summary, paraphrase and basic citation methods to support source-based writing; should be familiar with basic argument skills for both reading and writing; should exercise control over language choices and should exercise control over composition processes; should be familiar with a variety of strategies for planning and writing texts.",
                                                    "assessment_structure":  "Comparative Genre Analysis Memo\t\t\nEmail: Making Requests\t\t\t\t\nWriting Process and Peer Review HW\t\t\nOther homework and classwork\t\t\t\nProposal + Proposal Pitch (oral presentation)\t\t\t\t\nAttendance and Participation",
                                                    "relevance":  "76-108 is one of three First-Year Writing mini (half-semester) courses, along with 76-106 and 76-107. Taking two out of these three minis is one of the course options that students can choose to fulfill their First-Year Writing requirement. The other option is to take a full-semester course, normally 76-101. If you like the idea of a fresh start in the middle of the semester, taking two mini courses might be a good option for you. The minis offer students the opportunity to focus upon strategies for particular types of communication situations and target genres. By taking two minis, you will gain exposure to more than one kind of writing: arts \u0026 humanities-based (76-106), technical (76-107), and professional (76-108). You will also learn ways of adapting to new and different communication situations. Some students report a more dynamic structure and pace driven by the break at mid-semester.",
                                                    "learning_resources":  "materials available through Canvas",
                                                    "extra_time_commitment":  "1:1 conferences with faculty about your writing"
                                            }
}