{
        "code":  "76-204",
        "name":  "Race, Ethnicity, Controversy",
        "short_name":  "RACE, ETHNC, CONTRSY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Coverage of police violence. Condemnations of Critical Race Theory. Book bans. Kung flu. In recent years, current issues around race have proliferated, and with them, complex layers of discourse and controversy. This course examines current issues around race through the twin lenses of rhetoric and ethnic studies, asking how power is expressed through rhetorics of race and controversy. What are the communicative practices involved in framing or responding to racial violence, prejudice, and controversy How do these practices harness various cultural, political, and historical forces, and to what effect How do these discourses contribute to racialization, and where, and how, are differential distributions of power being expressed We will seek to understand discourses around these issues and the backgrounds of various debates, from policing and abolition, to recurring antiAsian racism, to affirmative action debates, to transracial adoption. Students will learn to analyze discourses around race rhetorically, identify structures of power at work in these discourses, and produce a final paper analyzing the rhetorics of a current issue or controversy around race.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Think critically about current controversial issues for which race is central and learn to rhetorically analyze the discourses surrounding them gain a foundation of knowledge in ethnic studies and learn to examine race through the lens of power produce an academic paper around a central thesis",
                                                    "key_topics":  "Scholarship on race and ethnic studies; rhetoric and communication; academic writing",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Reading responses, short papers, final paper, participation, and a short presentation",
                                                    "relevance":  "This course is geared toward students with an interest in contemporary issues around race and the cultural/historical/political forces that structure them.",
                                                    "learning_resources":  "All readings and materials will be available on Canvas",
                                                    "extra_time_commitment":  "Potential requirement to watch a film from home."
                                            }
}