{
        "code":  "76-213",
        "name":  "19th Century British Literature",
        "short_name":  "19TH CENTRY BRSH LIT",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Topics vary by semester. Spring 2012 Women writers played an essential role in the construction of Victorian literary culture. In this course we will read novels, poems, and periodical extracts by a diverse body of nineteenthcentury female authors as a means of better understanding womens historic and aesthetic impact on Victorian culture. While some of our authors are well known, like the wildly popular poet Elizabeth Barrett Browning, we will also encounter the lost author, journalist, and controversial antifeminist Eliza Lynn Linton. The writing of Victorian women exemplifies important social debates from the nineteenthcentury. Social taboos such as divorce, suffrage, Bloomerism, children out of wedlock, and women in the workforce were all topical in Victorian culture. As the conflicted and introspective heroine of George Eliots The Mill on the Floss reminds readers, the role of marriage as a womans sole profession was becoming increasingly untenable in the modern era. Victorians were forced to ask what other function were women fit to occupy. From the PreRaphaelite poetry of Christina Rossetti, to the gothic horror of Emily Brontes Wuthering Heights, the woman question served as a lightening rod for a variety of nineteenthcentury cultural anxieties. The woman as deviant and criminal which we will encounter in Mary Elizabeth Braddons Lady Audleys Secret was an especially controversial aspect of the femaledominated genre of Sensation Fiction. Margaret Oliphant records in an 1867 review from Blackwoods What is held up to us as the story of the feminine soul as it really exists underneath its conventional coverings is a very fleshy and unlovely record.See Dept. for full desc.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}