{
        "code":  "76-224",
        "name":  "dSHARP Seminar: Evolution of Artificial Intelligence and the Ethics of Creation",
        "short_name":  "DSHARP RSRCH SEMINAR",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Mary Shelleys novel Frankenstein or, The Modern Prometheus was first published two hundred years ago on March 11, 1818. Many critics focus on Victor Frankenstein as a figure of hubris in his pursuit of knowledge without limit, yet more in line with this collection is that in his drive to create life he did not stop to think of the consequences nor what was to become of the result. Shelleys novel warns of the possible sacrifices for knowledge and hints toward the costs to man and society, how new knowledge can redefine human existence and experience. Science and technology have rapidly advanced Shelleys time sometimes too quickly for creators to fully consider the ramifications of new discoveries. As science fiction literature and media have matured over the past two hundred years, the themes of Frankenstein have been reinterpreted and applied to debates regarding atomic weapons, nuclear energy, cloning, bioengineering, robotics, and artificial intelligence AI. Isaac Asimov coined the term Frankenstein Complex in his 1947 robot stories to not only warn of humanitys tenuous control over technology, but also to caution against the profitbased replacement of human labor with automation. It is the humanoid android and the cyborg that blends man and machine that evokes the most dire warnings in todays renderings of the Frankenstein Complex. This course will explore the evolution of AI and the ethics of creation in modern American scientific and science fictional culture.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}