{
        "code":  "76-261",
        "name":  "Intro to Writing Creative Nonfiction",
        "short_name":  "INTRO WRT CRTV NONFI",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "According to The National Endowment for the Arts, creative nonfiction is factual prose that is also literary.   Memoir, the essay, and literary journalism are just three kinds of work that fit into this broad, vital genre.  While creative nonfiction often borrows techniques from fiction, such as narrative, scene, dialogue, and point of view, creative nonfiction is based on actual events, characters and places.  What distinguishes creative nonfiction from journalism is that it conveys more than barebones facts language, analysis and narrative voice are an integral part of each piece.  Journalists seek the truth by attempting to be objective.  Writers of creative nonfiction understand that truth is often the biased, subjective truth as experienced by the author.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The goal of this course is for students to read widely within the genre and to gain confidence and experience as a writer of creative nonfiction.My students will cultivate and sharpen their ability to articulate personal truths, to do the sort of selfsorting that allows them to make sense of both society and their place within it, to construct powerful and informed narratives, and to translate big ideas into accessible prose.",
                                                    "key_topics":  "Non-fiction, memoir, personal essays, cultural criticism\n\nIn this course we will analyze the different types of narrative structure, narrative suspense, voice, metaphor, and point of view that make for effective nonfiction writing. We will also examine the difference between good writers and good work, the functions of objective distance from and intimate investment in a subject, as well as the philosophical questions spurred by nonfiction writing. What is the nonfiction writer\u0027s role, and how does it differ from that of the fiction writer? Where do the two genres overlap? What gives nonfiction writing integrity? What does the term \"creative nonfiction\" mean? How have the form and aims of nonfiction writing - from memoir to essays to long-form journalism - evolved for better and for worse?",
                                                    "prerequisite_knowledge":  "An enthusiasm for reading and writing non-fiction. As an introductory course, I expect enthusiasm more so than expert grasp.",
                                                    "assessment_structure":  "Reading responses, weekly writing exercises, peer critique, final fact-embedded story development",
                                                    "relevance":  "DC GenEd: Disciplinary Perspectives The Arts",
                                                    "learning_resources":  "Touchstone Anthology of Contemporary Creative Nonfiction - work from 1970 to the Present, Williford, Martone, eds.",
                                                    "extra_time_commitment":  null
                                            }
}