{
        "code":  "76-205",
        "name":  "Jane Austen",
        "short_name":  "JANE AUSTEN",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [
                                        {
                                                "code":  "76-101",
                                                "id":  4568,
                                                "name":  "Interpretation and Argument",
                                                "units":  9.0
                                        }
                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "It is a truth universally acknowledged that Jane Austen is one of the most popular writers of the past two hundred years. In this course, students will have the opportunity to indulge in the work of this beloved author and answer What can an exploration of Austens time tell us about her novels and about ourselves as readers In this course, we will read Austens six published novels Northanger Abbey, Pride and Prejudice, Sense and Sensibility, Emma, Mansfield Park, and Persuasion as we consider In what ways can we describe Austens novels as romantic, and how does her work fit within the parameters of the Romantic canon With increases in literacy rates and the emergence of lending libraries, what can Austens novels tell us about readership and popular fiction in the early nineteenth century How do these vibrant texts engage with important issues of their and our time, like revolution, womens rights, race, sexuality, nationality and religion     Additionally, we will encounter excerpts from Austens contemporaries and explore other cultural materials  like diaries, letters, periodicals, maps, music, fashion, and the visual arts  to paint a rich historical context around our reading. Finally, we will consider how cinematic adaptations of Austens works can contribute to our interpretations of her novels.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}