{
        "code":  "76-210",
        "name":  "Banned Books",
        "short_name":  "BANNED BOOKS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Literature is powerful Indeed, were interested in books that are so controversial that people will shout, argue, and try to change laws in order to have a book removed from a curriculum, a school or public library, or a prison. At the same time, well learn about how, in response, other people work extremely hard to defend books against removal and censorship.The term banned books can be a bit misleading in the US context only in very rare cases does the US federal government get involved in trying to ban or censor a published work. Nonetheless, the US is a hot spot for those who seek to attack books, and those who seek to defend them. In this course you will find that the actions of attackers and the actions of defenders are often mutually reinforcing.Every student in this course will contribute to a public facing website called The CMU Banned Books project. This website is used by journalists, scholars and activists around the world.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Learn more about how specific works of literature are connected to history and culture. If a book is banned or challenged close to when it is written or published, thats interesting. But what about classics, and books that are repeatedly taught, and repeatedly challenged, over decades and even centuries Understand what is free speech, and how does it apply to literature It is not widely understood what free speech means from a legal point of view, or what the First Amendment allows us to do, and what it does not. In other words, well be thinking about the political history of free speech and free printing in the US context. Learn about what are the institutions that are most relevant for the study of banned books They include the American Library Association, schools, school districts, collegesuniversities, and the courts. For example, ALA created Banned Books week in 1982. They keep the most detailed records of challenges to books, in part because libraries are the places where challenges are levied, when citizens and parents seek to control who has access to particular books. Learn more about how to parse and understand arguments. Students will learn how to identify the argument that the books are makingincluding works of fiction. At the same time, students will learn to examine the layers of argument made when people try to ban books. Very often the stated reason for the challenge obscenity, age appropriateness, etc., conceals the real reason for the objections. Learn historical storytelling. Students will create coherent narratives about when, who and why the book that they have chosen for their final project was banned or challenged. Give an oral presentation, with a substantial visual component, add a 500 word entry to the CMU Banned Books Project website, and write a 10 page research paper. Learn research skills. Students will pose research questions such as when, how, and why a par",
                                                    "key_topics":  "Throughout the course we will think about the relationship between freedom of speech and the freedom to read; we will examine the ways in which banning and challenging books overlaps with what we call \"cancel culture.\"",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Students are assessed in 6 ways; 1) through class discussions; 2) through weekly discussion posts, 3) through weekly self assessments; 4) through a class presentation; 5) through a 500 word entry about their chosen book on the CMU Banned Book project web site; 6) through a 10 page paper about their chosen book.",
                                                    "relevance":  "DC Disciplinary Perspectives: Humanities",
                                                    "learning_resources":  "Students will be required to buy 2 or 3 books for the course, including the book they choose to research. All other readings, lectures, and additional materials will be provided by the instructor.",
                                                    "extra_time_commitment":  null
                                            }
}