{
        "code":  "76-240",
        "name":  "Environmental Crisis and the End of Nature in Global Lit \u0026 Culture",
        "short_name":  "SP TPS LTR: ENV CRIS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Hurricanes, forest fires, melting glacial and sea ice, heat waves and floods all over the world are increasingly drawing our attention to the harmful effects of manmade climate change. These cataclysmic changes in the global climate have captured the attention not only of scientists and environmentalists, but also novelists, poets and filmmakers. A new genre of fiction called clifi has emerged in the last decade, rendering the current and future realities of global warming more palpable.   In this class, we will consider questions such as how and why does clifi matter in the context of climate change Can clifi help alter our conceptions of the earth and our role in changing it How are identities of class, race and gender important to the narratives about ecological crisis How do these texts conceive ways of adapting to new realities of climate change and imagine alternative futures We will also analyze the specific formal and stylistic conventions of the genre of clifi and situate these texts within broader debates and discoursesscientific, philosophical, historical, and politicalabout climate change.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}