{
        "code":  "76-268",
        "name":  "Comic Books \u0026 Pop Culture",
        "short_name":  "COMC BKS \u0026 POP CULT",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "From newspaper comic strips to the Golden Age of superheroes, from graphic novels to the MCU, and from manga to webcomics, this course explores the history and impact of comics in society.  Why do so many turn to comics to share their stories How do the visual and textual work together to create a unique literary form How has that form evolved in response to technological and social change Together, we investigate how comics and their adaptations including films and video games have shaped our ideas about power, justice, identity, teamwork, technology, and morality.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Along with an introduction to the genre, students will practice literary and media analysis, participate in discussion and group work, and produce projects of their own design",
                                                    "key_topics":  "comic books, genre, pop culture, film, video games, web comics, memoir, superheroes, manga",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Short response papers, a presentation, group project, final project",
                                                    "relevance":  "This course is open to all interested in learning and thinking about the role of comics in pop-culture.",
                                                    "learning_resources":  "Some materials will be available on Canvas, copies of class texts will be on course reserves, the purchase of some texts will be recommended",
                                                    "extra_time_commitment":  null
                                            }
}