{
        "code":  "76-217",
        "name":  "Literature \u0026 Culture of the 20th and 21st Century",
        "short_name":  "LIT/CULT 20/21ST C",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Spring 2022 If youre in college now, youre probably a member of Generation Z. There are a number of studies of Generation Z and its disposition, habits, and interests. While we are familiar with factors that make up our identitiesnationality, race, ethnicity, gender, sexuality, income, and ablednessones generation is probably just as influential, and according to some sociologists, more important than those other factors. In this class we will look at portraits of American generations in fiction, from the Baby Boomers and Generation X through Millennials and Generation Z. We will also look at some of the sociology and see how it bears on the fiction. In addition, we might look back at past generations, such as the generation that came of age after World War I, the Lost Generation, which inspired writers such as F. Scott Fitzgerald, and the Beat Generation, which inspired Jack Kerouac. In more recent fiction, we might read fiction such as Couplands Generation X, Lauren Groffs portrait of the sixties generation in Arcadia, or Ling Mas portrait of Millennials in Severance. We will also look at film along with novels, possibly including The Big Chill, Reality Bites, and other movies.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1 familiarize students with key theories, concepts, and issues within antifascism 2 provide students with the grounding knowledge for situating antifascist cultures historically, 3 students will practice skills for analyzing cultural practicesobjects as texts, events, or media 3 students will have the opportunity to develop their own contribution to a class portfolio as either a reserch based or creative design project engaging with the course content.",
                                                    "key_topics":  "Cultures of Anti-Fascism",
                                                    "prerequisite_knowledge":  "Students should meet the prerequisites for the course",
                                                    "assessment_structure":  "short papers, discussion facilitation, and final portfolio project",
                                                    "relevance":  "This course provides students with an iroductory engagement with cultural studies methodology, by tackling a timely and important subject in 20th and 21st century literature and culture.",
                                                    "learning_resources":  "PDFs and links to most materials will be distributed on canvas.",
                                                    "extra_time_commitment":  null
                                            }
}