{
        "code":  "76-289",
        "name":  "Billingual \u0026 Bicultural Experiences in the US",
        "short_name":  "BILNGL BICLTR EXP",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "What does it mean to be bilingual in the USA, when approximately 80 of Americans are monolingual Englishspeakers In this course, we will learn about the nature and experience of bilingualism and biculturalism past and present and how it shapes different perspectives and worldviewswithin an individual, between individuals, and on a larger societal, cultural level. The course highlights the experiences of groups such as immigrants, racialethnic minorities, indigenous communities, and users of signed languages to foreground experiences that may be similar to or different from those of the students. We use a variety of resources e.g., social media, film and documentaries, historical documents, literature, music, art to accomplish this, and students are encouraged to be creative in the ways they design their own handson projects. This discussionbased course is taught in English and is open to all students, whether they identify as bilingualbicultural, or are simply interested in the course topic.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course, students will be able to... Think critically and use rhetorical skills to analyze bilingual and bicultural experiences at micro, meso, and macro levels. Examine how the experiences of bilingual and bicultural people and groups in the United States have impacted their worldviews, how those worldviews may be different than, or similar to, our own. Evaluate how the United States history, politics, and hegemonic cultural forces have influenced discourses and ideologies around bilingual and bicultural people and groups. Analyze inequalities and discriminatory attitudes towards bilingual and bicultural people in the United States and how prevailing notions about language, culture and patriotism by dominant groups have created and perpetuated those attitudes.",
                                                    "key_topics":  "Some possible topics to be covered include: the nature of bilingualism and biculturalism; the historical and social contexts of bilingualism in the United States; what happens when languages interact; how bilinguals use language; language and power relationships; the role of institutions and policies around language revitalization and heritage language maintenance in education; and the connection between language, culture, and identity.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Weekly homework assignments; book or film review; three small projects; final project with individual choice of topic and medium.",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Reflecting Dietrich GenEd after Fall 2021: Foundations - Intercultural and Global Inquiry Elective for Modern Languages Majors and Minors Relevant to linguistics, applied linguistics, second language acquisition, sociolinguistics, policy studies, intercultural competence, multicultural studies, American Studies.",
                                                    "learning_resources":  "Canvas, one course text available as CMU library eText, course materials from a variety of genres/formats posted on Canvas",
                                                    "extra_time_commitment":  null
                                            }
}