{
        "code":  "76-242",
        "name":  "American Woman Writers",
        "short_name":  "AM WMN WRTRS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In 1855, Nathaniel Hawthorne lamented to his publisher that America is now wholly given to a damned mob of scribbling women and I should have no chance of success while the public taste is occupied with their trash. Even today, The New York Times Book Review and other gatekeepers rarely give women writers the coverage that male writers receive. In this course we will trace the multiple traditions of 20th century American womens writing and examine how women writers question, resist, subvert, and revise traditional gender roles. Our readings will address the social construction of gender the relationship between gender and genre the cultural positions of women as writers and readers womens rights and suffrage women and work female sexuality and sexual freedom constructions of motherhood intersections of gender with race, class, and ethnicity. Readings include The House of Mirth, Pale Horse Pale Rider, Their Eyes Were Watching God, Raisin in the Sun, To be Young, Gifted and Black, Woman Warrior, Fun Home, and The Namesake. Every other week or so we will be reading excerpts from Feminist Literary Theory and Criticism.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  "There will be at least one film screening of Lorraine Hansberry\u0027s play-to-movie, Raisin in the Sun."
                                            }
}