{
        "code":  "76-248",
        "name":  "Bollywood Cinema",
        "short_name":  "BOLLYWOOD CINEMA",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course provides an overview of popular Indian cinema, with an emphasis on contemporary Bollywood films. The course will trace the development of Indian cinema from the 1950s to the present moment, mapping its transformation from a national film industry to a global culture industry. We will build a cinematic and cultural vocabulary that would enable us to critically engage with popular culture, particularly cinema, from nonWestern contexts. We will watch and analyze a diverse range of film genres and styles, including mainstream Bollywood films, arthouse films, crossover films, indiemultiplex films, as well as popular films from other regional Indian film industries. Focusing on the aesthetic, narrative, and ideological elements of these films, the course invites us to examine the role of popular cinema in shaping and reshaping Indian national identity. We will familiarize ourselves with some of the key debates and issues in Indian cinema, such as the role of cinema in the postcolonial state, the function of realism, the status of melodrama, the significance of song and dance, the nature of film censorship, and the relationship of Bollywood with other film cultures. The course will conclude with the global travels of Bollywood, its popular and scholarly reception, and its impact on other media and creative industries.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}