{
        "code":  "76-299",
        "name":  "19th Century Russian Masterpieces",
        "short_name":  "19TH CENT RSSN MST",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In the 19th century, Russian writers produced some of the most beloved works of Western literature, among them Dostoevskys Crime and Punishment and Tolstoys Anna Karenina. These novels continue to captivate audiences and inspire adaptations in theater, film, and television. This course will examine the fertile century that yielded such masterpieces. In addition to the works mentioned above, students will encounter texts by writers who may be less well known but are no less significant, including Pushkin, Lermontov, Gogol, Chekhov, and Pavlova. We will consider the social and cultural circumstances in which these works were produced and reflect on the reasons these Russian masterpieces have appealed to audiences well beyond the Russianspeaking world.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course students will be able to ... Consider how the fundamental questions, such as what is the self what is truth what is the good life, are articulated differently depending on the circumstanceshistorical, cultural, institutionalin which they arise. Describe some of the key works of the Russian literary tradition, draw connections between their authors concerns and related formal choices, and consider the social and cultural circumstances in which these works were produced. Identify and describe how literary movements evolve in response to what came before them and how authors work within but also push the boundaries of given forms. Formulate an argumentative essay that advances an original interpretation wellsupported by textual evidence. Reflect on personal ways of answering the accursed questions of 19th century Russian authors.",
                                                    "key_topics":  "19th Russian literature and culture, theory of the novel, examines works by Pushkin, Lermontov, Dostoevsky, Tolstoy, and Chekhov, among others.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Class Participation, Close Reading Exercises, Midterm Exam, Literary Trial, Final Exam",
                                                    "relevance":  "DC GenEd: Contextual Thinking Relevant to the study of Russian literature, culture, and history, the history of the novel, and study of world literature.",
                                                    "learning_resources":  "Students need to purchase / borrow library copies of novels for the course, with other resources provided on Canvas.",
                                                    "extra_time_commitment":  null
                                            }
}