{
        "code":  "76-282",
        "name":  "Disability in Pop Culture",
        "short_name":  "DISABILITY POP CULT",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In 2016, ABC debuted the show Speechless, which follows the life of JJ, a high school teenager with cerebral palsy. In 2015, Deaf West Theatre premiered a revival production of Spring Awakening on Broadway, debuting a cast of both deaf and hearing actors who performed the show using American Sign Language and English simultaneously. In 2013, Allie Brosh released a book version of her blog titled Hyperbole and a Half Unfortunate Situations, Flawed Coping Mechanisms, Mayhem, and Other Things That Happeneda combination of web comics and stories that included discussions of depression. These examples are a mere few of more recent representations of disability in pop culture. In this course, we will investigate how representations of disability tell stories about difference. Using the tools of rhetorical analysis, we will ask the following questions How do memoirs, films, comics, health initiatives, advertisements, blogs, laws, and poetry use language and images to influence or construct our understanding of disability How do these representations engage differences of gender, race, class, and sexuality And finally, how does this work expand broader cultural, aesthetic, and political views of embodiment, disability, and difference This course has two major parts 1 We will examine various models of disability in order to theorize concepts such as normal, the gaze, passing, and access. In the process, we will consider how these concepts intersect with gender, race, class, and sexuality. 2 We will engage these theories through close reading of actual representations of disability that circulate in our worlds around us and shape our understandings of disability. We will pay particular attention to the rhetorical elements central to these representations such as purpose, genre, audience, context, form, and style.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the semester, we will 1Be familiar with key theories, concepts, or issues of disability within the field of disability studies.2Have developed skills for applying and analyzing these theories in everyday contexts.3Have increased skills for writing, interpretation, analysis, and argument.4Have strengthened our questionasking, discussionengagement, and presentation skills.",
                                                    "key_topics":  "disability, pop culture, rhetoric, norms",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "short papers, final presentation",
                                                    "relevance":  "Targeted to undergraduates",
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}