{
        "code":  "76-271",
        "name":  "Introduction to Professional and Technical Writing",
        "short_name":  "INTR PROF TECH WRIT",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [
                                            {
                                                    "code":  "76-270",
                                                    "id":  399,
                                                    "name":  "Writing for the Professions",
                                                    "units":  9.0
                                            }
                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Professional and technical communicators use words and images to connect people with information. With a strong foundation in rhetoric, this course will sharpen your abilities to communicate information clearly, effectively, and responsibly to real readers, stakeholders, and decision makers. Our assignments and conversations will include a wide range of genres and rhetorical situations you can expect to encounter as a professional and technical communicator, including job application genres, narrative genres like feature articles that blend subject matter interviews with keen observation, research genres like proposals, and team writing genres like technical documentation. A high level goal for the course is to combine theory, methods, and best practices for putting real readers and users of information at the center of our communication strategies. By the end of the course, you will have a portfolio of polished work that you can use to narrate your professional strengths and interests. This course is designed for undergraduates pursuing majors and minors in a writing and communication field, and who want to explore professional and technical communication as a discipline and career area.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Learn and apply methods of textual and rhetorical analysis to identify patterns in professional and technical writing genres, as well as describe the impact of those patterns on readers. Understand genres as documents shaped by discourse communities and historicalcultural contexts. Develop and apply an understanding of how a documents organization, labels, formatting, and overall design strategies contribute to its effectiveness. Develop and apply strategies for making complex information accessible to nonexpert audiences. Improve your writing and develop a polished and professional prose style that varies appropriately according to audience, purpose, and context. Draw on and apply research on how people read and use documents. Increase your skill in working and collaborating with other writers, clients, and subject matter experts SMEs. Develop a polished portfolio of professional work that demonstrates a situated knowledge of professional and technical communication as a discipline.",
                                                    "key_topics":  "Adapting writing for professional and technical communication genres.\n\nResearch on how readers read to inform how we write.\n\nBest practices for plain language writing.\n\nTeam writing and communication.\n\nStrategies for writing to non-expert audiences.",
                                                    "prerequisite_knowledge":  "No additional writing and communication coursework beyond the First-Year Writing pre-requisite is required.",
                                                    "assessment_structure":  "The course includes four written assignments (including one team project) and a final portfolio. The course also includes regular homeworks that scaffold students towards completion of major projects, and an expectation of regular attendance and participation.",
                                                    "relevance":  "76-271 is required for majors in Professional Writing and in Technical Writing \u0026 Communication, and fulfills a requirement for minors in these areas. All students interested in pursuing writing and communication as a field will benefit from the core vocabulary and practice of rhetorical analysis for professional communication genres, and the practice of writing and revising these genres for real readers.",
                                                    "learning_resources":  "All materials will be available to students via Canvas. No required textbooks for the course.",
                                                    "extra_time_commitment":  "Students will typically meet with the instructor outside of class during scheduled peer review or one-on-one review sessions to discuss drafts and progress towards major projects. Instructor works with students in advance to find agreeable times for these meetings."
                                            }
}