{
        "code":  "76-227",
        "name":  "Comedy",
        "short_name":  "COMEDY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "We cant, of course, expect to come up with an absolutely complete definition of the comic, but for our purposes we can consider it as an embodiment of the opposite of gravity. Comedy is characterized by its levity.  This does not mean, of course, that it is any less serious than tragedy, even ifor especiallybecause it tends to favor the superficial over the profound. Indeed, if tragedy is adolescent, then the mature, adult mode is the comic, being more social and rational. A key characteristic of comedy is witor simply intelligence. Comedy involves a lot of pure play of the mind.  It turns out that there have been a few notable attempts to help us understand just why comedy is the social genre beyond all others, why the comic attitude is the civilized, urbane, mature view of life. And well consider some of those theories while trying to understand why some things are comic and some are not. Well consider several classical works of comic literature, beginning with Aristophanes, Shakespeare, and moving on to more recent examples, including some films.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}