{
        "code":  "76-211",
        "name":  "Model Minorities?: Introduction to Asian American Studies",
        "short_name":  "MODEL MINORITIES?",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Asian American is a selfconscious political identity developed by panAsian ethnic groups in solidarity with one another in 1968. What does it mean now, 55 years later, to be Asian American How is Asian Americanness defined through and against dominant racial, social, cultural, and political meanings How do Asian Americans fit into the differentially racialized landscape of the U.S., and how, in turn, are Asian American identities and experiences shaped and expressed How does the political and activist history of Asian America inform Asian Americanness, and social movements in general, today Is the label of Asian American a drawback or a resource To grapple with these questions, this course brings together Asian American studies, ethnic studies, and Asian American rhetoric to examine the currents of global and domestic power that have shaped Asian American experience, the movements and communities that have acted in solidarity among and against those forces, and the communicative practices that both shape and are shaped by Asian Americans.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Identify and discuss some of the key concepts and issues in Asian American Studies, including the history of the discipline and of Ethnic Studies as a larger field. Identify and discuss everyday narratives that contribute to racialized power inequalities. Analyze the content and authority of these narratives through a critical ethnic studies lens. Discuss how Asian American and minority activists and organizers have contributed to political, social, and cultural change. Identify where you can make a difference in your own communities. Consider the value of Asian American as a label, historically and in the current moment. Produce a final paper or project analyzing a topic, issue, policy, movement, or historicalcultural artifact that speaks to, or illustrates a new nuance about, Asian America",
                                                    "key_topics":  "Asian American studies, ethnic studies, Asian American rhetoric",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Reading responses, short papers, final paper, participation, and a presentation",
                                                    "relevance":  "This course will introduce students to the field of Asian American studies, and will be relevant to any student interested in Asian American history, politics, identity, activism, power/inequality, and community, as well as issues and concerns in the broader field of ethnic studies more generally.",
                                                    "learning_resources":  "All readings and materials will be available on Canvas",
                                                    "extra_time_commitment":  "A short Community Engagement paper will require students to either conduct an oral history, or explore a community group, venue, or event."
                                            }
}