{
        "code":  "76-221",
        "name":  "Books You Should Have Read By Now",
        "short_name":  "BOOKS READ BY NOW",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Topics vary by semester and section. F25 The Essential Horror This class familiarizes students with notable literary texts and prominent works of the horror genre and addresses analytical and creative aspects of it this class also provides opportunities for students to conduct scholarly research and connect fictional texts to abstract discussions surrounding culture and society.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Varies by semester. F25 Text familiarization within the horror genre, demonstration of key aspects of the horror genre in analytical and creative forms, development of thoughtful and evidencebased interpretations of the course texts, the conducting of scholarly research and incorporate secondary texts into papers, writing analytical readings using the course texts and secondary works, and developing connections between course texts and abstract discussions surrounding culture and society",
                                                    "key_topics":  "Varies by semester. F25: horror, gothic, genre, novels, short stories, experimental fiction, narrative, popular texts",
                                                    "prerequisite_knowledge":  "Varies by semester. F25: none",
                                                    "assessment_structure":  "Varies by semester. F25: Major Papers: midterm paper, final paper, and short creative project. Minor Writing Assignments: Weekly discussion board posts. Presentation: short presentations of analytical and creative works.",
                                                    "relevance":  "Varies by semester. F25: This course targets majors and non-majors who are interested in learning more about horror as a topic of popular media and students who want to examine different narrative approaches to this well-known genre.",
                                                    "learning_resources":  "Varies by semester. F25: Canvas page containing student-facing documents (syllabus, assignment pages, etc.), short story selections, and theoretical texts. Pre-1900s novels available through Hunt digital collections. Students must purchase post-1900s novels (2), graphic novel (1), and novella (1).",
                                                    "extra_time_commitment":  "Varies by semester. F25: Nothing other than completion of homework assignments."
                                            }
}