{
        "code":  "76-287",
        "name":  "Sex \u0026 Texts",
        "short_name":  "SEX \u0026 TEXTS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Please see Content Warning Below In this course, we will consider how writing and communication serve as means to create, define, and bound our worlds, shaping our ideas about sex and sexuality at their intersections with gender, disability, race, geographic location, religion, age, and so on. Using a rhetorical perspective, we will interrogate how everyday experiences with and performances of sex and sexuality are tied to legal, medical, corporate, cultural, and historical practices and ideologies. Readings will consist of public, scholarly, and creative genres such as Roxane Gays Unruly Bodies, Judith Butlers Gender Trouble, Cardi Bs WAP feat. Megan Thee Stallion, and the Hulu series Shrill and will address topics including but not limited to bathroom bills, rape culture, the beauty industry, intellectual property, citizenship, and marriage equality. Students in this course will 1 develop a vocabulary for talking about sex and sexuality 2 examine how sex and sexuality are shaped by public, historical, and cultural norms and 3 practice analyzing rhetorical elements such as purpose, genre, audience, context, form, and style. Student projects will include weekly discussion posts, two shorter papers, and one creative project. This course meets the Dietrich College Communicating Gen Ed requirement. Content Warning Because this course takes up questions of sex and sexuality, we will discuss the bodyembodiment and issues related to violence sexual, racial, intellectual, domestic, linguistic, etc.. While projects will ask students to examine questions of sex and sexuality, students will not be required to write about issues related to violence.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students in this course will 1 develop a vocabulary for talking about sex and sexuality 2 examine how sex and sexuality are shaped by public, historical, and cultural norms and 3 practice analyzing rhetorical elements such as purpose, genre, audience, context, form, and style.",
                                                    "key_topics":  "Gender, sexuality, race, rhetoric, art, argument",
                                                    "prerequisite_knowledge":  "No prior knowledge necessary",
                                                    "assessment_structure":  "Two short papers, weekly Canvas Posts, Class discussion, and a final creative project",
                                                    "relevance":  "This course is a 200 level, intended to draw new students to the major and offer a gender studies course",
                                                    "learning_resources":  "Students will read a variety of creative, scholarly, and public texts in a variety of modes and genres.",
                                                    "extra_time_commitment":  null
                                            }
}