{
        "code":  "76-251",
        "name":  "Exploring Creative Writing in Community",
        "short_name":  "EXPLR CRTV WRT CMTY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course, taught in Somerset Prison, will be focused on the ways generative writing can deepen empathy for self and others, while expanding imagination. We will read stories, poems, novels, and creative nonfiction for inspiration, and students will create their own work often using the readings as models. In class, prompts will be offered for more writing, and students will share their work. The class is based on understanding that Creative Writing has the power to reshape how we see our past, present, and future. Just as importantly, through creative work we can reshape our ideas about ourselveswho we are, and who we are becoming, in the world. A good class for those interested in the intersection between justice and education. Half of the class will be composed of incarcerated people, and the other half will be Carnegie Mellon students. All Carnegie Mellon students with interest in writing are welcome. Please fill out the form in the course URL.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://docs.google.com/forms/d/e/1FAIpQLSfedNUdgWSUcE7hjqlBqayl8VnpaakxFOHauRzp4Ogl4Et-mw/viewform?",
        "custom_fields":  {
                                                    "goals":  "To offer students experience in creative writing while increasing their ability to articulate their understanding of a variety of texts. Also to give students an opportunity to widen their perspective on the world, on social justice, on what it means to be imprisoned.",
                                                    "key_topics":  "This class invites students to write creatively, and to read fiction, poetry, and non-fiction that can inspire creative thinking. Each class will have a generative aspect, where students write to prompts, along with a conducted discussion about the readings.",
                                                    "prerequisite_knowledge":  "Students should have an interest in writing. Students should also have an interest in the intersection between education and the prison industrial complex.",
                                                    "assessment_structure":  "The grade will be based on students\u0027 written work and quality of class participation.",
                                                    "relevance":  "Everyone¿whether CMU students or incarcerated people--- will benefit from learning the art and craft behind what makes narrative, and other modes of self-expression, powerful. How can we take the stories of our lives and make them understood by a wider audience? All students will also be reading texts about contemporary lives and implicitly or explicitly political issues.",
                                                    "learning_resources":  "This is low tech. Incarcerated people have no access to such things, and neither will CMU students, though of course I will communicate with CMU students via Canvas.",
                                                    "extra_time_commitment":  "Students will leave campus each Friday by bus at 12:30 p.m. and will return to campus by 6:30 p.m."
                                            }
}