{
        "code":  "76-291",
        "name":  "Getting Heard/Making a Difference",
        "short_name":  "GET HEARD MAKE DIFF",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "How can a college student get people to pay attention to a problem, whether it is a personal, social, environmental, ethical, or public issue  In particular, how do people who dont already have what is called standingsuch as the authority or credentials to speakget their community to listen  In this course you will learn how to create real dialogue and carry out effective not simply adversarial engagement within a university and later in your professional lives. It introduces you to the rhetorical art of savvy, issuecentered social engagement.  Drawing on research, theory, and our own campus investigation, we will try out methods for collecting competing perspectives, for framing a shared actionable problem, and for creating wellsupported, persuasive and motivating accounts in proposals, reports, editorials, stories, or media.  The theory and strategies we study are designed to create what is called a rhetorical presence for your ideas, to put them into circulation, and help create a more engaged local public. This course meets the Dietrich College Communicating Gen Ed requirement.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will have\nbuilt a set of problemsolving strategies for raising and framing personal, group, and public issues\nlearned a set of rhetorical tools for being heard and\npracticed the skills of adaptive leadership that draws people into generative dialogues across difference",
                                                    "key_topics":  "Having a voice with peers, in teams, or in public\n\nFacing some barriers to being heard\n\nAnalyzing the problem underlying an issue of concern\n\nRe-framing an issue as a shared problem\n\nCreating meaningful dialogue across difference\n\nBuilding networks of support\n\nPutting ideas in circulation with persuasive texts, media, video\n\nMastering adaptive leadership",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Brief discovery memos, a paper, and a project.",
                                                    "relevance":  "Offers a foundation analyzing shared problems, effective communication with others for change, and tools both for realizing your own potential and for leadership.",
                                                    "learning_resources":  "Texts, Guides to conducting decision dialogues, collaborative planning, and interviewing, and Films.",
                                                    "extra_time_commitment":  "Conducting some interviews."
                                            }
}