{
        "code":  "76-231",
        "name":  "Rhetoric, Language, \u0026 Culture",
        "short_name":  "RHET, LANG, \u0026 CULT",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Topics vary by semester. Spring 2023 Where are you really from Asian American Racism, Activism, and Identity. See Course URL for full descripition.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://docs.google.com/document/d/1AGv7Ix7ovF0FSaJw8-Sx5ekefMYdNPkr5qv0GniJjEg/edit?usp=sharing",
        "custom_fields":  {
                                                    "goals":  "S23 By the end of the course, you will be able to Identify key themes and tensions in scholarly and popular conversations about Asian American experiences and identities Articulate how intersecting social forces shape issues, challenges, and possibilities facing Asian American individuals and communities and your own lived experience Critically and responsibly analyze, question, and communicate in the realms of academic reading, writing, and speaking",
                                                    "key_topics":  "S23: Asian American and Pacific Islander constructs of race and ethnicity; historical and present instances of racism and activism; mainstream representations of identities and communities versus realities; how language, power, and ideology shape lived experiences",
                                                    "prerequisite_knowledge":  "no prior knowledge necessary",
                                                    "assessment_structure":  "S23: attendance participation and engagement (including labor self-assessment); lower stakes assignments (i.e., weekly reading responses); final project and proposal",
                                                    "relevance":  "S23: This introductory class offers a space for undergraduate students of all racial and disciplinary backgrounds to better understand the diverse social, cultural, and political experiences of Asian Americans and Pacific Islanders in the contemporary United States. You will leave this class with an awareness of the key debates, conversations, challenges, and potentialities of studying, portraying, and living as Asian American. You will also leave with a keener awareness of the social factors that shape your own reality, an awareness that can translate to your personal, academic, and professional decision-making.",
                                                    "learning_resources":  "S23: all readings or online material will be available in Canvas",
                                                    "extra_time_commitment":  "S23: time needed to complete assigned homework (readings and assignments)"
                                            }
}