{
        "code":  "76-247",
        "name":  "Shakespeare: Comedies and Romances",
        "short_name":  "SHAKESPEARE COM\u0026ROM",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Sometime around the late sixteenth century, enterprising cultural producers in early modern London began to develop a new commercial venture called playing a business that offered ordinary people a few hours of dramatic entertainment for the price of one penny. In addition to watching the professional players onstage, spectators also participated in a form of play themselves, in a sense, because theatrical experience provided a unique opportunity to engage imaginatively with otherwise inaccessible people, worlds, and ideas. More than four hundred years later, the drama of the period now ranks among the most esteemed texts in all English literature, and the name Shakespeare has become a byword for literary genius. This course will offer a selection of Shakespeares delightfuland sometimes surprisingly edgycomedies and late romances. As we read through these works, we will endeavor to understand what, and how, they meant in their original context, thereby developing a historically informed perspective on their influence over our own cultural landscape.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1 To consider the cultural legacy of early modernity through the lens of Shakespearean drama.\n2 To engage questions of meaning and interpretation that typically attend to performancebased artworks.\n3 To hone key skills pertaining to humanities scholarship research, critical writing, appraisal, argumentation, discussion, presentation.",
                                                    "key_topics":  "Shakespeare, drama, performance, early modern literature",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "informal online writing assignments, two formal essays, classroom discussion \u0026 participation, class presentations",
                                                    "relevance":  "There isn\u0027t really a targeted group here. The course is for anyone and everyone.",
                                                    "learning_resources":  "Canvas, Zoom, streaming video via drama online",
                                                    "extra_time_commitment":  null
                                            }
}