{
        "code":  "76-264",
        "name":  "Special Topics in Writing \u0026 Communication:The Art of Time in Nonfiction",
        "short_name":  "SPCL TPCS IN  WR",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Without the passage of time, there is no story. But there are many ways to organize, steer, and structure time in all our written communication, from creative writing to personal statements, research statements, and job applications. How do you write an essay that covers one hour One day Twenty years How do you handle flashbacks, or multiple timelines During this course, you will learn many of the ways that a writer can conceptualize the time frame of a story, manage time, or even slow or speed up time to suit the story you want to tell. Writing prompts, readings, and discussion will help you become more skilled in using time and structure.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Acquire a vocabulary for discussing structure and time in narrative, explore models that employ a wide range of structures and chronologies, and draft new writing that employs these skills",
                                                    "key_topics":  "Understanding storytelling principles. Communicating information using time as an organizing factor.",
                                                    "prerequisite_knowledge":  "No prerequisite required",
                                                    "assessment_structure":  "Course projects include written assignments. The course also includes regular homeworks that scaffold students towards completion of major projects, and an expectation of regular attendance and participation.",
                                                    "relevance":  "This course is relevant for creative writers, those interested in nonfiction writing, or anyone that might need to convey information in a narrative format.",
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  "Students may be asked to meet outside of class to engage in project peer reviews and/or one-one-one meetings with the instructor as part of project scaffolding and revision."
                                            }
}