{
        "code":  "76-212",
        "name":  "Utopias from Plato to Science Fiction",
        "short_name":  "UTOPIAS PLTO SCIFI",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Utopian fiction has a long history, starting well before Thomas More gave the title Utopia to his description of an ideal society early in the 16th century.  It investigates how human societies can be organized to make the best use of natural and human resources to create economic and social justice and promote human happiness. The course will start with Plato\u0027s Republic, More\u0027s Utopia, and Bacon\u0027s New Atlantis, go on to texts like Edward Bellamy\u0027s Looking Backward and H. G. Wells\u0027s Time Machine, and then to George Orwell\u0027s 1984, Le Guin\u0027s The Dispossessed, and Russell Hoban\u0027s Riddley Walker--note the slide toward dystopias. A good deal of the term will focus on speculative fiction (aka sci fi) in the form of films as well as printed fiction, for which students can make recommendations (but Blade Runner is in for sure).  You will be expected to attend regularly with something to say about the assigned materials, write coherently about our texts (various exercises and two prepared papers), and present a \"position paper\" to the class. The course encourages a lot of imaginative play, but it also confronts serious on-going problems.",
        "student_sets":  [

                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}