{
        "code":  "76-280",
        "name":  "Gender and Sexuality in Performance",
        "short_name":  "GNDR SXULTY PRFRMNCE",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Performance describes a wide range of practices, from the everyday to the artistic. Gender and sexuality are key elements in everyday, political, and artistic performances, from the very personalhow you order a latte at Tassa DOro, tell a lover goodbye at the airport or comfort a crying childto the very publicperforming a Bach cello suite or an iconic King Lear, staging a demonstration against police violence or marketing a new app.  This course will bring performance and theory into a practical partnership to create and critique social and individual narratives.  We will also take an intersectional approach to gender and sexuality, mindfully mapping these performances in relation to race, class, and ability.    We raise questions such as, How does everyday performance define gender and sexual identity How do gender and sexuality define everyday performance  How does aesthetic performanceart, theater, film, digital media, poetryintervene in the ways in which gender and sexuality are performed  Readings in theory at the intersection between gender studies, queer theory, intersectional feminism, and performance studies will help us explore these questions. We will also consider a variety of cultural and artistic practices.   Since this class will be in a remote format, we will focus on performances that are digitally accessible, both for the performances that we study and those we create for the class.    This course counts towards the Gender Studies Minor.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  "Gender\n\nSexuality\n\nQueer Theory\n\nIntersectionality\n\nPerformance\n\nPerformance Art",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "assignments, presentations, projects, performances",
                                                    "relevance":  "Familiarity with the theory and practice of gendered and sexualized performance is most obviously useful to students of gender studies, but it also pertains to any creative or critical discipline that demands understanding what performance means aesthetically and in everyday life, as well as the role that gender and sexuality play in both kinds of performances.",
                                                    "learning_resources":  "web pages, videos, print texts",
                                                    "extra_time_commitment":  "A small amount of time spent doing informal observations outside of class, as well as time to complete written assignments and prepare oral presentations."
                                            }
}