{
        "code":  "76-295",
        "name":  "Russian Cinema: From the Bolshevik Revolution to Putin\u0027s Russia",
        "short_name":  "RSSN CNMA BLSK PTN",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Last night I was in the kingdom of shadows, said the writer Maxim Gorky in 1896 after seeing a film for the first time. How terrifying to be there Early film inspired fear and fascination in its Russian audiences, and before long became a medium of bold aesthetic and philosophical experimentation. This seminarstyle course surveys the development of Russian and Soviet film, paying equal attention to the formal evolution of the medium and the circumstanceshistorical, cultural, institutionalthat shaped it. We will examine Sergei Eisensteins and Dziga Vertovs experiments with montage in light of the events of the Bolshevik Revolution and the directors engagement with Marxism Georgi Alexandrovs and the Vasiliev brothers Socialist Realist production against the backdrop of Stalinist censorship Andrei Tarkovskys and Kira Muratovas Thawera films within the broader context of New Wave Cinema and the works of contemporary directors, including Aleksei Balabanov, Alexander Sokurov, and Andrey Zvyagintsev, in connection with the shifting social and political landscape of postSoviet Russia. Besides introducing students to the Russian and Soviet cinematic tradition, this course will hone their skills in close visual analysis. No prior knowledge of Russian language or culture is required. The course is conducted in English, but students will have the option to do work in Russian for three extra course units.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "to explain a special social function of cinema in the postrevolutionary, Stalinist, postStalinist and in the modern Russian society to analyze cultural and aesthetic aspects of Russian film industry in its historical development to show interconnections between Russian politics and cinema.",
                                                    "key_topics":  "Revolutionary Film Culture: From Boulevard to Avant-Garde - Masterpieces of Silent Screen - Creating of the \"Homo Sovieticus\": How did Stalin Entertain Soviet People - Soviet Cinema After Stalin: New Hopes and New Disillusions - Modern Russian Cinema: From Gorbachev\u0027s Perestroika to Putin\u0027s Russia",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Attendance and class participation: 20%; Two book reports (1400 words each): 50% (25% for each); Journal with analyzes of each film viewed in class: 30%.",
                                                    "relevance":  null,
                                                    "learning_resources":  "1. Soviet/Russian Films 2. Birgit Beumers. A History of Russian Cinema 3. Nancy Condee. The Imperial Trace: Recent Russian Cinema",
                                                    "extra_time_commitment":  null
                                            }
}