{
        "code":  "76-243",
        "name":  "Introduction to Television",
        "short_name":  "INTRO TO TV",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Television is a ubiquitous vehicle of mass culture that cannot be casually dismissed or uncritically celebrated. This course approaches television as an industry, a global mass medium, and a site of social and political discourse. It will provide an overview of various critical frameworks for understanding television. It will contextualize the ways that television affects and mediates configurations of class, race, gender, and sexuality. We will also reflect on our viewing practices from contemplation to bingewatching and guilty pleasures. To do this, the course will engage with a wide variety of popular American TV genres and formats, including sitcoms, reality TV, dramas, and news and talk shows. It will also provide a historical overview of the medium. The course will conclude with the rise of digital streaming platforms and examine how they have impacted network television.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The course will provide students with an expansive understanding of the key issues and concepts of television studies. It will expand upon students ability to critique and engage with individual shows and query their relationship to culture and society. Students will be able to present their ideas in the form of scholarly argument both oral and written.",
                                                    "key_topics":  "Television studies, Media studies, Gender, Consumerism",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "short response papers, presentation, in-class quizzes",
                                                    "relevance":  "The course will provide a historical overview of the televisual medium - from its advent, its ever growing popularity, to the age of digital streaming services.It will help students understand the power of representation in shaping our world and worldview. It will help students understand the sociological and political functions of TV in our everyday life.",
                                                    "learning_resources":  "tv shows, essays, articles, book chapters",
                                                    "extra_time_commitment":  null
                                            }
}