{
        "code":  "76-229",
        "name":  "Special Topics in Creative Writing",
        "short_name":  "SP TPCS CRTV WRTN",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Topics vary by semester. Summer 2024 The value of original ideas and unique voices is never more revered than in speculative literature. The course goal is to create three publishable pieces short stories in science fiction and fantasy, and a speculative horror flash piece.     This writingintensive workshop course will equip students with the tools to write imaginative and engaging prose across three major speculative fiction subgenres with a focus on core elements like the novum the central speculative element. Students will gain a critical understanding of the genres conventions and tropes while developing their unique narrative approach.  Through lectures, discussions, and critiquing workshops, we will examine core elements        Constructing believable and immersive social, political and technological systems in science fiction.        Designing magic systems and exploring their limitations and consequences in fantasy.        Crafting effective speculative horror through atmosphere, psychological tension and the exploration of the uncanny valley.        Developing sympathetic characters who navigate the challenges and opportunities presented by scientific, fantastical or horrifying elements of the story.        Highlighting suspense, conflict and resolution techniques to tune the plot.     The course will culminate in a public reading of students work.  Open to faculty and staff, as well as students who are not creative writing majors.    No prerequisites.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The course goal is to create three publishable pieces short stories in science fiction and fantasy, and a speculative horror flash piece. This writingintensive workshop course will equip students with the tools to write imaginative and engaging prose across three major speculative fiction subgenres with a focus on core elements like the novum the central speculative element. Students will gain a critical understanding of the genres conventions and tropes while developing their unique narrative approach.\nConstructing believable and immersive social, political and technological systems in science fiction.\nDesigning magic systems and exploring their limitations and consequences in fantasy.\nCrafting effective speculative horror through atmosphere, psychological tension and the exploration of the uncanny valley.\nDeveloping sympathetic characters who navigate the challenges and opportunities presented by scientific, fantastical or horrifying elements of the story.\nHighlighting suspense, conflict and resolution techniques to tune the plot.",
                                                    "key_topics":  "science fiction, fantasy, horror",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "lectures, discussions, and critiquing workshops",
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}