{
        "code":  "76-334",
        "name":  "Literature of Wall Street",
        "short_name":  "19TH CNTRY AMERICAN",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "It started with a financial panic that closed the New York Stock Exchange for ten days. One quarter of the nations transportation companies went bankrupt, as did nearly 20,000 businesses. Unemployment reached 14. Four years later it was officially declared a depression. When did all of this happen Was it 2009 Or the 1930s No, it was the depression triggered by the financial panic of 1873. Out of this period, also known as the Gilded Age, came a unique strain of American literature. Frank Norriss grisly tale of an overbearing dentist and his miserly wife, McTeague, Andrew Carnegies autobiography, Upton Sinclairs iconic The Jungle, Edith Whartons tragic love story House of Mirth, Charlotte Perkins Gilmans feminist utopian novel, Herland, William Dean Howells capitalist satire, The Rise of Silas Lapham, Theodor Driesers mournful Sister Carrieall of these writings react to, and try to shape, the economy of a century ago. These novels, which were often critical of corporate capitalism, give us a rich and detailed picture of the last time in the US that Americans suffered under the kind of gap we have today between rich and poor. In the US today the top 1 controls 42 of the countrys wealth, while the bottom 80 controls a mere 7 of the countrys wealth. What can we learn about the present by reading the fictions of financial crisis and inequality in the past",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}