{
        "code":  "76-395",
        "name":  "Science Writing",
        "short_name":  "SCIENCE WRITING",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "((76-102 [] at least D) or (76-101 [] at least D) or (76-106 [] at least D) or (76-107 [] at least D) or (76-108 [] at least D)) and ((76-372 [] at least D) or (76-270 [] at least D) or (76-271 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Youll learn how to write clear, wellorganized, compelling articles about science, technology and health topics for a general audience. Youll learn how to carry out research on scientific topics using primary and secondary sources, how to conduct interviews, and how to organize that information in a logical fashion for presentation. For writing majors, the course will increase their understanding of scientific research and how to describe it accurately and in a compelling manner to a general audience. For science majors, this course will teach them how to craft fluid, powerful prose so that they can bring their disciplines to life. The course is not intended just for those who want to become science writers, but for anyone who may have the need to explain science, medicine, or technology to a general audience, whether it is an engineer describing a green building project at a public hearing or a computer programmer describing new software to a firms marketing staff. Scientists and educators today are increasingly concerned about the publics lack of understanding about scientific principles and practices, and this course is one step toward remedying that deficit. You will get a chance to read several examples of highquality science writing and interview researchers, but the primary emphasis will be on writing a series of articles, and rewriting them after theyve been edited. Your assignments will range from profiles of scientists to explanations of how something works. In particular, this years class will focus on how science and society interact, whether that means the way that science writers write about public health, technology, infectious disease or climate change. The class will be run partly as a writing workshop where students will be organized in teams where they will discuss ideas, as well as edit and critique each others work in class, in a process similar to what journalists routinely go through.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end, you not only should know how to identify worthy studies and do research on science topics, but you should have a good idea of how to organize that information and write and talk about it in an engaging, creative way.",
                                                    "key_topics":  "This course will teach the principles of good science writing for a general audience. It will expose you to examples of superb science writing in various publications and will include at least one writing assignment and several smaller writing exercises.",
                                                    "prerequisite_knowledge":  "It helps if you\u0027ve had some writing classes, but it\u0027s not essential. Students with science or writing experience will benefit from that expertise, but this course is designed to teach science majors to write better and writers to learn how to research and write about science. The assignments can accommodate different levels of writing experience.",
                                                    "assessment_structure":  "Writing assignments are the core of the course. They will get detailed editing from me, as well as some editing by other students. Grades will apply only to the rewrites of initial drafts. You will be graded mostly on how well you improve throughout the course.",
                                                    "relevance":  "This course will help writing majors learn to write about scientific and technical topics. It will help science majors communicate their ideas and research results clearly to a broad audience.",
                                                    "learning_resources":  "The primary learning materials will be a series of articles of various types and guidelines from the professor on how to construct good beginnings and endings and organize articles in a modular way. Students will also be trained in good interviewing techniques and in how to translate jargon into accessible language.",
                                                    "extra_time_commitment":  "Yes, students will need time each week -- a couple hours or so on average -- to carry out research and writing assignments and do the readings. All students will be asked to give a 20-minute oral presentation at some point throughout the semester about a science platform (podcast or videocast, radio show, TV show, or science-related magazine, etc. etc.) that they follow or admire, what audience it is focused on and (subjectively on your part) how well it accomplishes its goals. A final article -- which will involve several drafts,, peer review and mentoring -- will constitute 40% of the overall grade.."
                                            }
}