{
        "code":  "76-379",
        "name":  "Communicating in the Global Marketplace II",
        "short_name":  "COMM GLOBL MKPLC II",
        "units":  4.5,
        "min_units":  4.5,
        "max_units":  4.5,
        "prereqs":  {
                                        "text":  "(76-330 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In this day and age, some of the most exciting employment opportunities are with multinational and international corporations and nonprofits. But are you prepared for the challenge of working with professionals from all over the world Even as more people around the globe learn English, specific cultural values, beliefs, and assumptions continue to influence the way in which they communicate. Often, behind a foreign accent, we encounter an entirely different worldview. The same word or phrase in English might actually carry very distinct connotations for someone whose native language is French, German, Russian, or Japanese. Can we learn to anticipate, understand, and become sensitive to these connotations How can we mend potential miscommunications that might arise due to these conceptual differences   This course is designed as an introduction to international professional communication. We will talk about the way in which culture influences communication, about the job of translators and interpreters, and about specific communicative norms for the global marketplace. We will look at many concrete example of communication in the international arena, acting as problem solvers and communication consultants who are focused on understanding and designing plans of action for navigating communicative obstacles. We will also have the opportunity to speak with professionals who are experienced in the field, and we will cover case studies ranging from corporate business to global activism and advocacy.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}