{
        "code":  "76-352",
        "name":  "Music, Technology, and Culture",
        "short_name":  "MUSIC TECH \u0026 CULT",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Music has been a part of our individual and communal lives for 40,000 years. We developed the technology to record and playback music for about 140years ago. In this seminar we will study the relationship of music, technology and culture from a variety of disciplinary approaches including science and technology studies, musicology and ethnomusicology, neuroscience, sound studies, Black studies, political economy, cultural studies and media archeology. The course will focus on the impact mediating technologies like vinyl, cassette tapes, mp3s, film and television, the development of music journalism and of course live human performance have had on our social, political and personal interactions with music. We have built the course around case studies that illustrate the intersection of music, technology and culture such as audio analgesia devices, movie soundtracks, streaming services, the rise of internet listicles and other crucial moments in twentieth and twentyfirst century musical culture. Students in this course will develop critical projects that cross technological, humanistic, and musical boundaries. We hope that students come away from this class with better a host of critical tools to better think about what music means to us and how mediating technologies redefine these meanings.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "An introduction to the theories and debates associated within a spectrum of humanities based fields including science and technology studies, media studies, critical race studies, musicology and ethnomusicology, neuroscience, media archeology and sound studies. Create a relationship between humanities research methods and concepts and popular rhetorics surrounding music\nApply critical theories to your respective fields of study and intellectual interests. Strengthen your ability to read and comprehend complex theoretical concepts. Participate in productive discussions of music. This includes careful listening to others and contributing ideas that enrich and develop our ideas about the texts we are reading. Write short notes, comments, and questions on readings that will aid in developing your own comprehension of the field and further class discussion of the readings.\nDevelop a final project based on original research.",
                                                    "key_topics":  "science and technology studies, musicology and ethnomusicology, neuroscience, critical race and ethnicity studies, political economy, cultural studies and media archeology.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "presentations, short writing assignments, final paper",
                                                    "relevance":  null,
                                                    "learning_resources":  "websites, texts, case studies",
                                                    "extra_time_commitment":  null
                                            }
}