{
        "code":  "76-380",
        "name":  "Methods in Humanities Analytics",
        "short_name":  "MTHDS HUMAN ANALYTIC",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The computeraided analysis of text has become increasingly important to a variety of fields and the humanities is no exception, whether in the form of corpus linguistics, stylometrics, distant reading, or the digital humanities. In this course, we will build a methodological toolkit for computeraided textual analysis. That toolkit will include methods for the collection data, its processing via offtheshelf software and some simple code, as well as its analysis using a variety of statistical techniques. In doing so, the class offers students in the humanities the opportunity to put their expertise in qualitative analysis into conversation with more quantitative approaches, and those from more technicallyoriented fields the opportunity to gain experience with the possibilities and pitfalls of working with language. The first part of the term will be devoted to introducing fundamental concepts and taking a birds eye view of their potential application in domains like academic writing, technical communication, and social media. From there, students will initiate projects of their own choosing and develop them over the course of the semester. The goal is to acquaint students with the strengths and limitations of computeraided textual analysis and to provide them with the necessary foundational skills to design projects, to apply appropriate quantitative methods, and to report their results clearly and ethically to a variety of audiences. This class requires neither an advanced knowledge of statistics nor any previous coding experience, just a curiosity about language and the ways in which identifying patterns in language can help us solve problems and understand our world.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "assignments, project",
                                                    "relevance":  null,
                                                    "learning_resources":  "web pages, course-specific textbook, custom designed code, case studies, weekly support meetings for project development",
                                                    "extra_time_commitment":  null
                                            }
}