{
        "code":  "76-391",
        "name":  "Document \u0026 Information Design",
        "short_name":  "DOC \u0026 INFO DESIGN",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-270 [] at least D) or (76-271 [] at least D) or (76-390 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course provides students who have already learned the foundation of written communication with an opportunity to develop the ability to analyze and create visualverbal synergy in printed documents. Students will be introduced to the basic concepts and vocabulary, as well as the practical issues of visual communication design through a series of handson projects in various rhetorical situations. Assigned readings will complement the projects in exploring document design from historical, theoretical, and technological perspectives. Class discussions and critiquing are an essential part of this course. Adobe InDesign, Photoshop, and Illustrator will be taught in class, and used to create the assigned projects.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students are able to solve simple visualverbal design problems, and implement the solution. Students are able to work effectively with visual designers.",
                                                    "key_topics":  "Document Design, Information Design, Visual Communication Design Layout",
                                                    "prerequisite_knowledge":  "Basic understanding of professional writing (i.e., 76270, 76271 or Style )",
                                                    "assessment_structure":  "6 hands-on document design assignments (incl. 1 or 2 drafts). Desk critiquing (individual critiquing during work sessions). Class critiquing/presentation; Peer critiquing in groups.",
                                                    "relevance":  "This course provides students who have already learned the foundation of written communication with an opportunity to develop the ability to analyze and create visual-verbal synergy in printed documents.",
                                                    "learning_resources":  "Some Readings",
                                                    "extra_time_commitment":  "Students are expected to spend about 6 hours per week on homework assignments."
                                            }
}