{
        "code":  "76-354",
        "name":  "Watchdog Journalism",
        "short_name":  "WATCHDOG JOURNALISM",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The practice of journalism involves covering the news of the day. Investigative journalism uncovers it, digging through public records and data to expose corruption or correct social injustices. The process takes patience and persistence, as well as familiarity with righttoknow laws, to find that gold nugget of information that exposes secrets or becomes the missing piece to a larger puzzle. In this course, students will learn investigative techniques that make the powerful accountable, using government documents, financial filings and databases to spot undetected crime patterns, an unfair housing policy or perhaps questionable spending by a nonprofit charity. Investigative journalism has a storied history of exposing wrongdoing and today many of the tools historically used to tell those stories are available to everyone. This course will help budding journalists, researchers and anyone else interested in addressing societal problems find those tools and learn how to use them. This course meets the Dietrich College Deciding Gen Ed requirement.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "This course will provide the map and tools for students to investigate nonprofit organizations, political campaign contributions, publiclytraded companies and a social justice issue of their choosing.",
                                                    "key_topics":  "Watchdog journalism refers to journalism that uses documents, data sets and other resources to be a watchdog for the public\u0027s interests, explaining the complex, exposing the corrupt and addressing social injustices.",
                                                    "prerequisite_knowledge":  "Students from all backgrounds are welcome as they bring their own expertise and interests to the discussion.",
                                                    "assessment_structure":  "Assessments will be based on a memo and final report in each of the four areas covered: non-profit organizations, political campaign financing, publicly-traded companies and a social justice issue of the student\u0027s choosing.",
                                                    "relevance":  "Course should be relevant to those interested in looking behind the day\u0027s headlines to find out what\u0027s really happening in the various institutions and regulatory agencies that both govern and protect us.",
                                                    "learning_resources":  "A copy of the course text will be on reserve at Hunt Library.",
                                                    "extra_time_commitment":  "Class will provide a map and the tools for investigating nonprofit organizations, political campaign finances and publicly-traded companies and students are expected to use those tools to do their own investigative research."
                                            }
}