{
        "code":  "76-342",
        "name":  "Love: A Cultural History",
        "short_name":  "LOVE: CULT HISTORY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This is a course about the cultural history of love. We will focus on romantic love, with an emphasis on how ideas about love have been a dynamic part of our social, political and economic world. Some of the questions to be addressed include How, historically, did the idea of love become coupled with freedom How did romantic love come to be considered the epitome of selffulfillment and what are the problems with that idea How has the idea of romantic love been mobilized on behalf of things like the state, the nation, capitalism or revolution How do types of love function as a measure of belonging or deviance How does the discourse of love enter different kinds of institutional arrangements, such as marriage or state citizenship As a way to explore these questions, this course looks primarily to literature, including fiction, poetry, and drama, but also to philosophy, history, anthropology, sociology and law. Students will immerse themselves in an interdisciplinary range of material as they read, discuss and write about these representations. We will roam through cultural theory of affect, psychoanalytic notions of love, historical constructions of marriage, and feminist discussions of love and sexuality. Possible texts include works by William Shakespeare, Jane Austen, Toni Morrison, Arundhati Roy and Ocean Vuong.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "critical thinking skills, interpretation, reading skills",
                                                    "key_topics":  "Love, romance, marriage, consent",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "regular discussion posts, interpretation papers",
                                                    "relevance":  "interdisciplinary course relevant to students from different backgrounds",
                                                    "learning_resources":  "online texts and texts for purchase",
                                                    "extra_time_commitment":  "individual meetings"
                                            }
}