{
        "code":  "76-302",
        "name":  "Communication Support Tutoring Practicum",
        "short_name":  "CST PRACTICUM",
        "units":  4.5,
        "min_units":  4.5,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The Communication Support Practicum is designed to introduce students to communication scholarship and pedagogy as well as the methods and theories that inform them for the purpose of communication support and tutoring in CMUs Student Academic Success Center. Students will explore communication written, oral, and visual in multiple disciplines and genres with a focus on gaining knowledge and skills to respond to communicators and their texts. Lectures, discussion, and assignments will offer a chance to think critically about tutoring practices and the ideologies and values on which they are based as well as ways to challenge the bias inherent in them. There will be many occasions to reflect on and evaluate tutoring skills, observe others in tutoring situations, and practice a variety of methods that consider the different needs of communicators. Students will gain awareness of how various spaces, identities, technologies, and abilities inform textual production as well as how to create a meaningful response to meet the diverse needs.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://www.cmu.edu/gcc/faqs/index.html",
        "custom_fields":  {
                                                    "goals":  "In this course, students will develop an understanding of different theories of communication scholarship and pedagogy\nPractice reading and responding to a variety of texts and genres written, oral, and visual in order to provide rhetorical direction for communicators Reflect on methodsapproaches and their effects which differ across communicator needs and identities Improve their own abilities to listen, readanalyze texts, and interact with others Develop a pedagogy of tutoring through experiencing tutoring sessions, observing other tutors, and reflecting on their own tutoring practices",
                                                    "key_topics":  "communication scholarship; visual, written, oral communication; tutoring methods and theories; genre theory",
                                                    "prerequisite_knowledge":  "awareness of different types/genres/forms of communication, desire to support others in making communication choices.\n\n\n\nExpertise in genre/communication theory is not a prerequisite. Students are expected to have varied backgrounds, knowledge, and experience with different types of communication (visual, oral, written). The course will focus on creating skill and confidence in responding to texts of all kinds.",
                                                    "assessment_structure":  "Discussion (weekly)--reflections on readings, annotations, particularly good quotes, questions, analysis, etc. Concept videos (2)--explain a communication concept/learnable principle concisely and clearly Observations of Tutoring (2)--field notes with analysis (not criticism; focused on strategies you can use in your own consultations) Self-Reflection Essay--analyze a recording of yourself tutoring Tutoring Philosophy--combine readings and experience to explain your understanding of communication support Rhetorical Analysis: Writing in a Discipline--investigate WAC/WID texts and communication pedagogy in a discipline not your own; gather sample communications on which you will base your analysis. Grading Overview Lecture participation (%20), Supported Preparation and Observation (20%), Canvas Module genre training completion (60%)",
                                                    "relevance":  "upon completion of the course, students will be employed as consultants in Communication and Language Support (SASC program); it is a requirement of employment",
                                                    "learning_resources":  "Canvas (weekly modules with linked readings/articles, discussions, assignment upload space, recorded tutoring sessions, etc.), CommS current consultant work (video tutoring, Zoom synchronous tutoring), CommS Coordinator (observation, mentoring, etc.)",
                                                    "extra_time_commitment":  "Starting Week 4 and continuing through the final week of the course (Week 8), students will interview, observe, and tutor in CommS/SASC. This work fits in the expected unit hours required and is only \"extra\" in that it is not included in class time."
                                            }
}