{
        "code":  "76-308",
        "name":  "Literary Journal Publishing",
        "short_name":  "LIT JOURNAL PUB",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  15.0,
        "prereqs":  {
                                        "text":  "(76-265 [] at least D) or (76-260 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In this course, students will learn about the landscape of and publication process for literary journals in the United States. We will read a variety of literary journals in print and online, will host guest speakers, and will do a variety of handson activities related to editing and publishing. Students will gain experience by working on The Oakland Review, an international literary journal run out of CMU, in capacities as varied as editorial, design and production, or promotion. If you are interested in registering for this course, please go to the Course URL and fill out the questionnaire. Thank you.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://form.jotform.com/CMUEnglish/literary-journal-publishing-course",
        "custom_fields":  {
                                                    "goals":  "learn the major steps in publishing a literary journalbecome confident content editorsbecome familiar with major literary journals in the U.S.gain practical experience with literary publishing",
                                                    "key_topics":  "publishing\nediting",
                                                    "prerequisite_knowledge":  "a background in creative writing is helpful; or a background in design if planning to work on that aspect of the journal",
                                                    "assessment_structure":  "there will be a variety of assignments throughout the semester as well as a presentation and final project",
                                                    "relevance":  "This course will give students practical publishing experience. It is designed to function as a practicum in that we will be learning about publishing through hands-on work in creating and launching a literary journal. This class will also be helpful for those students interested in publishing their own creative work as they will learn about the publishing industry.",
                                                    "learning_resources":  "online and print literary journals, texts, visiting speakers",
                                                    "extra_time_commitment":  "There may be several visiting writer events throughout the semester."
                                            }
}