{
        "code":  "76-312",
        "name":  "Crime and Justice in American Film",
        "short_name":  "CRM \u0026 JUSTC AMRN FLM",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Films dealing with criminal activities and criminal justice have always been popular at the box office. From the gangsters of the Thirties and the film noir of the Fifties to the more recent vigilante avenger films of Liam Neeson, the film industry has profited from films about crime and its consequences. How those subjects are portrayed, however, tells us a great deal about larger trends in American history and society. Every imaginable type of criminal activity has been depicted on screen, as have the legal ramifications of those acts. But these films raise profound questions. What is the nature of crime What makes a criminal Are there circumstances in which crime is justified How do socioeconomic conditions affect the consequences How fair and impartial is our justice system Perhaps most importantly, how do depictions of crime and justice in popular media influence our answers to these questions This class will utilize a variety of films to discuss the ways in which popular media portrays the sources of crime, the nature of criminals, the court and prison systems, and particular kinds of criminal acts. Films to be screened may include such titles as The OxBow Incident, Out of the Past, 12 Angry Men, Young Mr. Lincoln, Brute Force, The Equalizer, Jack Reacher and Minority Report. By thoroughly discussing these films and related readings we will be able to trace the various changes in attitude towards crime and justice in America over the last century.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  "Notions of crime, criminals and criminal justice as seen in American film from 1900 to the present.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Weekly quizzes and/or response papers, one short essay of 5-6 pages, one research paper of 10-12 pages.",
                                                    "relevance":  null,
                                                    "learning_resources":  "Required readings will be distributed in class.",
                                                    "extra_time_commitment":  "Students will be required to watch at least two feature films per week outside of class and complete assigned readings"
                                            }
}