{
        "code":  "76-367",
        "name":  "Fact Into Film: Translating History into Cinema",
        "short_name":  "FACT INTO FILM",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-108 [] at least D) and (76-106 [] at least D)) or ((76-108 [] at least D) and (76-107 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "From the very beginning, film has provided a window into the past. But how useful are the images we see through that window For every person who reads a work of history, thousands will see a film on the same subject. But who will learn more Can written history and filmed history perform the same tasks Should we expect them to do so How are these two historical forms related How can they complement each other This course will draw examples from across the history of film in order to examine how the medium of film impacts our understanding of facts and events, the ways that film transfers those facts to the screen, and how that process affects the creation of historical discourse. Films may include such titles as The Fall of the Roman Empire, The Gunfight at the O.K. Corral, Saving Private Ryan, World Trade Center, Enemy at the Gates, Lagaan and Hero.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The primary goal is to encourage students to understand the ramifications of the transmission of history through visual media, especially in relation to the written transmission of history.",
                                                    "key_topics":  "This course will examine the processes by which history is created and transmitted through visual media.",
                                                    "prerequisite_knowledge":  "There are no specific prerequisites for this course, though it is assumed that students will be able to research and write a formal academic paper.",
                                                    "assessment_structure":  "Students will write regular short response papers, take weekly quizzes and write at least two longer papers.",
                                                    "relevance":  "Students will learn to analyze and interrogate the rhetoric of visual media dealing with historical subjects.",
                                                    "learning_resources":  "Students will use films available from the library, as well as various materials handed out in class.",
                                                    "extra_time_commitment":  null
                                            }
}