{
        "code":  "76-360",
        "name":  "Literary Journalism Workshop",
        "short_name":  "LITRY JOURNLM WRKSHP",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-260 [] at least D) or (76-261 [] at least D) or (76-262 [] at least D) or (76-472 [] at least D) or (76-270 [] at least D) or (76-271 [] at least D) or (76-372 [] at least D) or (76-265 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "S23 How can storytelling and reading literature help us understand the worlds of healing and illness Well read texts focusing on doctors, nurses, patients, caregivers, those living with chronic illness, and disability. Students will write about their own experiences, and those of loved ones.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "students should emerge as better writers, readers, thinkers, and community members class is run as discussion, and I value all input. In this way students learn to be engaged critics, too, more capable of articulating their own point of view.",
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  "Prior writing experience. The course demands significant writing and reading.",
                                                    "assessment_structure":  "several essays, class participation, responses to readings, final presentation.\n\n\n\nI give comments, not letter grades.\n\n\n\nIf you want comments translated into a letter grade, I can do so, but firmly believe writing is a process and do not believe in freezing someone as \"A\" or \"B\" writer.\n\nI give comments, not letter grades.\n\nIf you want comments translated into a letter grade, I can do so, but firmly believe writing is a process and do not believe in freezing someone as \"A\" or \"B\" writer.",
                                                    "relevance":  "All students interested in working in the field of medicine, or any student interested in understanding how storytelling can help us grapple with physical and psychological suffering.",
                                                    "learning_resources":  "Canvas \u0026 on line readings, but not exclusively.",
                                                    "extra_time_commitment":  "time for reading and writing to complete work for class"
                                            }
}