{
        "code":  "76-435",
        "name":  "Politics and Popular Culture",
        "short_name":  "20TH CENT AMERICAN",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Over the course of the last one hundred years what has been the influence of leftwing social movements on popular culture Michael Kazin, in his recent best seller American Dreamers argues that the left has had a more powerful effect on culture than on politics.  But what about the idea that cultural influence is inherently political In this class we will read a mix of cultural history, film studies, music studies, literary studies, art history, television studies, and cultural theory. We will look at the intersection of radical movement politics and high modernism in the 1930s and 1940s. We will look at how left culture survived under the cloud of the blacklist. We will look at the Civil Rights culture and Feminist culture that emerged out of the 1950s and 1960s. Finally, we will look at how the leftright debates and struggles over the thirties, fifties and sixties have persisted into our current politicalcultural narrative forms. Key texts for the course include Michael Kazin, American Dreamers  How the Left Changed the Nation, Paul Buhle, Hide in Plain Sight, the Hollywood Blacklistees in Film and Television, T.V. Reed, The Art of Protest, Susan Douglas, Where the Girls Are Growing Up Female with Mass Media, Sasha Torres, Black, White and In Color  Television and Black Civil Rights, and Judith Halberstam, The Queer Art of Failure.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}