{
        "code":  "76-468",
        "name":  "Space and Mobilities",
        "short_name":  "SPACE AND MOBILITIES",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will investigate space and movement as social constructions.  Space is something dynamically created that may be interpreted for the ways it creates meaning, while movement reproduces and constitutes power and institutions. This interdisciplinary course considers theories of space and movement as a field of study and in reference to literary and film texts. The course might include discussions of migrants and state borders, cultural constructions of transport, the poetics of space, and the dynamic mapping of the city through movement and sound.  Readings might include Henri Lefebvre, Doreen Massey, Edward Soja, Gaston Bachelard, Wendy Brown, John Urry, Tim Cresswell, Marian Aguiar literary texts might include Brian Friels Translations, Christina Garcias Dreaming in Cuban, W.G. Seabalds Austerlitz and Teju Coles Open City. Please note Freshmen are prohibited from registering for this course. Sophomores must obtain instructor permission.  Students across disciplines are encouraged and may work on a final project related to their primary field.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "familiarity with a major field in sociologygeography and literary studies",
                                                    "key_topics":  "space\n\n\n\n\n\nmovement\n\n\n\n\n\naesthetics of transport\n\n\n\n\n\nrefugees\n\n\n\n\n\nborders\n\n\n\n\n\nglobalization",
                                                    "prerequisite_knowledge":  "priority to Juniors and Seniors; First-year Writing",
                                                    "assessment_structure":  "regular short assignments, large final project and presentation in student\u0027s discipline with analytical component for creative projects",
                                                    "relevance":  "This course is interdisciplinary, with relevance to literary studies, architecture, design, urban design, fine arts, history and international relations",
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}