{
        "code":  "76-443",
        "name":  "Restoration \u0026 18th-Century Theatre",
        "short_name":  "18TH-CENTURY THEATRE",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "London theaters turned on their lights or more properly, lit their candles in 1660 when the Puritan regime ended and Britain returned to monarchical rule.  The newly opened theaters quickly became spaces for political and social performances by both actors and audiences.  The theater was the place not only to see plays but to hear the latest gossip about the glitterari of the court, to monitor political plots, and to speculate on which pretty actress was current mistress to the King.  It was literally a space in which society performed itself, to itself.  We will look at the development of the theater as an important social institution and trace its development, up to the mid 1700s, as a media hub that spread its tentacles into newspapers, visual materials, and other popular culture media.  Of course, we will read some of the most important plays of this time period, but we will also pay attention to the print and visual culture that grew up around and in response to the theater.  In addition to building knowledge about this important chapter in the development of modern media culture, this course will introduce students to performance studies as a framework for the study of culture in any historical period.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The interpretation of literary and visual texts, includingo Close attention to language and visual detailo Sensitivity to textual and visual anomalyo Close attention to connotative as well as denotative meanings The contextualization of literary and visual texts in relation to the historical settings in which they were first produced and read, includingo Developing a knowledge base of the periods cultural historyo Connecting details in text and image to the history and culture surrounding their production and reception",
                                                    "key_topics":  "Restoration and early 18th century London theaters as cites of cultural as well as aesthetic performance\n\n\nconnections between the theater and periodical press\n\n\ninterplay between embodied performance and print texts",
                                                    "prerequisite_knowledge":  "I don\u0027t expect much prior knowledge. The course covers theater history that very few students know well. But it would help if they had taken a course sometime in English Renaissance theater, like Shakespeare.",
                                                    "assessment_structure":  "presentations, performance, and a final seminar project",
                                                    "relevance":  "I see this course as giving advanced undergrads and grads some historical milestones in the history of social media and performance and some theoretical tools for analyzing the latter in other times periods as well as the Restoration and 18th century.",
                                                    "learning_resources":  "digital archives, the library, texts",
                                                    "extra_time_commitment":  null
                                            }
}