{
        "code":  "76-437",
        "name":  "Global Realisms:",
        "short_name":  "GLOBAL REALISMS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In the standard history of the novel, the genre emerges in distinction from earlier narrative romances as a form bounded by a greater fidelity to ordinary life. In the nineteenth century, this general tendency is further specified in new narrative strategies and subject matter that define realism, which according literary historians, becomes identified with the novel per se.  The standard history also insists that realism, while dominant in the 19th century, becomes a residual form in the 20th, replaced first by modernism, then postmodernism.  In globalpostcolonial fiction, ludic form, especially magical realism, becomes an important standard bearer of progressive politics in the mid20th century, again perceiving realism as residual.   This course interrogates that history by looking again at classic realist texts from France and England, reading them in conjunction with novels from the U.S., India, the Caribbean, and Africa, by charting uneven development of forms and richer modes of reading.   We will explore the continued importance of realist fiction and the ways it changes across time by placing it in a global context.  Likely authors Balzac, Zola, George Eliot, Joyce, Adiga, Adichie, Updike, Petry, and Sembne.  Theoreticalcritical writings Woolf, Barthes, Jameson, Lukcs, Howells, Zola, Brecht, Bloch, and others.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "To understand the history of the novel and critical reception of it in its different forms. To be able to recognize and critique those forms. To be able to write about these matters in a wellorganized research paper.",
                                                    "key_topics":  "Realism, modernism, poststructuralism, novels from France, the UK, the US, Africa, and South Asia.",
                                                    "prerequisite_knowledge":  "Some experience reading and interpreting fiction, and writing critical essays.",
                                                    "assessment_structure":  "Weekly \"agendas\" and class participation. One short paper and a long, research paper.",
                                                    "relevance":  "The course is designed for graduate students and advanced undergraduates.",
                                                    "learning_resources":  "Textbooks and readings on Canvas.",
                                                    "extra_time_commitment":  "This is a reading intensive course. Some of the material is theoretical, which may require more time per page than readning the novels."
                                            }
}