{
        "code":  "76-431",
        "name":  "Gender Play in Early Modern Drama",
        "short_name":  "GENDER PLAY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The playhouses of early modern London offered access to an astonishing spectacle that would be difficult to find anywhere else in the city men dressed as women, skillfully reproducing but also exposing, interrogating, and refining the significations that structure concepts of gender difference. In addition to this fundamental condition of performance and theatrical experience, the plots of the plays themselves regularly engaged with issues pertaining to gender and sexuality, an interest that runs through the raunchy satires performed by companies of adolescent boys, the innumerable comedies of crossdressing and mistaken identity, and the equally numerous tragedies centered on problems of inequality and imbalances of power. This course will consider a wide range of drama from the period alongside a selection of readings in sexuality and gender theory, thus bringing early modern dramatists such as William Shakespeare and Thomas Middleton into conversation with contemporary thinkers such as Judith Butler and Sarah Ahmed. The body of core texts will include Twelfth Night, The Merchant of Venice, As You Like It, The Roaring Girl, The Taming of the Shrew, The Tamer Tamed, The Island Princess, The Witch of Edmonton, The Silent Woman, Women Beware Women, and Galatea. Please note Firstyear students are prohibited from registering for this course. Sophomore students must obtain instructor permission.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  "Early modern drama, gender \u0026 sexuality studies",
                                                    "prerequisite_knowledge":  "Basic familiarity with university-level literature courses, literary theory \u0026 Shakespeare",
                                                    "assessment_structure":  "informal online writing assignments, two formal essays, classroom discussion \u0026 participation, class presentations",
                                                    "relevance":  null,
                                                    "learning_resources":  "Canvas, Zoom, streaming video via drama online",
                                                    "extra_time_commitment":  null
                                            }
}