{
        "code":  "76-467",
        "name":  "Crime Fiction and Film",
        "short_name":  "CRIME FICT AND FILM",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will be concerned with hardboiled crime fiction in print and on screen. The hardboiled emerges in Ernest Hemingway a distinctive literary style, and about same becomes a formula for pulp crime fiction.  The language and attitude of the hardboiled became associated with urban gangsters in films such as The Public Enemy.  Newspaper crime coverage beginning in the 1920s becomes increasingly frank in both its language and photographic coverage of crime.  These various elements will be the material for a new kind of literature represented Dashiell Hammett, James M. Cain, and especially Raymond Chandler, and for a cycle of films that owe much to their work, film noir.  Chandler was responsible for invention of one of most enduring types in American fiction, the hardboiled detective.  The course will focus on Chandler and the crime stories after him that make various uses of that type and the formula that has become associated with it. Throughout the course we will consider the social and political contexts in which these cultural forms developed, and what cultural work the hardboiled performed.  We will be especially interested such questions as the function of the misogyny typical of much of it, the different representations of race by white and black artists, the representation of police, whether the hardboiled is best understood as having a workingclass affiliation, and the degree to which its various manifestations might be called realist. NOTE Freshmen are prohibited from registering for this course. Sophomores must obtain instructor permission.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}