{
        "code":  "76-438",
        "name":  "The Wire: Crime, Realism, and Long-Form TV",
        "short_name":  "FILM \u0026 MEDIA STUDIES",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The HBO series The Wire 20022008 has been called the greatest TV show ever. Part of the first wave of quality television series by which HBO changed the way people conceived of the artistic possibilities of the medium, the Wire differed from its contemporaries like The Sopranos and Six Feet Under in its realism and its smaller audience. Unlike most other shows on television, The Wire addressed the racism, poverty, the failures of the criminal justice system, and other social problems head on. It was able to do this in part because it had enough time to develop complex story threads. This moment of TV history produced what I am calling longform TV, in which narrative continuity was stretched over multiple seasons. TV in this form resembles 19th century novels that were first released serially in magazines and newspapers.  In both cases, audiences waited expectantly for new episodes, since they could not be bingewatched. The Wire was rooted in producerwriters David Simon and Ed Burns experiences in Baltimore, where the former had been a crime reporter and the latter a police detective. Simon has said that he made the series in order to tell truths about the city he could not tell in the newspapers.    This course will consider the wire in the context of realist fiction of the 19th century, twentiethcentury crime fiction, earlier TV crime series, and other longform TV, including Mad Men. We will try to explore The Wires realism, its continuing appeal, and its impact.  We will probably watch 3 seasons of The Wire.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}