{
        "code":  "76-457",
        "name":  "Rhetorical Invention",
        "short_name":  "RHETORICAL INVENTION",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-108 [] at least D) and (76-106 [] at least D)) or ((76-108 [] at least D) and (76-107 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Rhetorical invention refers to the discursive process of inquiry, discovery, and problem solving, or how we decide what to say, what arguments to advance, and what means of persuasion to use in any situation. Although invention is centrally important to rhetoricwithout which it becomes a superficial and marginalized study of clarity, style, and arrangementfrom the Scientific Revolution and Enlightenment through the midtwentieth century invention all but disappeared as a topic of rhetorical study under the pressure of the view that invention should be exclusively governed by deductive logic and the scientific method rather than rhetorical considerations such as audience or the figurality of language. This repudiation of rhetorical invention fundamentally shaped modern thought and continues to influence the ways we think and communicate today. In this course, we begin by examining the status of rhetorical invention in the development of modern thought before focusing on various scholarly efforts to revive a rhetorical understanding of invention from the midtwentieth century forward, surveying a variety of contemporary theories of rhetorical invention including those promoted by postmodern, posthuman, and digital rhetorics. The course is designed to explore the central importance of invention to contemporary rhetorical theory through a pairing of historical and contemporary readings.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}