{
        "code":  "76-403",
        "name":  "The Crucible of Modernity:Vienna 1900",
        "short_name":  "CRCB MOD VIENNA 1900",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Vienna at the turn of the century that is, at the turn of the last century, 1900 was many things the political center of the Habsburg dynasty of the AustroHungarian Empire the meeting place of Czechs, Slovaks, Hungarians, Romanians, Slavs, Poles, Italians, Serbs, Bulgarians, and Germans the center of Germanlanguage music and theater the birthplace of Zionism and of psychoanalysis the battleground for liberalism and antiSemitism a haven for socialism the home of cafculture and the waltz the garrison for an outdated army the city of baroque urban palaces and squalid backyard tenements the center for Enlightenment public policy and reactionary bureaucracy and the showcase for historicism. And while the story of Viennas cultural and political turmoil is interesting, it probably would not command our attention today were it not for its role as the birthplace of Modernism. In an effort to understand todays intellectual environment, therefore, we will examine Vienna before the collapse of the AustroHungarian Empire in 1918. We will be looking at a huge and at times confusing canvas which by necessity includes almost every aspect of culture. We will start with politics and history and move on through art, architecture, crafts, psychoanalysis, literature, music, and philosophy. We will be looking at art nouveau buildings and furniture, reading literature, viewing films, and listening to recordings  and we will build 3D models on a digital map which will help us understand how the different arts were all connected and influenced each other. Language of instruction English",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}