{
        "code":  "76-476",
        "name":  "Rhetoric of Science",
        "short_name":  "RHETORIC OF SCIENCE",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course explores questions about scientific argument and communication that are of interest to students in the sciences, rhetoric, and professionaltechnical writing. These include questions like How are scientific arguments structured How is scientific information and argument transformed when it moves from research papers for specialist audiences to publications for nonspecialists How does the social, historical, and cultural context of science shape the way it is communicated andor argued What contributions do visuals make to scientific argument and communication To investigate these questions, we will be examining a wide variety of realworld communications in and about science as well as texts in rhetoric, history, and philosophy of science.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will be able to Identify the conventions of argument in scientific research papers Understand the transformation that scientific information undergoes when it gets adapted for differnt audiences Appreciate the role that socialemotional factors play in scientific argument Apply rhetorical concepts and methods to the analysis of texts associated with science",
                                                    "key_topics":  "Genre conventions of scientific argument\n\nScience in popular media\n\nScience and stylistics\n\nGender and race in science\n\nScientific visual representations\n\nValues, emotions, and character in science",
                                                    "prerequisite_knowledge":  "Completion of 76-101. Students need not have any previous experience in rhetoric or science to take this class. Basic instruction to the concepts, methods, etc. in these fields will be provided. I love getting a mix of students from both fields in this class.",
                                                    "assessment_structure":  "The assignments in this course are designed to hone the analytical skills of participants and encourage them to explore their unique interests. Assignments in the first part of the semester (short guided analyses and a topic proposal) develop and practice skills that will be used to prepare students to write a final paper on a topic of their choice. The course also positions students at the center of learning by asking them to lead and participate in class discussions in person and online.",
                                                    "relevance":  "This course is particularly useful for students studying technical writing and students majoring in science because it examines the nuances of scientific argument and communication and provides students with the theory, method, and language for assessing and understanding these features.",
                                                    "learning_resources":  "The course Canvas contains the majority of resources students need to the class including readings, webpages, and online communication tools (Zoom and Discussion board).",
                                                    "extra_time_commitment":  null
                                            }
}