{
        "code":  "76-480",
        "name":  "Feminist Rhetorics",
        "short_name":  "FEMINIST RHETORICS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course traces advances made in feminist rhetorics in the past three decades, paying particular attention to the intersection feminist rhetorics have with race, class, religion, sexuality, nationality, andor disability. While much of early scholarship on feminist rhetorics dedicated itself to recovering the voices of women in history, since then scholars have expanded their focus to consider how gender interacts with the concerns of protest, law, health, medicine, war, politics, technology, migration, and the list goes on. Throughout this course, we will consider how feminist rhetorical scholars have 1 critiqued the discipline of rhetoric 2 developed new methods useful for analyzing gender in a variety of contexts and 3 expanded the scenes of rhetorical study. Readings will include but are not limited to canonical investigations into early feminist rhetorics Karlyn Kohrs Campbell, Cheryl Glenn, Jacqueline Jones Royster, influential theories on contemporary topics Karma Chvez, Robin Jensen, Raka Shome, and popular accounts of feminism by current writers and activists Beyonc, Roxane Gay, Malala Yousafzai. Students will conduct their own research on a topic related to feminist rhetoric that also aligns with their professional and academic goals. Graduate students interested in research will benefit from this courses focus on theory and methodology and gain an understanding of the scholarly trajectory of feminist rhetoric. Undergraduates students both majors and nonmajors will have the opportunity to examine how gender intersects with communication and writing contexts in their everyday public and professional lives. Please note Freshmen are prohibited from registering for this course. Sophomores must obtain instructor permission.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course, students will be able to analyze how gender interacts with writing and communication in a variety of contexts, develop the skills and tools of rhetorical analysis, and practice developing an argument through a larger research project.",
                                                    "key_topics":  "feminist rhetorics, gender, rhetorical theory, contemporary women\u0027s issues, rights discourse",
                                                    "prerequisite_knowledge":  "While prior knowledge of rhetoric or feminism is welcomed, it is not required in order to be successful in this course.",
                                                    "assessment_structure":  "Students will conduct their own research that will be broken up into several smaller, more manageable pieces.",
                                                    "relevance":  "This course will be particularly relevant to graduate/undergraduate students in English, students in the gender studies minor, and students from across campus who are interested in feminist issues.",
                                                    "learning_resources":  "Students will use Canvas as our primary home base for the course. Some of the readings will be available there or additional books will be required. We will access the internet to locate a variety of case studies relevant to the course.\n\nStudents should contact me directly with accommodation requests, whether they are documented or not.\nStudents should contact me directly with accommodation requests, whether they are documented or not.",
                                                    "extra_time_commitment":  null
                                            }
}