{
        "code":  "76-439",
        "name":  "Seminar in Film and Media Studies",
        "short_name":  "SEM FILM MEDIA",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-107 [] at least D) and (76-106 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Topics vary by semester. Fall 2025 Novelistic Television In this course we will look at television series defined by narrative complexity developed over the course of a season and beyond. We will watch whole seasons of such shows as The Sopranos, Mad Men, The Wire, and Slings and Arrows, which bear greater similarity to the novel than to traditional, episodic TV. We will trace the development of the novelistic form of television from the first wave of quality television series in the 1990s, in which HBO changed the way people conceived of the artistic possibilities of the medium, through the 2000s, when The Wire and Mad Men fully exploited the new form, and finally into the streaming era, when it has become common but less innovative. We will read media history and theory, and narrative theory to develop an understanding how and why the new form emerged. We will endeavor to understand these shows as expressions of and commentaries on the social and political conditions under which they were produced. We may read a novel or two for purposes formal comparison, and we will watch some episodes of more traditional TV series. Likely theorists include Raymond Williams, Linda Williams, Jason Mittell, Pierre Bourdieu, and Fredric Jameson.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "To understand and appreciate examples of a relatively new art form. To learn how to analyze the narrative strategies of fiction. To produce a wellargued and researched seminar paper on a topic relevant to the seminar.",
                                                    "key_topics":  "Televsion industry and history; narrative; fictional forms; \"quality\" TV.",
                                                    "prerequisite_knowledge":  "Students should have studied the novel and ideally have taken a course or two in film or television.",
                                                    "assessment_structure":  "Regular, informal writing and class participation; a short essay; a 15-20 page research paper.",
                                                    "relevance":  "This course is designed to help graduate students and advanced undergraduates think about how narrative fictions are represented in long-form TV series, and to compare these to novels.",
                                                    "learning_resources":  "Readings will be provided through Canvas. Students must obtain access to the the TV series either on DVD or on streaming.",
                                                    "extra_time_commitment":  null
                                            }
}