{
        "code":  "76-451",
        "name":  "Language and Globalization",
        "short_name":  "LNG STDY: LNG \u0026 GLBL",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "It is a paradox of globalization that the same factors that cause people to become more alike also make people become aware of difference.  In this course we explore this process with respect to language.  We look at the history of language standardization and its relationship with political and economic history, exploring when and why different ways of speaking and writing become more alike, both as an automatic result of social interaction and as a planned result of policy.  We look at the language ideology that gives rise to and undergirds standardization and the rhetoric that gets used to forward it.  Then we explore reasons for and mechanisms of localization in language. What ideas about language, communication, and identity underlie attempts to push back against standardization, and what rhetorical strategies forward these ideas We then turn to three case studies arguments about Global English versus local Englishes and ways of using English, ongoing struggles over the standardization of the Putonghua variety of Chinese in China and the development of regional and national standards in Taiwan and elsewhere, and the history of Catalan, a regional dialect that has become a quasinational standard in the Catalunia region of Spain.  In addition to presenting and leading discussion on two of the readings, students will be expected to complete two 500word writing assignments and undertake a substantial original research project that expands on one or more of the themes of the course.  This project will be presented orally and in a 2025 page paper.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}