{
        "code":  "76-410",
        "name":  "The Long Eighteenth Century",
        "short_name":  "18TH CNTRY LCS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Angela Davis wrote that freedom is a constant struggle how do the freedom struggles of the long eighteenth century continue into the present How were modern categories of race and gender forged and navigated in the long eighteenth century In this course, we will study literature and culture between roughly 1660 and 1820, an era in which historical phenomena such as European empires, the Rights of Woman, and slavery and abolition coincided with changes in print and media culture to produce profound cultural changes that are still with us. Through reading, discussion, and graded assignments including short essays and oral presentations, we will examine the interanimating relationship of literature and history in moments of crisis. Examples of primary readings include Aphra Behns Ooronoko, selections from Miltons Paradise Lost, Jane Austens Mansfield Park, Mary Princes The History of Mary Prince, and William Wordsworths To Toussaint LOuverture. Secondary readings will draw from a variety of critical traditions such as post and decolonial studies, Black studies, poststructuralism, and material culture studies.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Understand literature of the long 18th century in relation to historical movements improve writing and oral communication develop methods for literary analysis understand historical origins of contemporary social justice movements",
                                                    "key_topics":  "Romanticism, long eighteenth century, literature, race, gender and sexuality",
                                                    "prerequisite_knowledge":  "Some knowledge of and interest in methods of literary analysis",
                                                    "assessment_structure":  "Oral presentations, essays, Canvas discussion, creative assignment",
                                                    "relevance":  "Provides an overview of the literature and culture of the long eighteenth century; offers opportunities to improve writing and critical thinking; provides training in methods for analyzing literature",
                                                    "learning_resources":  "Students will be asked to purchase 1-2 novels. Other readings will be available on Canvas and Persuall",
                                                    "extra_time_commitment":  "no extra time commitments other than reading and completing assignments"
                                            }
}