{
        "code":  "76-420",
        "name":  "The Cognition of Reading and Writing: Introduction to a Social/Cognitive Process",
        "short_name":  "COGNTN READ WRITING",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Ever wondered how a reader is interpreting a text you wroteand how that compares to what you thought it said  Or how does your own process of writing that text compare to the problemsolving strategies experts draw upon  This course explores reading and writing as a socialcognitive processrevealing conscious and unconscious problemsolving strategies with which readers comprehend and interpret texts, and writers construct and communicate their meaning.  To get at the why behind the surprising things readers do with a text, we will draw on the psychology of reading, where socially constructed memory networks, cognitive schemas, and metaknowledge actively shape interpretation. To uncover readers interpretations, we put our knowledge to work trying out usertesting methods that help writers build effective audiencebased presentations, applications, websites, or guides.  We then take the same approach to writers as thinkers, examining the key problemsolving processes, from task representation, to planning, to revision, on which expert and novice writers often differ.  Learning to track problemsolving through process tracing methods, will let you carry out two case studies of your own.  The first will uncover the sometimes radical differences in how a small set of readers actually interpret a text you find significant. The second will be a case study of your own thinking process on a real task you are doing outside this class.  Here you are likely to uncover old unconscious habits, problems you had to solve, as well as unrecognized successful strategies, giving you a new reflective insight into your own thinking as a writer. Freshmen prohibited from registering for this course. Sophomores must obtain instructor permission.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Metaknowledge and selfconscious control of your own reading and writingGrounding in cognitive research and processtracing methodsExperience conducting two studies andApplying what you discover to your own thinking, reading ,and writing",
                                                    "key_topics":  "Your own problem-solving strategies\n\nCognitive processes in reading and writing\n\nExpert and novice differences\n\nProcess tracing research methods\n\nMeta-knowledge and self-awareness",
                                                    "prerequisite_knowledge":  "An interest in readers and your own writing",
                                                    "assessment_structure":  "two process-tracing studies and a reflection",
                                                    "relevance":  "It offers\n\ninsight into often unrecognized cognitive process\n\nas well strategies the writers can consciously control and\n\nways to teach students to recognize the logic behind their own work.",
                                                    "learning_resources":  "Texts and examples",
                                                    "extra_time_commitment":  "conducting a study"
                                            }
}