{
        "code":  "76-496",
        "name":  "Research Methods in Rhetoric \u0026 Writing Studies",
        "short_name":  "RESEARCH METHODS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "NOTE This course is only available for seniors with special permission. This course is a survey introduction to historical, empirical, textbased, and qualitative methods of inquiry used in the fields of rhetorical and writing studies. We will read broadly to understand the philosophical questions, research traditions, practical applications, and innovative directions that shape the field, exposing students to a range of methods and methodologies. Studies of rhetoric, writing, and literacy have evolved tremendously, and we will examine approaches for how to trace, analyze, and critique the use of meaning making in a variety of cultural, political, workplace, technological, and pedagogical contexts. By the end of the course, students will develop a sense of how to put together an effective research project on their own and design and articulate the research methods and methodologies appropriate to that study. Throughout, we will ask a fundamental question How do rhetoric, writing, and literacy work and for what consequences",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Having a better grasp of the field, understanding the difference between methods and methodologies and how to implement them in their own research",
                                                    "key_topics":  "methods and methodologies, rhetorical studies, writing studies, literacy studies",
                                                    "prerequisite_knowledge":  "None, but students who have taken courses in rhetoric may be more familiar with the approaches.",
                                                    "assessment_structure":  "book review assignment, 2 short papers, final project proposal",
                                                    "relevance":  "Ideally this is an intro to the field course and a survey of tools course",
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}