{
        "code":  "76-409",
        "name":  "History of German Film",
        "short_name":  "HSTY OF GERMAN FLM",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is a chronological introduction to one of the worlds greatest cinema traditions German cinema.  It moves from the silent cinema of the 1910s to the Weimar Republic, when German cinema represented Hollywoods greatest challenger in the international cinema world.  It then addresses the cinema of Hitlers socalled Third Reich, when German cinema dominated European movie theaters, and moves on to the cinema of divided Germany from 19491989, when cinema in the socialist east and cinema in the capitalist west developed in very different ways.  In the final weeks of the semester, we will address German cinema in the postunification period, which has experienced a revival in popularity and interest.  The two historical foci of the semester will be the Weimar Republic, the classic era of German cinema, and the era of the socalled New German Cinema of the 1970s and 1980s, when major German directors developed radical new approaches to cinema and critiques of Hollywood.  Among the great directors focused on in the course of the semester will be Friedrich Wilhelm Murnau, Fritz Lang, Leni Riefenstahl, Wolfgang Staudte, Werner Herzog, Wim Wenders, and Rainer Werner Fassbinder.  No knowledge of the German language is required for this course most of the films will be in German with English subtitles.  The course will be crosslisted in the departments of Modern Languages, English, and History.  Students will be required to attend class, to watch all of the required films, to actively participate in discussion, to write a 15page term paper on a topic related to German cinema history, and to take a midterm and a final examination.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "knowledge of 20th century German film history, and of German history more generally",
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "two tests, class discussion, and (for nine units) a term paper",
                                                    "relevance":  "relevant to German history, film history, and film theory and criticism, global studies",
                                                    "learning_resources":  "Carnegie Mellon film library, MLRC, textbook, Canvas, Box",
                                                    "extra_time_commitment":  null
                                            }
}