{
        "code":  "76-455",
        "name":  "Performance Theory",
        "short_name":  "PERFORMANCE THEORY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-102 [] at least D) or (76-101 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Emerging from anthropology, semiotics, theater studies, and cultural studies, the interdisciplinary field of Performance Studies offers new ways for practitioners in the field of literary and cultural studies to interpret texts and visual artifacts, as well as media and theater productions. This course will introduce key theories of performance and celebrity by writers such as Richard Schechner, Diana Taylor, Joseph Roach, and Judith Butler, and give students experience in using these analytic frameworks to study a range of objects, from print texts to visual images and even ephemeral performances. While performance is key to how humans make meaning across all times and places, the uses of performance and the forms of celebrity vary historically, and we will ground our theoretical studies in case studies drawn from the early modern British and 20th century American entertainment cultures.  Celebrity is a very modern phenomenon that first became a visible part of political, religious, and artistic culture over the course of the long 18th century, between 1660 and 1800.  We will investigate the genealogies of modern celebrity, considering such questions as, what do the Kardashians have to do with dead English kings  What can crossdressing actresses teach us about 21stcentury drag performances",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}