{
        "code":  "76-450",
        "name":  "Law, Culture, and the Humanities",
        "short_name":  "LAW, CULT, HUMNITIES",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Im not a lawyer, but...  How many times have you heard this disclaimer, closely followed by a lay analysis of law  This course, an introduction to the cultural study of law for graduate students and advanced undergraduate students, can be seen as an introduction to what goes into the making of such a statement.   Where do we get our ideas about law What do we mean when we say law  What counts as law How does culture influence law, and law, culture  And to what degree should historical context condition any answers we might be tempted to give Students in the course will study works in a range of genres novels, plays, poems, judicial opinions, pamphlets and develop methods for investigating ways that law and culture have been made by one another from the 16thcentury to the present.   Readings will include influential theoretical accounts of law Aristotle, Hobbes, Cover, Habermas, Bordieu, MacKinnon, Alexander, canonical texts in Law and Literature Shakespeares Measure for Measure, Melvilles Billy Budd, Kafkas The Trial and some weird fiction by the novelistlegal theorist China Miville.    As a counterpoint to the fiercely antihistorical law and economics movement, however, the course will put special emphasis on rooting intersections of law and culture in rich historical context, considering both local and international legal contexts sometimes in fairly technical detail alongside socalled ephemera of culture. Students will tackle the especially fruitful case of Renaissance Britain before developing final research projects, whether on the Renaissance or another period of their choosing.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}