{
        "code":  "76-440",
        "name":  "Postcolonial Theory: Diaspora and Transnationalism",
        "short_name":  "POSTCOLONIAL THEORY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Arjun Appadurai argues that one of the primary transformations in this period of globalization has been in the capacity for people to imagine themselves or their children will live and work in places other than where they were born.  Although the novel has long been considered a national form, contemporary novels frequently represent transnational mobility, both in their plots and as global commodities.  A significant body of contemporary fiction focuses on imaginative and physical movement across national borders.  This global literature course combines literary and theoretical readings to examine the experiences of transnationalism and diaspora.  Theories of transnationalism look at the interconnections that cut across nations.  The concept of diaspora, a term first used to reference the movement of a people out of a homeland, has become a way to think about the identities of immigrants, migrant workers, and refugees.  Readings for the course will be drawn from a diverse group of writers from around the globe.  Literary readings might include works by Caryl Phillips, Jamaica Kincaid, Christina Garcia, Nadeem Aslam and Jhumpa Lahiri; theoretical readings might include works by Salman Rushdie, Paul Gilroy, Gloria Anzaldua, Arjun Appadurai, Inderpal Grewal and Avtar Brah.",
        "student_sets":  [

                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}