{
        "code":  "76-412",
        "name":  "Performance and 18th Century Theatrical Culture",
        "short_name":  "18TH CENTURY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(76-101 [] at least D) or (76-102 [] at least D) or ((76-106 [] at least D) and (76-107 [] at least D)) or ((76-106 [] at least D) and (76-108 [] at least D)) or ((76-107 [] at least D) and (76-108 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course has the dual purpose of introducing students to performance and celebrity studies and giving them experience in using these analytic frameworks to study 18thcentury literature and culture.  Celebrity is a very modern phenomenon that first became a visible part of political, religious, and artistic culture over the course of the long 18th century, between 1660 and 1800.  We will investigate the genealogies of modern celebrity, considering such questions as, what do the Kardashians have to do with dead English kings  What can crossdressing actresses teach us about 21stcentury drag performances  Full disclosure Dead English kings and crossdressing actresses will get far more of our attention than the Kardashians or modern drag artists.    We will study some of the most powerful recent theories of performance and celebrity we will read plays and other performance genres that took up time and space on the 18thcentury stage.  In addition, we will explore beyond the London theaters to consider the nature of performance in its many cultural forms What are the connections between theater and the quieter performances of political pamphlets, newspapers, and novels as they occupy physical and mental space in coffee houses and libraries  Can a print text be performative   Finally, we will examine various relationships between performance and culture.  How does performance in the early modern period shape gender and sexuality as well as class and race relations    This course will count as an upperlevel course for the Gender Studies Minor, as well as a pre1900 period course for the EBA.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}