{
        "code":  "76-778",
        "name":  "Literacy: Educational Theory and Community Practice",
        "short_name":  "LITERACY \u0026 COM\u0027TY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Literacy has been called the engine of economic development, the road to social advancement, and the prerequisite for critical abstract thought. But is it  And what should count as literacy using the discourse of an educated elite or laying down a rap  This course combines theory, debate, and handson community engagement. Competing theories of what counts as literacyand how to teach itshape educational policy and workplace training.  However, they may ignore some remarkable ways literacy is also used by people in nonelite communities to speak and act for themselves.  In this introduction to the interdisciplinary study of literacyits history, theory, and problemswe will first explore competing theories of what literacy allows you to do, how people learn to carry off different literate practices, and what schools should teach. Then we will turn ideas into action in a handson, community literacy project, helping urban students use writing to take literate action for themselves. As mentors, we meet on campus for 8 weeks with teenagers from Pittsburghs inner city neighborhoods who are working on the challenging transition from school to work. They earn the opportunity to come to CMU as part of Start On Success SOS, an innovative internship that helps urban teenagers with hidden learning disabilities negotiate the new demands of work or college. We mentor them through Decision Makers a CMU computersupported learning project that uses writing as a tool for reflective decision making.  As your SOS Scholar creates a personal Decision Makers Journey Book and learns new strategies for writing, planning and decision making, you will support literacy in action and develop your own skills in intercultural collaboration and inquiry.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}