{
        "code":  "76-745",
        "name":  "Academic Writing \u0026 Communication for International Students",
        "short_name":  "AC WRTNG \u0026 COMM INTL",
        "units":  4.5,
        "min_units":  4.5,
        "max_units":  4.5,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is designed to help multilingual or international graduate students strengthen their written and oral communication skills in English as they engage in communication tasks frequently found in U.S. academic and scholarly contexts. Topics include genre and rhetorical analysis, ethical source use, oral presentation and visual design, as well as textual structure, style, clarity, and coherence. Students will analyze conventional academic texts to familiarize themselves with features and strategies employed by communicators. This practice will enable higher comprehension while increasing confidence in their communication abilities in academic English. Class sessions will involve researchbased and corpusdriven discussion and activities to support both productive and receptive language skills. Students will transfer skills gained in genre awareness and knowledge to other academic and professional situations.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Increase genre awareness and knowledge of conventional communication practices in U.S. academic situations,Analyze genre, forum, and audience as well as characteristic features of academic discourse in English,Recognize and produce communication that fits the structures and conventions of scholarly writing and speakingGrow in confidence in their abilities to communicate with clarity and coherence in written, oral, and visual forms.",
                                                    "key_topics":  "written and oral communication skills, genre and corpus-driven analysis, US graduate-level communication expectations",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "class discussions, short written responses to readings, oral presentation with visual element, database research with corpus analysis, group project (toolkit creation and reflective memo)",
                                                    "relevance":  "Often, multilingual graduate students receive little direct instruction in communication conventions in their own programs or departments. This course will support learning of genre knowledge within the context of US graduate programs as well as strategies to analyze communication expectations in their specific departments and programs. The focus on English language use in US academic and scholarly spaces is intended to help students build proficiency and confidence.",
                                                    "learning_resources":  "Materials, texts, and online tools will be available to students within Canvas and the CMU library. Students will not purchase materials for the course.",
                                                    "extra_time_commitment":  "Students will independently and collaboratively read assigned texts, write responses, analyze published texts, and create presentations. Weekly in-class commitment is 3 hours; weekly out-of-class work expectation is 1.5 hours."
                                            }
}