{
        "code":  "76-716",
        "name":  "M.A. Professionalization Seminar",
        "short_name":  "MA PRFSSNZTN SEMINAR",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This six week mini introduces MA students to practicing professionals in academia and other nonacademic careers to talk informally about their professional journeys, preprofessionalization, workplace experience and expectations as well as advice for how to apply the skills they gain in the humanities to careers within and beyond academia. Not only will this course provide informal networking opportunities but students will spend time workshopping their C.V.s and resumes. Students will also examine and practice generating texts for professional development, for example a statement to a PhD admissions committee.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The course aims to professionalize students in preparation for a PhD andor a career outside the academy. Throughout the course, student will 1 identify and evaluate different career trajectories available to MAs 2 analyze academic and nonacademic genres, and gain practical familiarity with some of the genres they will need in their graduate schooling and careers 3 generate persuasive texts for the purposes of getting into a PhD program or pursuant to a career in AltAc 4 apply principles of effective professional communication, developing writing skills that are transferable to both academic and nonacademic settings and 5 demonstrate knowledge of major concepts of rhetorical theory and analysis including audience, purpose, context, exigence, constraints, credibility, and genre and their roles in effective professional communication.",
                                                    "key_topics":  "professionalization, academic and non-academic careers, writing skills",
                                                    "prerequisite_knowledge":  "No prior knowledge is necessary, though students are expected to have a CV or resume upon entering the class.",
                                                    "assessment_structure":  "The course is pass/ fail. Assignments include the following: 1) Online Tutorial on Document Design; 2) Discussion Board Posts; 3) Research Project on PhD Programs; 4) Research Project on Non-Academic Jobs; 5) Revision of CV and Resume; 6) Drafts and Revisions of Personal Statement for PhD program; 7) Drafts and Revisions of Job Application Cover Letter; 8) Final Portfolio with Reflection",
                                                    "relevance":  "The course is relevant to MA students in Rhetoric and LCS who want to construct and get feedback on professional materials (CV, resume, job application letters). More generally, it gives students a chance to prepare for different career trajectories, considering how their time at CMU may prepare them for different kinds of work.",
                                                    "learning_resources":  "Readings will be provided on Canvas; other resrouces include writing tutorials and guest speakers.\nReadings will be provided on Canvas; other resrouces include writing tutorials and guest speakers",
                                                    "extra_time_commitment":  "no extra time commitments other than reading and completing assignments"
                                            }
}