{
        "code":  "76-789",
        "name":  "Rhetorical Grammar",
        "short_name":  "RHETORICAL GRAMMAR",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This is a course in This is a course in fundamental grammatical structures of English and how these structures fit into the writers toolkit. This means you will learn a lot about Englishlanguage grammar in this course en route to understanding a lot about English language writing. This course is designed for MA students in professional writing and undergraduates who want to improve their grammar, their writing, and their depth of understanding of how improvement in grammar impacts improvement in writing.grammatical structures of English and how these structures fit into the writers toolkit. This means you will learn a lot about Englishlanguage grammar in this course en route to understanding a lot about English language writing. This course is designed for MA students in professional writing and undergraduates who want to improve their grammar, their writing, and their depth of understanding of how improvement in grammar impacts improvement in writing.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  "http://www.cmu.edu/dietrich/english/index.html",
        "custom_fields":  {
                                                    "goals":  "Understand the basic structures of English grammar at the word, phrase, clause, and discourse level Identify grammatical features and patterns in examples of realworld language use Use relevant vocabulary for discussing and analyzing such features and patterns Understand some of the fundamental processes and features of language variation and change Understand more clearly your own linguistic practices Apply grammatical concepts appropriately and effectively to the description of rhetorical practices in your area of professionalresearch interest.",
                                                    "key_topics":  "English grammar; language variation and change; genre; real-world language use",
                                                    "prerequisite_knowledge":  "No prior knowledge of grammar is necessary",
                                                    "assessment_structure":  "assignments, quizzes, project",
                                                    "relevance":  "It will help students become more aware and reflective of their own writing practices, as well as the communicative expectations in a variety of contexts.",
                                                    "learning_resources":  "web pages, learning applications, corpora",
                                                    "extra_time_commitment":  null
                                            }
}