{
        "code":  "76-715",
        "name":  "Shakespeare: Tragedies \u0026 Histories",
        "short_name":  "SHAKESPR TRGD \u0026 HIST",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "For F24 only In the closing decades of the sixteenth century, enterprising cultural producers in early modern London began to develop a new commercial venture called playing a business that offered ordinary people a few hours of dramatic entertainment for the price of one penny. In addition to watching the professional players onstage, spectators also participated in a form of play themselves in a sense because theatrical experience provided a unique opportunity to engage imaginatively with otherwise inaccessible people, worlds, and ideas. More than four hundred years later, the drama of the period now ranks among the most esteemed texts in all English literature, and the name Shakespeare has become a byword for literary genius. This course will offer an overview of Shakespeares tragedies and histories. As we read through a selection of key works, we will endeavor to understand what, and how, they meant in their original context, thereby developing a historically informed perspective on their influence over our own cultural landscape. The course counts toward the GenEd requirement, and is also part of the CMU Prison Education Project. Classes will take place at Somerset State Correctional Institution. CMU students will study alongside incarcerated students. A bus will provide transport for the students from CMU. Students will have to fill out a brief questionnaire before enrolling. For further details, see httpswww.cmu.edudietrichstudentsundergraduateprogramspepindex.html",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students at the end of the course should be able to a Discuss Shakespearean comedy and romance from a variety of perspectives, including historically, politically, aesthetically, and generically. b Frame and reframe fundamental questions who, what, where, when, why, and how in order to interpret Shakespearerelated issues, objects, and events. c Select and interpret materials that enrich inquiry, such as archival records, media sources, literary texts, letters, journals, official documents, images, etc. d Analyze passages from Shakespearean comedies and romances both as poetry to be read and drama to be performed. e Consider how thinking about Shakespeare has developed and situate their own way of thinking in relation to such traditions. f Write critical commentary on Shakespearean drama.",
                                                    "key_topics":  "For F24 only: In the closing decades of the sixteenth century, enterprising cultural producers in early modern London began to develop a new commercial venture called \u0027playing\u0027: a business that offered ordinary people a few hours of dramatic entertainment for the price of one penny. In addition to watching the professional players onstage, spectators also participated in a form of play themselves (in a sense) because theatrical experience provided a unique opportunity to engage imaginatively with otherwise inaccessible people, worlds, and ideas. More than four hundred years later, the drama of the period now ranks among the most esteemed texts in all English literature, and the name \u0027Shakespeare\u0027 has become a byword for literary genius. This course will offer an overview of Shakespeare\u0027s tragedies and histories. As we read through a selection of key works, we will endeavor to understand what, and how, they meant in their original context, thereby developing a historically informed perspective on their influence over our own cultural landscape. The course counts toward the GenEd requirement, and is also part of the CMU Prison Education Project. Classes will take place at Somerset State Correctional Institution. CMU students will study alongside incarcerated students. A bus will provide transport for the students from CMU. Students will have to fill out a brief questionnaire before enrolling. For further details, see: https://www.cmu.edu/dietrich/students/undergraduate/programs/pep/index.html",
                                                    "prerequisite_knowledge":  "For F24 only: In the closing decades of the sixteenth century, enterprising cultural producers in early modern London began to develop a new commercial venture called \u0027playing\u0027: a business that offered ordinary people a few hours of dramatic entertainment for the price of one penny. In addition to watching the professional players onstage, spectators also participated in a form of play themselves (in a sense) because theatrical experience provided a unique opportunity to engage imaginatively with otherwise inaccessible people, worlds, and ideas. More than four hundred years later, the drama of the period now ranks among the most esteemed texts in all English literature, and the name \u0027Shakespeare\u0027 has become a byword for literary genius. This course will offer an overview of Shakespeare\u0027s tragedies and histories. As we read through a selection of key works, we will endeavor to understand what, and how, they meant in their original context, thereby developing a historically informed perspective on their influence over our own cultural landscape. The course counts toward the GenEd requirement, and is also part of the CMU Prison Education Project. Classes will take place at Somerset State Correctional Institution. CMU students will study alongside incarcerated students. A bus will provide transport for the students from CMU. Students will have to fill out a brief questionnaire before enrolling. For further details, see: https://www.cmu.edu/dietrich/students/undergraduate/programs/pep/index.html",
                                                    "assessment_structure":  "There will be both graded and ungraded assignments in this course. Ungraded assignments are low-stakes, but required. They will occasionally be assessed informally on a check, check-plus, check-minus basis. Graded assignments are varied in order to focus on and build specific skills.",
                                                    "relevance":  null,
                                                    "learning_resources":  "All the plays and supplementary materials will be provided on Canvas. Students will also watch streaming video of productions available through the CMU libraries.",
                                                    "extra_time_commitment":  "round-trip travel time from CMU campus to SCI-Somerset"
                                            }
}