{
        "code":  "76-746",
        "name":  "Angels and Diplomats: Renaissance Poetry from Wyatt to Milton",
        "short_name":  "RENAISSANCE STUDIES",
        "units":  12.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The starting point for this course is a question at the nexus of theology, politics, and art that no less central to the age of Shakespeare and Milton than it is today how should power be represented Biographically, many canonical poets of the sixteenth and seventeenth centuries worked as ambassadors, representing power abroad Wyatt, Sidney, Donne, Marvell. Many more poets including Shakespeare and Milton thematized diplomacy, in both its divine and more worldly forms. What, then, can structures of mediation like diplomacy and angelic intervention tell us about works like Sidneys sonnet sequence Astrophil and Stella, Shakespeares Hamlet, or Miltons Paradise Lost And what can Renaissance poetry tell us about topics such as sovereignty, immunity, license, fidelity, automation, and accommodation The course will include introductory and contextual readings from Genesis, PseudoDionysius, John Calvin, Thomas Hobbes, Alberico Gentili, and George Puttenham. Assignments and class discussions will be occasions to practice historicallyinformed criticism to compare conceptual structures within seemingly distinct domains of history and thought and to articulate major fissures and changes in Renaissance angelology, diplomatic practice, and literary craft.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}