{
        "code":  "76-728",
        "name":  "Visual Verbal Communication",
        "short_name":  "VISUAL VERB COMM",
        "units":  12.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "People create a wide range of communicative artifacts that integrates visual and verbal elementsnewsletters, product brochures, web pages, graphical novels, journal articles, resumes, software references, yellow stickies, etc. Yet, such visualverbal discourse has only recently attracted the serious attention of research communities. Some of the relevant research questions include Why do visual variations exist across different contexts e.g., Popular science looks different from Discover. Why and how do visual styles change over time e.g., Magazines from the 1950s dont look like present day magazines. Do visual elements have persuasive power If so, what roles do they play in shaping an argument How do people learn to communicate using visualverbal artifacts In this seminar, we will address these and other questions through readings and discussions on various threads of studies around the analysis of communicative artifacts that integrate visual and verbal expressions. We will review key research publications concerning visualverbal communication from relevant disciplines, including professional  technical communication, rhetoric, argumentation, and literacy. Particular attention will be paid to descriptive methods e.g., socialsemiotic analysis, visual argument, and rhetorical structure theory and the types of questions these methods can help us answer. Throughout the semester, students will be encouraged to explore the visualverbal communication artifacts found around them and use those to connect class discussions to the practice of design. Required assignments include a brief biweekly response to the readings, several short analysis papers, and a longer term paper with a topic chosen by students based on their professional or research interests.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  "http://www.cmu.edu/dietrich/english/index.html",
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}