{
        "code":  "76-739",
        "name":  "Topics in Film and Media",
        "short_name":  "TOPICS IN FILM/MEDIA",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Topics vary by semester. Spring 2022 Topics vary by semester. Spring 2022 South Asian Cinema Bollywood  Beyond  The course will examine the various film cultures of South Asia. It will provide a historical overview of the development of the many film industries in South Asia. It will also highlight the social and political implications of these cinemas. The course will introduce students to a wide range of films and film genres from South Asia, including popular Bollywood films, regionalnational cinema, arthouseparallel cinema, indiemultiplex cinema, and diasporic films. It will enable students to build a cinematic and cultural vocabulary to engage with popular culture, particularly cinema, from nonWestern contexts. The course will familiarize students with some of the significant debates and issues in South Asian cinema, such as the role of cinema in the postcolonial state, cinema and the formation of national identity, debates on realism and melodrama, the significance of the song and dance numbers, and the nature of film censorship. It will conclude with the global travels and visibility of Bollywood films, especially its popular and scholarly reception and impact on society.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}