{
        "code":  "76-748",
        "name":  "Academic Writing \u0026 Communication for Graduate Students",
        "short_name":  "AC WRTNG \u0026 COMM GRAD",
        "units":  4.5,
        "min_units":  4.5,
        "max_units":  4.5,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course introduces graduate students to qualities of discourse and argumentation, genre, and rhetorical conventions common to academic and scholarly communication.  Areas of focus include genre awareness and knowledge, claim structure and rhetorical moves, discourse analysis, and rhetorical flexibility.  Attention is given to elements of formal writing, oral presentation, and visual design such as clarity, concision, and coherence. Students will create effective communications, ethically incorporating sources while establishing their own voice and contribution to an academic community.  They will also identify strategies to critically engage and analyze scholarly texts.  Skills acquired in this course will help prepare students for participation in their disciplinary discourse communities in graduatelevel studies and beyond. Unlike 76745, this course does not focus on ESL communication features.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Expand their rhetorical flexibility in a variety of academic genres,Identify and produce texts that exhibit valued structures, organizations, and styles of their specific discipline,Acquire discourse and genre analysis skillsCreate clear, concise, and coherent communications in written, oral, and visual modes.",
                                                    "key_topics":  "academic research genres; graduate-level written, oral, and visual communication; discourse and genre analysis",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "class discussions, short written responses to readings, essay, oral presentation with visual element, database research, group project (discourse and rhetorical analysis and reflective memo)",
                                                    "relevance":  "This course offers graduate students at any stage of their program the opportunity to learn and practice conventional features of writing, speaking, presenting research, and other academic and scholarly communication tasks.",
                                                    "learning_resources":  "Materials, texts, and online tools will be available to students within Canvas and the CMU library. Students will not purchase materials for the course.",
                                                    "extra_time_commitment":  "Students will independently and collaboratively read assigned texts, write responses, analyze published texts, and create presentations. Weekly in-class commitment is 3 hours; weekly out-of-class work expectation is 1.5 hours."
                                            }
}