{
        "code":  "76-740",
        "name":  "American English",
        "short_name":  "AMERICAN ENGLISH",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Ever since the development of radio in the early 20th century, Americans have expected that we would soon all talk alike. The conviction that the media would make us all sound the same revived with the widespread adoption of television, starting in the 1940s, and the development of the internet in the 1990s led to worry about how soon wed all be writing the same. But fears of the homogenizing effects of the mass media on American English have proven to be exaggerated Americans still talk and write in many different ways. In this course we explore why this should be. Why dont we all speak alike Why do we need variation in language We will explore how regional and social dialects and varieties come to be and what their functions are, and you will learn how to hear, see, and describe varieties of language. We will also touch on American languages other than English. Documentary films and online materials about language will be the basis for another strand of the course, as we work together to explore how linguistic variety can best be represented and explained in nontechnical ways, and in a variety of media, for the general public. Reading will be mainly in two books American English, by Walt Wolfram and Natalie SchillingEstes 2nd. edition, and Language in the USA Themes for the TwentyFirst Century, edited by Edward Finegan and John R. Rickford. There will be regular homework assignments, a midterm exam, and a final project.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}