{
        "code":  "76-766",
        "name":  "Essay Writing Workshop",
        "short_name":  "ESSAY WRIT WORKSHOP",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In this course we will analyze the different types of narrative structure, narrative suspense, voice, metaphor, and point of view that make for effective nonfiction writing. We will also examine the difference between good writers and good work, the functions of objective distance from and intimate investment in a subject, as well as the philosophical questions spurred by nonfiction writing. What is the nonfiction writers role, and how does it differ from that of the fiction writer Where do the two genres overlap What gives nonfiction writing integrity What does the term creative nonfiction mean How have the form and aims of nonfiction writing  from memoir to essays to longform journalism  evolved for better and for worse   We will scrutinize the writing of Eula Bliss, Kate Fagan, Joan Didion, James Baldwin, Jo An Bear, Gary Younge, David Foster Wallace, Umberto Eco, and many others. In addition to critical writing assignments, students will have several opportunities to write their own nonfiction pieces.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  "http://www.cmu.edu/dietrich/english/index.html",
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}