{
        "code":  "76-788",
        "name":  "Coding for Humanists",
        "short_name":  "CODING FOR HUMANISTS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [
                                            {
                                                    "code":  "15-110",
                                                    "id":  5635,
                                                    "name":  "Principles of Computing",
                                                    "units":  10.0
                                            },
                                            {
                                                    "code":  "15-112",
                                                    "id":  5637,
                                                    "name":  "Fundamentals of Programming and Computer Science",
                                                    "units":  12.0
                                            }
                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course provides students with the foundational knowledge and skills to develop andor utilize computeraided research tools for text analysis. Through a series of handson coding exercises, students will explore computation as a means to engage in new questions and expand their thinking about textual artifacts. This course is designed for students with no, or very little, coding experience. So, if you have already taken a programming course, this course is most likely not for you. Students who have taken 15110 andor 15112 may not take this course. For the final project, you will develop a small research project involving a computational analysis of a corpus of texts. You will plan, design, and write a computer program that processes and analyzes a textual corpus of your choice. Students who are taking the course for 9unit will write a brief project report 35 pages that summarizes your final project. Graduate students in the MA in RhetoricPhD programs must register for 12unit, and will complete a research paper 4,0005,000 word.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of this semester, You will be able to write your own basic yet useful computational tools for text analysis project of your own.You will be able to use the basic vocabulary and concepts of coding e.g., basic data representations and algorithms that allow you to read and talk about computer programs.You will be able to evaluate and use welldocumented open source programs and software packages written in Python.You will have learned enough coding skills to read more advanced Python textbooks to further build your coding skills for projects in your area of interest.You will have learned enough coding skills to learn other programming languages relatively easily.This course is not a comprehensive course that introduces you to fundamental principles of computing or software development. This course focuses on practical coding skills for humanities students who are interested in creating their own simple computational tools for their projects, or gaining introductory experience with programming through text analysis.",
                                                    "key_topics":  "During the early part of the semester, students will learn basic programming using Python through examples and problem sets that are relevant to text analysis. Then, students will be introduced to a limited set of commonly used Python packages for text analysis, such as natural language processing, statistical analysis, visualization, web scraping, and social media text mining.",
                                                    "prerequisite_knowledge":  "This course is designed for students with no (or very little) coding experience, but who have taken courses that require critical / analytical thinking.",
                                                    "assessment_structure":  "7 Coding Lab Exercises; Mid-term Project; Final Project + Report",
                                                    "relevance":  "Dietrich GenEd Prior to Fall 2021: Modeling - Other\n\nDietrich GenEd After Fall 2021: Computational Thinking\n\nThis introductory course provides humanities students with the foundational knowledge and skills to develop computer-aided research tools for text analysis. Through a series of hands-on coding exercises, students will explore computation as a means to engage in new questions and expand their thinking about textual artifacts.\n\nStudents are expected to complete a small final project that examines how evidence-based data-driven insights derived from text analysis would support humanistic research in their area of interest, including (but not limited to) genre studies, rhetorical criticism, authorship attribution, discourse analysis, cultural analysis, social network analysis, spatial/temporal text analysis, and writing assessment.",
                                                    "learning_resources":  "Interactive Textbook\nSample programs\nCanvas\nAll software utilized is freely available.",
                                                    "extra_time_commitment":  "Graduate students taking the course for 9 units are expected to spend about 6 hours per week on homework assignments. Graduate students taking the course for 12 units are expected to spend about 9 hours per week on homework assignments."
                                            }
}