{
        "code":  "76-720",
        "name":  "Leadership \u0026 Organizational Communication",
        "short_name":  "LDRSHP \u0026 ORG COMM",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Please note In order to register for this course, students must have had an internship with an organization prior to registration.  Even as most organizations continue to change, one constant is the importance of effective communication. Upward, downward, and lateral communications are the lifeblood of organizations. If you are in a leadership position, communication become your key tool for managing teams, improving performance, and creating change. In any position, you can spearhead progress by designing effective documents and improving existing communication practices. Proficiency in written and oral communications tends to be recognized and rewarded in organizations. Combined with the ability to leverage formal organizational structures and social networks, it helps one excel, and thrive, in organizations. This course is designed as an overview to the field of organizational communication with an emphasis on leadership roles and behaviors. The content will blend the conceptual with the practical. It will focus on problems that are likely to arise in the workplace and ways to solve them through communication. The students will build a portfolio of solutions that will demonstrate their evolving skills of applying rhetoric in organizational contexts. Specific topics will include the attributes of great communicators including leaders and managers as communicators, the challenges of communicating in organizations as we play particular roles e.g., individual contributor, manager or team member, ways to build credibility and enhance internal resumes, and techniques to master communication requirements related to performance management processes, conflict situations, and changing organizational culture and design. We will also explore a myriad of organizational issues such as communicating across generations and cultures, communicating externally, and communicating through technology.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}