{
        "code":  "76-758",
        "name":  "Rhetoric \u0026 Storytelling",
        "short_name":  "RHET \u0026 STORYTELLING",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "What are stories and why do we tell them What purpose do they serve What makes a story true What effect do stories have on those who hear them In this course, we will ask how narratives work rhetorically to shape how we perceive and encounter events, movements, places, and experiences. Students can expect to read and discuss narrative theories and practice employing these theories to analyze story artifacts, such as written collections, political speeches, newspaper articles, curated experiences, and oral histories. We will begin the semester by exploring and analyzing the many stories surrounding September 11 but will also consider the stories that infuse recent or local subjects of interest. Students will investigate the effect these and other narratives have on contemporary contexts. Any student who is interested in developing a critical awareness of the rhetorical power of storytelling and enhancing their analytical toolkit will benefit from this course.  Most class sessions will involve guided student discussions of theoretical texts as well as collaborative opportunities to analyze story artifacts. Weekly assignments will include short analyses and reflection activities. The course will culminate in a final project where students will select and analyze a collection of stories within a cultural, social, andor historical context.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}