{
        "code":  "76-725",
        "name":  "Intertextuality",
        "short_name":  "INTERTEXTUALITY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "What do we mean when we say that someone has twisted our words, or that our words have been taken out of context Why is Martin Luther King Jr. best remembered for saying, I have a dream, and not for saying, War is the greatest plague that can affect humanity What are political talking points and how are they perpetuated How does a claim unfounded or not become a fact How does a fact become a myth These are just some of the questions that we will consider. More specifically, this is a course in how meaning changes as texts created in one context and for specific purposes are repeated, cited, and used in other contexts and for other purposes, sometimes related and relevant, sometimes not. More technically, well be focusing on the rhetorical nature of intertextual discourse. Our goal will be to examine the ways that people of all kindsincluding politicians, journalists, and scientistsstrategically draw upon and transform the statements, arguments, and evidence of other people to promote their own viewpoints or purposes. We will begin by investigating scholarship that views language as an extended conversation in which people struggle to have their own voices heard, and other voices countered or even suppressed. Later, we will survey a number of studies that suggest how individuals and organizations recontextualize and reinterpret prior discourse for persuasive ends. More specifically, we will analyze how the microfeatures of the language for example, qualifications, evaluations, and attributions are used to persuade audiences that certain assertions are not factual, that certain speakers are not authoritative, and that certain proposed actions are undesirable. Ultimately, you can conduct your own research on intertextual rhetoric on a topic of specific interest to your academic or professional goals.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Explain the theories of language that justify an intertextual perspective Define and illustrate key concepts in intertextuality e.g. dialogism, heteroglossia, etc. Conduct various intertextual analyses, focusing on voice, dialogicality, recontextualization, and intertextual chains. Learn defensible methods of intertextual investigation drawn from rhetoric and discourse studies. Produce an original study or argument that engages with scholarship on intertextuality",
                                                    "key_topics":  "rhetoric, discourse analysis, reported speech, evaluative language, stance, politics",
                                                    "prerequisite_knowledge":  "Students must have a basic understanding of English language.",
                                                    "assessment_structure":  "4 intertextual analyses\n1 quiz\n1 test\n1 final paper",
                                                    "relevance":  "The course is designed for people interested in rhetoric, including students in the rhetoric program, professional writers, and anyone else interested in how language has an impact on society. Primarily, the course teaches methods of analysis that can help these populations make sense of political, media, and scientific discourse.",
                                                    "learning_resources":  "Students will have access to several resources, including articles and essays, methodological tools, the course webpage on Canvas, and more.",
                                                    "extra_time_commitment":  null
                                            }
}