{
        "code":  "76-782",
        "name":  "Media: Past, Present, and Future",
        "short_name":  "MED: PAST, PRES, FUT",
        "units":  12.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In the late 1700s moral crusaders were worried about the latest media scandal the surge in women reading novels. As one observer complained, Women, of every age, of every conditionretain a taste for novels. I find [novelsin the workbag of the seamstress, in the hands of the lady who lounges on the sofa, the mistresses of nobles, the mistresses of snuffshops, the belles who read them in town, and the chits who spell them in the country. While today we might be genuinely concerned about texting while driving, or the depression associated with high levels of facebook use, in this class we wont judge so much as we will analyze. We will look at what historical media trends have in common with, and how they are different from, the media trends of today. We will read about the print revolution, the electronic media revolution, the current digital revolution, and we will also try to peer into the future. Importantly, we will take a literary and cultural studies approach to this material. We will ask, specifically, what can the Humanities teach us about media revolutions over time How is narrative, or story telling, central to each media revolution",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}