{
        "code":  "76-755",
        "name":  "Leadership, Dialogue, and Change",
        "short_name":  "LEADRSHP DIALG CHNG",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course offers an alternative to the great man theory of leadershipin which success is built on charisma, power, status, or institutional authority. The contemporary model of adaptive leadership, however, depends on an ability to draw a divided community into a dialogue that reframes the problem and may even call on us to reinterpret our values. We will see this in action, comparing the methods of Martin Luther King to the radical community organizing of Saul Alinsky, and in the influential of AfricanAmerican cultural critiques of Cornel West and bell hooks, and in the work of students calling for change on campuses. All this work poses a question how does dialogue work in the rhetoric of making a difference   So in the second half, we put theory into practice, organizing a CMU Community Think Tank on a campus issue, in this case on student empowerment will learn strategies for analyzing a problem, framing, issues, giving rhetorical presence to those problems and creating counterpublics that put new ideas into circulation. The class collects data across diverse, often competing perspectives, to create a Briefing Book, that will guide your live Round Table problemsolving dialogues, and then document, write and publish your Findings www.cmu.eduthinktank.  Aa a portfolio project it will demonstrate your ability to support problemsolving dialogues across difference in a community or organization.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "You will be able to see and evaluate your own leadership style thought a new theoretical lens.\nLearning that tests theory in practice will give you a big advantage making an adaptive transfer to new situations\nAnd you will develop skill to both organize problemsolving dialogues, as well as combine good data collection with persuasive, engaging writingto put their ideas into circulation.",
                                                    "key_topics":  "Models of leadership and how to make a difference. Rhetorical theory and practice. Problem-solving strategies for writing. Creatively documenting a dialogue. Organizing a community think tank.",
                                                    "prerequisite_knowledge":  "no requirements.",
                                                    "assessment_structure":  "A brief analysis of a leadership experience . A mid term paper applying theories of leadership to a problem. A group project developing your Community Think Tank and Findings. A final reflection on how you have put your learning to use outside of the class.",
                                                    "relevance":  "For students drawn to dealing with social or organizational issues through problem-solving dialogues, you will be learning rhetorical strategies that value difference, empower the often unheard, and use conflict as a tool for inquiry that opens options.\n\n\n\n\n\nFor students in rhetoric: you will get to read theories of leadership and rhetorical methods by major writers\n\n\n\n\n\nFor students interested in effective organizational communication, you will get to explore some tested strategies",
                                                    "learning_resources":  "Texts on Canvas\n\nGuides for organizing a Think Tank and other strategies",
                                                    "extra_time_commitment":  "Outside of collecting your interviews and a few group meetings, much of that work is in class."
                                            }
}