{
        "code":  "76-803",
        "name":  "Psychoanalysis",
        "short_name":  "PSYCHOANALYSIS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Michel Foucault calls psychoanalysis, along with Marxism, one of two major discursive practices, in the modern world. Paul Ricoeur calls it, along with Marxism, one of the two main forms of the hermeneutics of suspicion. While psychoanalysis went through a period of disrepute ending in last decade, it has seen a revival of interest in literary and cultural studies in recent years. This course will take historical view psychoanalysis, considering it as theory, as practice, and as a cultural influence that goes beyond either of these. We will start with Freud and consider various Freudians up through the 1970s and 1980s, including Marxist, feminist, queer, and other heterodox contributors. The approach will be critical without being dismissive, attempting to understand the value and influence of this intellectual orientation without ignoring its blindnesses and failings.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "To understand the basic tenets of psychoanalysis as well as its history, and major variations within the general Freudian campl",
                                                    "key_topics":  "Freud, Lacan, the practice of psychoanalysis, the history of psychoanalysis, feminism, textual interpretation",
                                                    "prerequisite_knowledge":  "Students should have some knowledge of Theory, but specicific knowledge of psychoanalysis is not expected.",
                                                    "assessment_structure":  "Regular informal writing, class participation, a short paper, and a seminar paper.",
                                                    "relevance":  "Students will learn one of the most influential theories in the humanites.",
                                                    "learning_resources":  "Some readings will be on Canvas. Textbooks will be required.",
                                                    "extra_time_commitment":  "Reading and writing."
                                            }
}