{
        "code":  "76-809",
        "name":  "Writing Research for Graduate Students",
        "short_name":  "WRT RESRCH GRAD STDT",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course, open to all graduate students who consider themselves second language writers in English, prepares students to write about their research for academic audiences and to write for the professional workplace.  Students who enroll in this course should be preparing to enter the scholarly discourse of their disciplines.  As such, the course welcomes students from a variety of disciplines.   In the course, students will encounter researchbased instruction on  various organizational patterns for clearly and effectively communicating.  They will also analyze genres from their specific disciplines, as a way to develop explicit strategies for their own writing.  Moreover, students will then employ those strategies within their own writing.  In the course, students will write  several drafts, receive feedback from their peers and from the instructor, as well as engage in discussions that enable them to position their writing in relation to other types of writing in their disciplines.  Students who wish to enroll should check first with their advisor.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}