{
        "code":  "76-895",
        "name":  "Other People\u0027s Words: The History, Theory, and Practice of Interviews",
        "short_name":  "OTHER PPL\u0027S WORDS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In literary studies, we usually draw our research from books and articles, or sometimes from documents in archives. But one other way to find out information is from interviews. Historians, anthropologists, and journalists use interviews, albeit in different ways. How might we apply their methods to literary study This course will look at different modes of interviewing. You will also conduct various kinds of interviews yourselves. Thus the course will be a mix between a criticism course and a workshop. Through the semester you will be responsible for conducting and editing one longform interview with a person about art, literature, or another field. In addition, you will develop a project conducting multiple interviews on a topic. Lastly, you will build a portrait or report drawn from one of those projects.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "One goal is scholarly to gain knowledge of different kinds of interviews and their history and use. Another is practical As in a workshop, students will learn how to do long and short interviews. In addition, they also will learn to draw reports or profiles from their interviews and other research.",
                                                    "key_topics":  "Interviewing; literary interviews; ethnography; oral history",
                                                    "prerequisite_knowledge":  "Some knowledge of methods in contemporary criticism and theory",
                                                    "assessment_structure":  "From their projects--like a workshop, the course will revolve around the interviews they conduct and projects they develop",
                                                    "relevance":  "It studies a major literary genre, but one that is rarely studied in literature departments. It also encourages a cultural studies approach in seeking to understand culture through alternative methods like ethnography.",
                                                    "learning_resources":  "Canvas pages with a wide range of readings on the history, practice, and theory of interviews.",
                                                    "extra_time_commitment":  "Beyond regular reading, the course might take extra time to conduct, transcribe, and edit interviews and reports."
                                            }
}