{
        "code":  "76-815",
        "name":  "Mediated Power and Propaganda",
        "short_name":  "PWR \u0026 PROPAGANDA",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "For most of us, the word propaganda triggers a familiar script. We tend to think of totalitarian regimes where the State controls information and prohibits the expression of dissenting views. We also tend to associate propaganda with certain rhetorical techniques  highly emotional words, deceptive representations, and glittering generalities that inhibit rational thought and manipulate public opinion. According to such popular views, propaganda is linked to the dissemination of false information and is antithetical to the norms of democratic society. Our class will challenge these assumptions. First, instead of confining propaganda to authoritarian governments, we will examine how propaganda functions within democratic society. Indeed, we will focus on domestic propaganda in America, especially political propaganda but also propaganda in advertising and public relations. Next, instead of focusing exclusively on deceptive rhetorical techniques, we will ask a more elemental question What enables propaganda to circulate Answering this question will force us to consider the routines and values of corporate media as well as the power relations that give some people special access to channels of mass communication. Certainly, we will also examine propaganda messages themselves, attending to manipulative tactics as well as rhetorical strategies used to induce uptake in the mainstream press. We begin our seminar by studying key theories of propaganda, looking at primary texts for various definitions and criticisms of the concept. We will then examine how powerful institutions, especially media organizations, manage the dissemination of propaganda in democracies. Finally, we will consider how to analyze propaganda, generating methodological prerequisites for scholarly study. Ultimately, students will have the opportunity to conduct their own research on propaganda as it relates to their academic and professional goals.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "After the course, students will be able to explain what propaganda is, defining and illustrating key propaganda concepts and techniques. They will also be able to analyze propagandashowing how it works and contributing new knowledge about it to scholarly communities. Finally, students will leave the course with critical media literacy skills that will help them interpret the discourse that surrounds them.",
                                                    "key_topics":  "propaganda, manipulation, repetition, politics, discourse",
                                                    "prerequisite_knowledge":  "The course focuses on American propaganda, so prior knowledge of American history, politics, and culture is necessary. Students should also be familiar with methods of rhetorical and discourse analysis.",
                                                    "assessment_structure":  "Students will write several short papers defining and analyzing propaganda throughout the semester. They will also write a long term paper about a particular case of propaganda. In addition, they will be assessed on their interaction with course texts--they will summarize readings, and asking and answer questions about them both in and outside class.",
                                                    "relevance":  "The course is relevant to students who are interested in rhetoric and discourse analysis, and particularly to those students who want to examine how propaganda functions in media. We will explore what propaganda is and how it works, and have conversations about whether or not it is a good thing.",
                                                    "learning_resources":  "Most course readings and several analytic resources will be made available to students via the class website.",
                                                    "extra_time_commitment":  "As in any 400/800 class, students can expect several hours of work per week outside of class. There are no required meetings or events outside of class hours, but students are advised to meet with their professor, especially as they develop their final projects."
                                            }
}