{
        "code":  "76-890",
        "name":  "Digital Rhetorics",
        "short_name":  "DIGITAL RHETORICS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "As most of the communication now takes place using digital technologies such as GenerativeAI, blockchain, AR and VR, and the Internet of Things, the nature of public speech has been fundamentally transformed in these environments. This course explores the connection between rhetoric, sociopolitical systems and digital media. In todays world, it is difficult to separate digital from human. Students in this class will examine a variety of digital media as they intersect with humans as well as with theories of rhetoric. Students will also have the opportunity to explore digital technology by actively participating in digital spaces and creating digital artifacts. The course provides in depth coverage of rhetoric as an historically rooted but evolving humanistic perspective covering argumentation and figuration, performance and text, and delineating its connections to logic, aesthetics, politics, and ethics.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "This course will introduce students to key theories of rhetorical analysis of digital technologies to help them interrogate and explicate different genres of digital media technologies.",
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  "No prerequisites. But some prior knowledge of rhetoric and ability to synthesize complex texts with instructor support is recommended.",
                                                    "assessment_structure":  "Reading responses, in-class discussions, development of a multimodal project to demonstrate understanding of rhetorical concepts, class presentations and final essay.",
                                                    "relevance":  "Students are surrounded by digital technologies. This course will provide them the vocabulary to examine and critically analyze the technologies in a more constructive manner and relay their analysis using appropriate rhetorical constructions.",
                                                    "learning_resources":  "All readings will be provided in class, on-campus site-visits will be planned for one unit on visual rhetoric",
                                                    "extra_time_commitment":  "Students are expected to spend about 4-6 hours per week on readings, homework and assignments."
                                            }
}