{
        "code":  "76-882",
        "name":  "History of Rhetoric: The Classical Age and Its Legacy",
        "short_name":  "HISTORY OF RHETORIC",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Spring 2024 The Classical Age and Its Legacy This class surveys a number of key concepts from canonical texts within the classical tradition of European rhetorical thought, beginning in antiquity with the Greek sophists, Plato, and Aristotle, then moving to treatises of Cicero and Quintilian from ancient Rome, before tracing the influence of the concepts developed by these figures in the Medieval and Renaissance periods. Alongside canonical texts from the classical period, we will also read contemporary scholars and theorists who have examined andor reappropriated their concepts in their work. Thus, we will seek to align canonical texts with contemporary adaptations and scholarship. The course is designed to provide you with a foundational knowledge of the classical rhetorical traditionits themes, controversies, and evolutionto prepare you to situate your own scholarship and teaching in relation to the history of rhetoric and to teach a history of rhetoric course in your future careers. Ultimately, the course will challenge you to produce an original research study that investigates some aspect of the classical tradition or use historical concepts to understand contemporary rhetoric.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Identify and describe key concepts from ancient Greek and Roman rhetoric that have influenced European rhetorical theory explain major achievements, tensions, and controversies in the history of classical European rhetoric describe the social and cultural factors that influenced the development and adoption of classical European rhetorical theory at various historical moments examine contemporary rhetorical scholarship that historicizes andor reappropriates texts from the classical tradition of European rhetorical thought produce and support an original scholarly paper that applies concepts from the classical tradition of European rhetorical thought to contemporary circumstances, reappropriates or reimagines classical rhetorical theory, or advocates for the inclusion of an overlooked concept, text, or figure from the classical period in the history of rhetorics corpus develop skills of critical analysis, research, and writing",
                                                    "key_topics":  "Classical Rhetoric, Rhetorical Theory, Rhetorical Pedagogy, Greece, Rome, Sophists, Protagoras, Gorgias, Plato, Aristotle, Cicero, Quintilian, Augustine, Ramus",
                                                    "prerequisite_knowledge":  "Some general familiarity with Rhetoric as a discipline will be helpful.",
                                                    "assessment_structure":  "Perusall annotations of assigned readings and replies to annotations; short writing assignments that derive from classical rhetoric; oral reading response presentations delivered in class; abstract and narrative bibliography that summarizes your term paper\u0027s central question and contribution to existing scholarship on the history of rhetoric; conference-style paper and oral reading presentation of your term project in class; a final research paper about the classical rhetorical tradition; attendance and participation",
                                                    "relevance":  "The course is designed to provide rhetorical scholars with a foundational knowledge of the classical rhetorical tradition, its themes, controversies, and evolution, to prepare them to situate their own scholarship and teaching in relation to the history of rhetoric and to teach a history of rhetoric course in their future careers.",
                                                    "learning_resources":  "Several required texts must be purchased, but most will be made available on Canvas and Perusall.",
                                                    "extra_time_commitment":  null
                                            }
}