{
        "code":  "76-869",
        "name":  "Professionalization for LCS",
        "short_name":  "PROFESS FOR LCS",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is strongly recommended for all LCS PHDs. In this course you will be introduced to the variety of things you will need when you enter the job market. Well discuss how the job market is organized, how the job market is changing, how to choose a subfield within EnglishCultural Studies, conferences, choosing a dissertation topic, and more.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The goal of this course is for 1st and 2nd year PHD students in LCS to be clear about what will be required on the job market at the conclusion of the program.",
                                                    "key_topics":  "This course is required for all LCS PHDs. In this course you will be introduced to the variety of things you will need when you enter the job market at the end of the program. We\u0027ll discuss how the job market is organized, how the job market is changing, how to choose a subfield within English/Cultural Studies, conferences, choosing a dissertation topic, and more.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "Assignments will be short, simple and frequent. Students will be expected to reflect on the material they are learning as the mini progresses.",
                                                    "relevance":  "Relevent to anyone in a Humanities PHD or interested in pursuing one.",
                                                    "learning_resources":  "Readings, web pages, videos, brief lectures from other faculty in the program.",
                                                    "extra_time_commitment":  "The time required to read and complete assignments."
                                            }
}