{
        "code":  "76-881",
        "name":  "Introduction to Multimedia Design",
        "short_name":  "MULTIMEDIA DESIGN",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "(76-391 [] at least D) or (51-262 [] at least D) or (76-791 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This class meets the increasing demand for professionaltechnical writers who understand multimedia and its communicative possibilities. It provides students with the opportunity to create both an explainer video and a more persuasive animation merging text, spoken voice, music, images, and video clips. Students will learn the basic concepts and vocabulary of motion graphics, practical issues surrounding designs that change over time, and digital storytelling through handson projects. Inspiration is drawn from popular Vox and Ted Ed explainer videos that have come to represent the genre. Students explore writing and recording their own narration and how to best utilize elements of time, motion, and sound to enhance their visual communication skills. Adobe After Effects will be taught to complete assignments and explore multimedia possibilities. Some Adobe Photoshop, Illustrator, and Audition will also be taught to support specific tasks. Basic experience with Photoshop or Illustrator prior to taking this class is helpful, but not required. Inclass discussions and critiques are essential components of the course.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  "http://www.cmu.edu/dietrich/english/index.html",
        "custom_fields":  {
                                                    "goals":  "Write a script and execute a design that guides the attention of the viewer visually and aurally simultaneously, while also considering what the viewer can read.\nPractice creating, editing and customizing graphics.\nPractice gaining control over the flow, timing and rhythm of the media using timelines and keyframed animations.\nPractice planning the structure of a piece with quickly made tools like storyboard sketches and timebased scratch tracks to create rough drafts to catch problems early in the process. Play the role of writer, producer, designer and animator in the creation of 2 multimedia projects approximately 3 or 4 minutes long after completing 2 smaller practice projects.\nRecord and edit a quality voiceover recording. Animate type. Experiment with the visual flow of animated photography. Dabble in shooting video with the goal of getting sound bytes.\nUltimately, the clarity and effectiveness of the communication is most important. We aim to take advantage of the multimodal nature of timebased media and to aid in learning and evoke specific emotional responses. We learn to avoid and identify distracting elements and choices that take away from the viewer experience",
                                                    "key_topics":  "Writing for dynamic medium, motion design, motion graphics, animation, explaining and teaching with animated diagrams, animation fundamentals, digital storytelling \u0026 filmmaking fundamentals, Adobe After Effects as a creative tool, animated type \u0026 photography, recording and editing professional voice audio",
                                                    "prerequisite_knowledge":  "Basics of Adobe Photoshop and/or Illustrator are helpful. Having taken (Static) Document Design class also helpful. There is flexibility on this. Perhaps the student has experience creating graphics in a tool like Procreate or Pixelmator, etc.",
                                                    "assessment_structure":  "4 projects (60% final grade), 4 projects deadline points (30% final grade), 2 workshopping group discussions with submitted written feedback to peers (10% final grade).\n\n\nThe first 3 exercise projects are worth 10 points each. The last 2 projects are more substantial and are worth 30 points each.\n\n\n\nPoints are awarded for items being submitted on time, such as the script, sketches and scratch tracks. Half of the points are earned for demonstrating ability to control visual flow and avoid distractions that result in higher production values and overall clarity of the communication",
                                                    "relevance":  "The world is communicating and learning more and more from designed and animated content. With more roles being expected to make multimedia video content, a grasp of the fundamentals working behind the scenes will make the work more effective.",
                                                    "learning_resources":  "A library of demo files from the instructor is most useful as it directly relates to the goals of the class. Other In-class, on-the-fly demonstrations will always be necessary to be flexible to meet student needs. In lieu of a text book, certain essentials will be practiced and reference specific resources available to students on CMU\u0027s access to LinkedIn Learning. It is also recommended student have a reliable external drive to work from.",
                                                    "extra_time_commitment":  "Yes. Although several Yes. Although several classes are dedicated to work sessions, additional time will be needed outside of class to complete the projects.are dedicated to work sessions, additional time will be needed outside of class to complete the projects."
                                            }
}