{
        "code":  "76-807",
        "name":  "Topics in Literary \u0026 Cultural Studies",
        "short_name":  "TPCS LIT \u0026 CULT STUD",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Recent advances in natural language processing NLP, primarily powered by large language models LLMs show great potential for enabling advanced text analysis across a diverse array of applications  from accelerating scientific discovery by automatically analyzing materials science research literature, to facilitating a study of the evolution of narrative arcs in 20th century literature. However, in many cases there remains a significant gap between the promise of modern language technologies, where models are typically benchmarked on a relatively limited set of representative general purpose tasks, and the successful deployment of these tools for realworld applications. In practice, each domainspecific task requires special consideration andor adaptation, often consisting of task definition and dataset curation, experimentation to identify strengths and limitations of existing offtheshelf methods, and the formulation of an appropriate and computationallyfinancially feasible plan for adapting available affordances to fit the new domain or task of interest. In this class, students with concentrations outside of NLP e.g. degree programs in materials science or English and students with concentrations in or near NLP LTI, MLD or equivalent expertise will work with and learn from each other to bridge this gap. Together, students will explore  Technical foundations for using language technologies, AI literacy and effective science communication  Acquiring and curating data appropriate to a specific task, evaluation  Identifying strengths and limitations of various approaches for adaptation to a specific domain or setting, and  Devising and executing a plan to accomplish research and analysis tasks given said goal.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  "There will be 5-7 lectures/events with notable authors and artists that students will be expected to attend."
                                            }
}