{
        "code":  "76-853",
        "name":  "Literature of Empire",
        "short_name":  "POSTCOLONIAL STUDIES",
        "units":  12.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Nineteenth and early twentiethcentury British literature was shaped by events taking place outside as well as inside of national borders.  Even in the eighteenth and nineteenth centuries, with international trade and slavery supporting the manor house and plantations abroad providing the cotton for British looms, the England of English literature spanned the globe.  By the first half of the twentieth century, this empire had begun to collapse in upon itself, a process witnessed by writers inside Britain and its colonies.  This course will investigate British literature within the international context of global imperialism.  A section on gothic stories takes us into the realm of popular culture with Mary Shelleys Frankenstein and Arthur Conan Doyles short stories.  We take to the seas with Joseph Conrads Lord Jim, before we consider W. Somerset Maughams exploration of sexuality in the tropics in The Painted Veil.  Finally, we return to England to outline the links between colonial empire and international war rendered in Virginia Woolfs Mrs. Dalloway.  These literary works will be read alongside some of the most important works of postcolonial theory.  While course readings focus on 19th and early 20th century, students will undertake a research project over the semester in their own period of interest in British literature in connection with empire studies.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  "http://www.cmu.edu/hss/english/courses/courses.html",
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}