{
        "code":  "76-849",
        "name":  "Race and Media",
        "short_name":  "RACE AND MEDIA",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will introduce students to useful methodological approaches to analyze race and representation within a variety of media formats. Media in this course is understood broadly technologies used to store and deliver information. With this rather broad understanding in mind our course will look at how artists and intellectuals use discrete formats print, filmvideo, electronic, and other recording mediums to imagine, remediate and study the circulation of racialized bodies and identities within global capitalism. We will also think about the concept of race itself as another, particularly problematic media format used to store and deliver information about the human for political, economic, ideological and juridical purposes. The class will be organized around specific material and immaterial media objects that will allow us to explore the processes of remediation that characterize racialized bodies and formats. We will look at a range of formats from literature and music to film, television, and social media. The course is structured to provide both a chronological and historicist approach to the discourses that define race and media. More than likely, we will watch and or read the works of D.W. Griffith, Nella Larson, Melvin Van Peebles, Lizzie Borden, Audre Lorde, Claudia Rankine, Alex Rivera and Nia DaCosta. We will also read the theoretical works of Jacques Ranciere, Huey P. Newton, Dallas Smythe, Lisa Gitelman and Michael Gillespie, Simone Browne, Theodore Adorno, Sara Ahmed and many others.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "An introduction to the theories and debates associated within film and media studies, media archeology, book history, Black studies, transnationalism and postMarxism.\nIlluminate the relationship between humanities research methods and concepts and mainstream political discourse and rhetoric.\nApply new methods of inquiry to your respective fields of study and intellectual interests.\nStrengthen your ability to read and comprehend art works and theoretical concepts in a sophisticated manner.\nParticipate in productive discussions of theory. This includes careful listening to others and contributing ideas that enrich and develop our ideas about the texts we are reading.\nPresent ongoing research in a public forum.\nDraft, redraft and edit a seminar length research paper.",
                                                    "key_topics":  "Writing, Critical Thinking Skills, History of Film and Media, History of Technology, Gender and Sexuality Stuies, History and Theories of Race, History of Capitalism, Aesthetic Theories of Film and Literature",
                                                    "prerequisite_knowledge":  "Advanced research in humanities disciplines, Exposure to film, media and/or visual studies.",
                                                    "assessment_structure":  "Short papers, final presentation and seminar paper.",
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  "Students will need to screen films on their own time."
                                            }
}