{
        "code":  "76-861",
        "name":  "Refugee Stories: Literature, Art and Film",
        "short_name":  "REFUGEE STORIES",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Contemporary literary, film and other visual culture have reimagined the experiences of transnational migration and asylum claims.  These global works focus on recent and ongoing wars, state regulations, borders, detainment, and transnational labor.  In this discussionbased, interdisciplinary course, students will study Anglophone and some translated global literature, documentary and feature film and photojournalism, art installations, and digital activist projects. We will ground our analysis using theoretical insight from Critical Refugee Studies, Postcolonial and Decolonial Studies. We will encounter a wide range of forms, aesthetics and themes that represent these experiences, including unexpected elements like humor, romance and horror. Possible readings might include Dina Nayeri, Viet Thanh Nguyen, Thi Bui, Isabel Allende, Valerie Luiselli, Mohsin Hamid, and Shailja Patel art by Ai Weiwei, Marc Quinn, Christoph Bchel, Banksy, Mona Hatoum and Reza Deghati and filmstelevision by Remi Weekes, Sally El Hosaini, Jonas Poher Rasmussen, Mohammed Mo Amer.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "understanding of concepts around immigration, familiarity with literature and art about refugees",
                                                    "key_topics":  "fiction, film, art, literature, refugees, immigrants, border",
                                                    "prerequisite_knowledge":  "literary background helpful",
                                                    "assessment_structure":  "short responses, presentation, short responses, presentation, longer paper projectpaper project",
                                                    "relevance":  "interdisciplinary--English, History, CFA in particular",
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}