{
        "code":  "76-819",
        "name":  "Media in a Digital Age",
        "short_name":  "MEDIA DGITL AGE",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "How are media in a digital age changing And how are they changing us What does it mean to be living in todays communication technology revolution In a time when many forms of communication are digitally based, traveling as bits at espeeds on global computer networks To begin answering these questions, we will take as case studies several new discursive digital media formations, such as digital books, online newspapers, blogs, wikis, and so forth, along with related social formations, such as social media networksand distributed nonprofit activist organizations. The readings will provide a range of lens by which to understand these developments, including cognitive, social, political, economic and technological aspects. We will briefly put the development of communication technologies in their historical context How were new forms of communication received in the past How were they used How did they affect communication How did they influence political and social institutions We will focus, however, on using knowledge of historical developments to inform our understandings of current digital communication developments.  Along the way we will ask questions, such as  What are some of the challenges that new digital formations present to traditional communication theories e.g., How is trust established when speakers are anonymous and globally distributed How is the public sphere constituted when Internet search engines dynamically construct it.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}