{
        "code":  "76-854",
        "name":  "Introduction to Literary and Cultural Studies",
        "short_name":  "LTRY \u0026 CLTL THEORY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Cultural Studies is an intellectual and professional movement identified with the Center for Contemporary Cultural Studies in Birmingham. This movement grew out of literary studies. It is neither identical with literary studies, nor opposed to literary studies. It is today one form that the study of literature or other cultural works may take. This course offers a theoretical genealogy of cultural studies, showing how and why its theories and practices emerged and developed. As a genealogy, the course does not assume that cultural studies has an essence or an origin. The texts and topics will reflect the heterogeneity of its emergence and development. The course does, however, embody what we see as several historical changes in cultural studies, from idealism to materialism, from mono to multiculturalism, and from high culture exclusiveness to democratic inclusivity. The course is not designed to teach approaches, but to explore and interrogate the founding assumptions of the academic project that you are being trained to join. Students should, by the end of the class, have a sense of where cultural studies came from and of the problems and possibilities raised by the theories it continues to invoke.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  "http://www.cmu.edu/dietrich/english/index.html",
        "custom_fields":  {
                                                    "goals":  "A familiarity with the history and key texts of theory in literary cultural studies. Also, practice in writing scholarly essays at the graduate level.",
                                                    "key_topics":  "Literary and cultural theory. The history of cultural studies in the UK and US.",
                                                    "prerequisite_knowledge":  "Some familiarity with literary history and critical discussion of it",
                                                    "assessment_structure":  "Three short papers, in-class participation, and weekly discussion questions.",
                                                    "relevance":  "This course is a foundational one for graduate study, as it introduces some of the ways that professional scholars and critics approach literature and culture. It covers the \"theory\" of our discipline, literary and cultural studies",
                                                    "learning_resources":  "Textbooks and readings on Canvas.",
                                                    "extra_time_commitment":  "Reading sometimes difficult theoretical work"
                                            }
}