{
        "code":  "76-884",
        "name":  "Discourse Analysis",
        "short_name":  "DISCOURSE ANALYSIS",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course teaches an empirical and systematic approach to analyzing texts. The central question we ask is this how does language shape contexts and how do contexts, in turn, shape language We typically focus on microlinguistic elements, but also examine visual aspects of texts.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  "http://www.cmu.edu/dietrich/english/index.html",
        "custom_fields":  {
                                                    "goals":  "By the end of the semester, student will know how to apply various methods of textual analysis, explaining multiple reasons why texts are the way they are. They will also know key grammatical concepts, understanding the form and function of various language choices. Finally, they will be able to ask a research question for which discourse analysis is a useful method, framing their work in ways that show its scholarly contribution.",
                                                    "key_topics":  "language, context, representation, identity, intention, medium, research writing",
                                                    "prerequisite_knowledge":  "general knowledge of English language",
                                                    "assessment_structure":  "Various reading responses; three analytic projects; and a final research paper",
                                                    "relevance":  "The is course is designed and required for PhD students in Rhetoric. It is relevant to them in that it teaches language theory and methods of textual analysis.",
                                                    "learning_resources":  "Students must purchase the course textbook. But other readings will be provided on Canvas, including various research articles and handouts.",
                                                    "extra_time_commitment":  null
                                            }
}