{
        "code":  "79-145",
        "name":  "Genocide and Weapons of Mass Destruction",
        "short_name":  "GENOCIDE AND WMD",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Genocide and weapons of mass destruction have been getting a lot of exposure lately  in the news, in popular culture, and even on the Fence on campus. What do they mean Why was it necessary to invent them How do we know when we are being confronted with them What should we do then This course surveys the history of genocide, weapons of mass destruction, and related phenomena. Can you imagine being responsible for the deaths of hundreds, thousands, or even millions of people No Almost everyone who ended up committing unspeakable atrocities had not been able to either. In fact, many of them still would not face their responsibility even after their complicity has been proven beyond doubt. Some convinced themselves, often sincerely, that there was no choice or that someone else was actually responsible. Others found reasons to justify, in their minds at least, taking many lives. Still others managed to forget that they had blood on their hands. How could anyone do such terrible things More importantly, can you be sure that you would not act like them under similar circumstances This course will teach you to look out for factors that turn ordinary people into mass killers. You will explore why conflicts break out and potential solutions. You will also learn to see from multiple perspectives and to be humble before history. Our exploration will begin with the European encounter with the Western Hemisphere and continue to 19thcentury imperialism, the Holocaust, the atomic bombings of Japan, the Cold War, and decolonization and independence. By the end, you will have grasped the historical facts and contemporary concepts of genocide and weapons of mass destruction. You will also come to appreciate the significance of unintended consequences and the ambiguity of human progress, a realization that will guide you in life. This course meets the Dietrich Gen Ed Perspectives on Justice and Injustice requirement.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course, students will be able to1.Describe, critique, and devise definitions of genocide and weapons of mass destruction2.Explain causes of genocide or uses of weapons of mass destruction3.Think critically about the relations between choice, action, result, and legacy4.Evaluate the context, credibility, and purpose of any information or argument5.Craft effective written and verbal arguments by combining evidence, logic, and creativity6.Examine how our worldviews shape our perceptions of history, news, and other peoples7.Identify ways cultural norms and institutions perpetuate inequality and discrimination",
                                                    "key_topics":  "Through lectures, discussions, readings, and assignments, we will examine the European encounter with the Western Hemisphere, imperialism, the Holocaust, the atomic bombings of Japan, the Cold War, and decolonization and independence.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "Participation in recitations, quizzes, current events analyses, short papers, final essay.",
                                                    "relevance":  "Dietrich Gen Ed: Special Seminars - Perspectives on Justice and Injustice\n\nConcretely, students will have a chance to familiarize themselves with the concepts and historical facts of genocide and weapons of mass destruction. Philosophically, they will come to appreciate the significance of unintended consequences and the ambiguity of human progress, a realization that will guide them in life.",
                                                    "learning_resources":  "Access to books, documentaries, and primary and secondary source texts.",
                                                    "extra_time_commitment":  null
                                            }
}