{
        "code":  "79-149",
        "name":  "Ancient Rome: What Have the Romans Ever Done for Us?",
        "short_name":  "ANCIENT ROME",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The Romans are nowhere and everywhere in our world. Hundreds of years after anyone could plausibly claim to be Roman, the influence of ancient Rome is still palpable in our political institutions, religions, languages, geography, art, law, architecture, technology, and so much more. And not just in Europe. The legacy of ancient Rome can be felt in the Americas and elsewhere in the world. It affects how we think about the tension between West and East, the definitions of civilization and barbarism, and citizenship and belongingness in a multiethnic society. How did ancient Rome rise and how did it fall Did it fall at all How can a people who flourished about two thousand years ago still play a role now If ancient Romes impact is still so broad and deep, what lessons can or should we draw from the Romans This course will explore these questions by tracing the history of Rome from its mythical and actual foundations to its expansion, gradual decline, and repeated renewals. At the end of the course, students will be able to answer that memorable question in Monty Pythons Life of Brian What have the Romans ever done for us",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course, you will be able to1. Command basic knowledge about the history and presence of ancient Rome2. Explain where and how ancient Rome still impacts us3. Compare ancient Rome and our society, and derive lessons applicable now or in the future4. Evaluate the context, credibility, and purpose of any information or argument5. Make effective written and verbal arguments using evidence, logic, and creativity6. Apply analytical methods in history to answer questions and synthesize findings7. Understand that the past is never really past but still relevant",
                                                    "key_topics":  "Through lectures, discussions, readings, and assignments, we will explore the history of ancient Rome, from its mythical founding to the Roman Republic, Roman Empire, and the modern legacy of Rome.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "Recitation discussion \u0026 debate, 4 response papers, short, dedium, and final essays, and 2 current events assignments.",
                                                    "relevance":  "Dietrich GenEd: Contextual Thinking\n\nAt the end of the course, students will be able to answer that memorable question in Monty Python\u0027s Life of Brian: What have the Romans ever done for us?",
                                                    "learning_resources":  "One textbook, plus materials provided via Canvas.",
                                                    "extra_time_commitment":  null
                                            }
}