{
        "code":  "79-112",
        "name":  "Introduction to Asian American History",
        "short_name":  "INTRO ASIAN AMER HIS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This introductory course surveys the histories of Asian Americans from the early nineteenth century to the present. We will cover major themes such as migration and diaspora, race, labor, citizenship, and identity and community formation as we examine the continuities and discontinuities between the Asian American past and present. Special attention will also be paid to both local and global aspects of Asian American history in the United States, in other countries of the Americas, and in Asia as we work to build a more robust understanding of what it means to be Asian American and how such social categorizations fit into broader patterns of construction and rearticulation according to varying historical contexts.  This course fulfills Dietrich Colleges Humanities general education requirement.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Our course goals will include1. Students will build a foundation of knowledge about Asian American history.2. Students will improve their ability to evaluate and make evidencebased historical arguments.3. Students will learn to write more clearly and persuasively.4. Students will hone their skills of academic debate and deliberation in a respectful and reflective atmosphere.",
                                                    "key_topics":  "Key topics to be covered include:\n\n1. The history of peoples of Asian descent in the Americas;\n\n2. How to study and think about the past using diverse texts and sources; and\n\n3. How to read, think, and write like a historian.",
                                                    "prerequisite_knowledge":  "No prerequisite knowledge is required.",
                                                    "assessment_structure":  "Active attendance/participation in class, weekly posts on Canvas, two essays, and a final examination.",
                                                    "relevance":  "This course fulfills Dietrich College\u0027s \"Humanities\" general education requirement.\n\nBy the end of this course, students will have built a foundation of knowledge about the diverse histories of Asian Americans, including key people, events, and ideas that have shaped these histories.",
                                                    "learning_resources":  "One required text and assorted supplementary readings (made available on Canvas by the instructor).",
                                                    "extra_time_commitment":  null
                                            }
}