{
        "code":  "79-101",
        "name":  "Making History: How to Think About the Past (and Present)",
        "short_name":  "MAKING HISTORY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Who makes history This apparently straightforward question is at the heart of studying the past, but it is also an important question to answer if we are to understand the world around us. Being able to answer the question Who and what caused changes to political, cultural, economic, and environmental systems is fundamental to thinking about the past, but it is also essential to analyzing current issues as widespread and yet connected as economic inequality, social justice, and climate change. Making History is an introductory course ideal for students who are curious about the past and want to learn how to become better critical thinkers by applying its lessons to the present. The course explores how history is made on two levels both the historical events themselves and how those events are documented, interpreted, and remembered. In other words, making history is not just about understanding what happened, but what it meant to different groups of people then and what it means to different groups of people now. Well visit some famous and notsofamous historical events and actors to learn about how individual choices combine with deeper structural factors, like gender, race, environment, and class to make history. Along the way, well also encounter different ways to interpret the past, drawing upon the latest scholarship to understand how historians think about the past  and present. Students will be encouraged to synthesize what they learn in class to develop their own critical perspectives on their lives and the world around them.  This course fulfills Dietrich Colleges Humanities general education requirement.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the semester, students will be able to1.Describe why major historical categories of analysis, specifically gender, race, environment, and class, are important tools to use when explaining historical events.2.Apply major historical categories of analysis, specifically gender, race, environment, and class in different times and places around the world to explain how historical events unfold.3.Evaluate the strengths and weaknesses of different approaches to interpreting and explaining the past.4.Generate a substantive argument about whowhat makes history using evidence from primary and secondary sources.5.Communicate their perspectives on who and what makes history in both oral and written forms.6.Reflect on how their own lives and issues important to them are the products of ongoing historical processes.",
                                                    "key_topics":  "Key topics include: Political revolutions in the 18th century Atlantic world, with a special focus on Haitian Revolution; economic and environmental causes and consequences of European imperialism, specifically with a focus on China during the period of the Opium Wars; the emergence of the modern world system with an emphasis on Afghanistan during and after the Cold War between the United States and the Soviet Union.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "Students will be assessed on their participation in class discussion by both self and instructor evaluations; and on their comprehension of the readings by brief reading response questions and short analytic essays.",
                                                    "relevance":  "This course fulfills Dietrich College\u0027s \"Humanities\" general education requirement.\n\nStudents will learn a variety of ways to think about the past, and specifically, how thinking about the past can better inform our understanding of current events. Students will also learn more about specific historical events that have been especially influential in the creation of the modern world, and the academic and popular debates and controversies about these events.",
                                                    "learning_resources":  "Access to readings and other materials via Canvas.",
                                                    "extra_time_commitment":  null
                                            }
}