{
        "code":  "79-155",
        "name":  "Introduction to African American Studies",
        "short_name":  "INTRO AFRICN AMER ST",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course introduces students to some of the critical themes, concepts, and contemporary issues surrounding Black Americans in the United States with an underlying interdisciplinary framework. The emphasis of investigation in this course will be comparative, primarily historical, sociological and literary. Students will specifically engage with questions of difference and cultural representation as each relates to the construction and deconstruction of essentialized categories of racial, ethnic, cultural, and national identities. Examining the relationship between historical and contemporary policies and representations of Black Americans will be central in understanding their lived experiences in the twentyfirst century. Finally, students will gain an understanding of the complexity of the African American identity and sociocultural issues as they relate to economic and political resourcesorganizingactivism, and sociological engagement with current and emerging issues of race, nationalism, and power.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "This course has two primary objectives 1. To provide students with an introduction to key concepts and historical events in African American history and contemporary issues from the 1600s to the present. 2. To provide students with the necessary information to critically interpret, analyze, and evaluate texts and issues which have contributed to previous and contemporary arguments in African American Studies and within African American populations.",
                                                    "key_topics":  "Key topics will include, but not limited to, the Triangle Slave Trade in the Atlantic World; the national expansion of slavery within the United States; African American experiences during the U.S. Civil War and the Reconstruction Era; the establishment of Jim Crow laws and segregation; the American Civil Rights Movement and the motivations behind mass incarceration throughout the twentieth century to the present; and finally, the discussions over the intersectionality of gender and race, as well as the idea of reparation.",
                                                    "prerequisite_knowledge":  "No prerequisite knowledge is required.",
                                                    "assessment_structure":  "The course consists of two exams, class participation, and a final essay/project.",
                                                    "relevance":  "To provide students with a means to develop their critical reading, writing, research, and communication skills as applicable to African American Studies, History, Ethnic Studies, and the Social Sciences and Humanities.",
                                                    "learning_resources":  "For this class, we will be reading the book, \"Not Just in February: Introduction to African American Studies by CofC Staff (AAST Reader),\" available for purchase through TopHat. Other readings will be articles that can be easily accessed from JSTOR or are available free online.",
                                                    "extra_time_commitment":  "There are no extra time commitments."
                                            }
}