{
        "code":  "79-189",
        "name":  "Democracy and History: Thinking Beyond the Self",
        "short_name":  "DEMOCRACY \u0026 HISTORY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Voters face a momentous decision. A fascist demagogue is running for president. He has already tried to seize power through an insurrection. It failed, but he mostly escaped punishment thanks to sympathetic or feckless judges. He mixes braggadocio, lies, flattery, empty promises, and a victimhood narrative to depict himself as the countrys savior and to attract millions to his personality cult. If elected, he vows to make future elections unnecessary, rule as a dictator, stop outsiders from poisoning the nations blood, and rid the country of leftist vermin. He fearmongers about who deserves membership in the nation, the countrys international obligations, crime, the economy, and a faraway war to divide the people. The last person standing between him and his goal is an octogenarian president running for reelection. How will the voters decide In addition to experiencing what happens to this country, we will examine democracy in ancient Rome, France, Japan, China, and Iran. Living in a democracy means thinking beyond the self and from others perspectives. It means looking for facts but being open to different interpretations. And it means taking responsibility to think critically. These traits are also essential for understanding history. This course will train you in the historians skillset and mindset so you can act democratically. You will learn to tell facts from opinions and to see from various angles. The course will push you to think for yourself and to argue effectively for your own position. These skills of thinking historically are useful not just for school or work, but they are indispensable to a democratic society. Democracy is chosen as the course theme because it is a feature that sets humans apart from other organisms. Knowing the history of democracy is knowing what it means to be human, which is the soul of the humanities. This course meets the Dietrich Gen Ed Humanities requirement.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course, you will be able to1.Describe, critique, and devise concepts and implementations of democracy2.Explain why and how some democracies functioned or collapsed3.Think critically about the essence, strengths, and weaknesses of democratic governance4.Evaluate the context, credibility, and purpose of any information or argument5.Craft effective written and verbal arguments by combining evidence, logic, and creativity6.Apply analytical methods in history to answer questions and synthesize findings7.Understand that thinking historically is indispensable to acting democratically",
                                                    "key_topics":  "Through lectures, role play exercises, discussions, readings, and assignments, we will explore historical democracies in ancient Rome, revolutionary France, Weimar Germany, modern Japan, the Chinese nation, and the Iranian nation.",
                                                    "prerequisite_knowledge":  "No prior knowledge required",
                                                    "assessment_structure":  "Participation in recitations, current events analyses, role play exercises, short papers, final essay.",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Reflecting\nDietrich GenEd after Fall 2021: Disciplinary Perspectives - Humanities\n\nBy the end of the course, students will have gained a basic appreciation of the philosophical appeal and practical challenges of collective governance, so that they will be able to decide for themselves what role democracy should play in their life, and vice versa.",
                                                    "learning_resources":  "Access to various primary and secondary sources, such as inscriptions, coins, sculpture, images, texts, and footage.",
                                                    "extra_time_commitment":  null
                                            }
}