{
        "code":  "79-233",
        "name":  "Forced Displacement, Migration, and Statelessness in the Modern Middle East",
        "short_name":  "DSPLC MGT MID EST",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This minicourse situates displacement, forced migration, and statelessness as distinctly modern processes, stretching from the mid19th century to the late 20th century in the Middle East and North Africa, linked to the development of imperial and nebulous nationstate administrative formations and theories of population management. Students will gain an understanding of how these processes were undoubtedly fostered by not only colonialism, outside intervention, and conflict, but also by indigenous knowledge production on race and ethnonational identity, national liberation, and new administrative structures and categorizations of people. The format for the course involves first, a consideration of chronological processes and general concepts of migration and displacement, and second, an investigation into weekly thematic case studies to better understand the profound impact of these events and processes to individuals, communities, and states. This will enable students to explore the local and regional manifestations of global processes leading to the creation of refugee and displaced populations in the Middle East. Special emphasis will be placed on critical reflection as to how nationalstate narratives are constructed in the Middle East as a reaction to migration and displacement. Students discussions, readings, and writing will be driven by engagement with not only academic sources but also visual and material ones, oral and recorded testimonies, and memoirs.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will be able to evaluate historiographical debates about identity, belonging, and citizenship as they relate to state and nationbuilding, and their aftermath in the Middle East.",
                                                    "key_topics":  "This mini-course considers and interrogates numerous thematic questions, all of which help us explore not just the political or national history of displacement and refugees in the Middle East but the lived experiences of people displaced and the impact of this on community structures, culture, and even the environment. We will consider geographical spaces, states, and national formations including the Ottoman Empire, ethnic cleansing of Armenians and Kurds, Palestinian refugees, Jews from the Middle East/North Africa, stateless communities in the Arab-Persian Gulf, among others.",
                                                    "prerequisite_knowledge":  "There is no prerequisite knowledge required.",
                                                    "assessment_structure":  "As part of discussion activities, students will consider cultural and material objects, oral testimony, and documents, which will provide the class with tools to analyze, evaluate, and respond to primary source materials that represent viewpoints and experiences of forcibly displaced and stateless populations. By the end of the mini-course, students will have enhanced their skills of commenting on sources on displacement and refugees and be able to relate primary material and secondary readings to one another.",
                                                    "relevance":  "A goal of the course is for students to grasp and be able to reflect on key themes and concepts, issues and debates relevant to the trajectory of displacement, forced migration, and stateless in the Middle East from the 1860s to the end of the 20th century.",
                                                    "learning_resources":  "Assigned readings will be articles and book chapter excerpts, which can be viewed/downloaded on Canvas, and weekly primary sources (readings but also photos, art, etc.) which will be on Canvas or you will be given the links to access them.",
                                                    "extra_time_commitment":  "Students will be assessed based on participation and on two short analytical/critical reflection essays (4-6 pages) on different topics, which will offer a chance to use critical reading, writing, and analytical skills to contextual phenomenon and present arguments and positions."
                                            }
}