{
        "code":  "79-266",
        "name":  "Russian History and Revolutionary Socialism",
        "short_name":  "RUSSIA HIS \u0026 REV SOC",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course covers an epic set of events in Russian history beginning with the emancipation of the serfs in 1861 and ending with the death of Stalin in 1953. Spanning almost a century of upheaval and transformation, it examines the terrorist and populist movements against the tsar, the growth of urbanization and a new working class, the great general strike and revolution of 1905, the Russian revolution in 1917, and the Communist Partys attempt to build a new socialist society amid the wreckage of the old. We will discuss the struggle for power within the Party in the 1920s, Stalins triumph over his opponents, the wrenching processes of collectivization and industrialization, and the Great Terror. The course will explore the Soviet role in World War II, the shattering losses, and the death of Stalin in 1953. This course meets the Dietrich Gen Ed Humanities requirement. To all students registering for this Spring 2025 CMU Prison Education Project course, please fill out this brief questionnaire so that the instructor may address your questionsconcerns in advance   httpsforms.gleGq9k3by5WUEctTe4A.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "To study and analyze a broad sweep of Russian history To learn what socialism meant in theory and in practice To survey the economic, social, and political challenges of the worlds first socialist state To analyze key turning points and events, the alternatives paths and choices, and the intended and unintended consequences of state actions Develop the skill of close reading and analysis to formulate an argument about a particular event or phenomenon. Assess the quality of the arguments based on the evidentiary findings. Articulate, orally and in writing, an analytical perspective based on solid evidence.",
                                                    "key_topics":  "The emancipation of the serfs, the Russian revolution and Civil War, the rise of Stalin, the mass repressions, and World War II. This course will address student interest in socialism and the impact of the world\u0027s first socialist state on events of the twentieth century, including the rise of fascism.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "Students will be graded on a midterm and final exam, a paper, and participation in discussion of the readings.",
                                                    "relevance":  "Dietrich Gen Ed: Disciplinary Perspectives - Humanities\n\nHistory is the study of change over time. When the Soviet Union broke up in the 1990s, the archives opened up to researchers. The course uses new archival findings to discuss the changes in historiography, or the study of history itself, as historians have incorporated new evidence into our understanding of events. Students will learn to ask questions about revolutionary transitions and what policies are possible within what constraints. We use a historical approach to analyze what spurs revolutionary change and why state policies evolve within a specific set of contexts constrained by economics, social formations, and ideology. Students will learn to analyze secondary and primary sources as well as literary texts that engage large questions of social movements, development, and change over time. They are taught to analyze the reasons for change as well the political dynamics of struggle over outcomes.",
                                                    "learning_resources":  "Course texts and readings posted on Canvas, including various scholarly monographs, primary and secondary sources, eyewitness accounts, journalism from the period, occasional novel and short stories, film, video.",
                                                    "extra_time_commitment":  "Yes, as part of the CMU Prison Education Project."
                                            }
}