{
        "code":  "79-281",
        "name":  "Introduction to Religion",
        "short_name":  "INTRO TO RELIGION",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Religion can be understood from the outside, through the academic lenses of history, sociology, psychology, philosophy, etc., and from the inside, listening to the experiences and reflections of those who practice various faiths. The course will examine major religious traditions from several perspectives and begin to explore such topics as the relationship between religion and science, faith and reason, religion and moral values, and religion in public life. This introduction is designed for students with a general interest in religion, as well as those contemplating a Religious Studies minor.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Course goals include1. Exploring essential elements of Judaism, Christianity, Islam, Hinduism, Buddhism, and other religions for the inherent value of understanding these influential traditions and by way of examining questions and topics pertaining to religion in general.2. Becoming familiar with various scientific perspectives on religion.3. Developing a more nuanced understanding of why and how religion continues to play an important role in the world.",
                                                    "key_topics":  "Key topics to be covered include:\n\n*Introduction to religion from the diverse perspectives of religious adherents and the social sciences;\n\n*Focus on Hinduism, Buddhism, Judaism, Christianity, Islam, and East Asian traditions; and\n\n*Elements of religious belief and practice in light of modern science, questions of \"faith and reason,\" and potential for conflict and cooperation.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "This is an introductory survey course, so the focus will be on assigned readings, class discussions, and written reflections summarizing the topics addressed and students\u0027 insights derived from reading and conversation. No additional research is expected.\n\nGrades will be based on the following:\n\n* Class attendance and participation (30%)\n\n* One mid-term reflection paper (30%)\n\n* Final take-home paper (40%)",
                                                    "relevance":  "That will, of course, depend on the individual students. Some are adherents of particular religious traditions, while others have no religious background and may or may not be sympathetic to religion. This is an elective, so the common denominator is simply students who have an interest in learning more about religion for a variety of reasons.",
                                                    "learning_resources":  "In addition to some short readings, which will be available on Canvas, students will be expected to prepare for class discussions by reading assignments in the principal textbook.",
                                                    "extra_time_commitment":  null
                                            }
}