{
        "code":  "79-226",
        "name":  "African History: Earliest Times to 1780",
        "short_name":  "AFRIC HIS:ER TM 1780",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "A beginning point for this course will be the question how do historians reconstruct history when few written sources are available Breaking disciplinary boundaries, the course will draw on linguistics, climateology, archaeology, and anthropology to reconstruct dynamic social, cultural, political, and economic processes in Africa before the arrival of Europeans and before the availability of written source materials. When written sources are available, the course will interrogate them to illuminate the changes that occurred in African societies during the early period of contact with Europeans. Lastly, by focusing on longterm processes, such as economic specialization, urbanization, and Islamization, the course will begin to put the slave trade in an Africancentered perspective. This course meets the Dietrich Gen Ed Humanities requirement.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "the course is also designed to get students thinking critically about how historians select and interpret sources to construct and reconstruct history at these different levels.",
                                                    "key_topics":  "A beginning point for this course will be the question: how do historians reconstruct history when few written sources are available? Breaking disciplinary boundaries, the course will draw on linguistics, \"climateology,\" archaeology, and anthropology to reconstruct dynamic social, cultural, political, and economic processes in Africa before the arrival of Europeans and before the availability of written source materials. When written sources are available, the course will interrogate them to illuminate the changes that occurred in African societies during the early period of contact with Europeans. Lastly, by focusing on long-term processes, such as economic specialization, urbanization, and Islamization, the course will begin to put the slave trade in an African-centered perspective.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "3 4-page papers\n\nTake home final exam\n\nClass Participation- Class attendance and contributions to class discussion, Small group meetings and presentations, Small group evaluations, attendance at 1 Africa-related event (we will attend as a class).\n\nJournal Entry (about class Africa-related event)\n\nFinal Paper (8-page take home final exam)",
                                                    "relevance":  "Dietrich Gen Ed: Disciplinary Perspectives - Humanities\n\n* the course is designed to give students an understanding and appreciation of African history and culture from the « inside out »\n* it is centered on African language/ethnic groups, villages, and individuals as historical actors who daily made collective and personal decisions to pass down, innovate, and borrow practices, technology, spiritual systems, etc. in the face of changing (and sometimes cataclysmic) social, political, and economic realities",
                                                    "learning_resources":  "Texts, both primary and secondary sources.",
                                                    "extra_time_commitment":  "Attendance at 1 Africa-related event; we will attend as a class."
                                            }
}