{
        "code":  "79-202",
        "name":  "Flesh and Spirit: Early Modern Europe, 1400-1750",
        "short_name":  "FL SP EARLY MOD EUR",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course examines European history from the Black Death to the French Revolution, a period known to history as the early modern period. That is, it marks a period in European history that was not quite medieval, and yet not quite modern. Many features of modern society, such as the nationstate, freetrade economies, religious pluralism, scientific rationalism, and secular culture trace their origins to the early modern era, yet the period was also marked by important continuities with the Middle Ages. During this course, we will explore how Europeans reimagined their world in its transition from the medieval to the modern. Topics to be considered will include the renaissance of the arts, the problems of religious reform, exploration and colonialism, the rise of science, and the expansion of the state. Through these developments, we will focus on Europeans changing notions of the human body, the body politic, and the natural world, as well as their reinterpretations of the proper relation between the human and the divine, the individual and the community, and the present and the past.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "To understand the historical forces shaping European history in the early modern era and their contemporary significance to critically analyze primary and secondary historical sources related to the topic, and to effectively communicate a scholarly argument based on those sources in writing and discussion.",
                                                    "key_topics":  "This course examines European history from the Black Death to the mid-eighteenth century, a period bridging the late medieval and the modern eras. Topics to be considered will include the \"renaissance\" of the arts, the problems of religious reform, exploration and colonialism, the rise of science, and the expansion of the state.",
                                                    "prerequisite_knowledge":  "No prerequisite knowledge is required.",
                                                    "assessment_structure":  "In-class discussion of assigned readings, short written assignments related to the readings, 2 exams, and an 8-page \"exercise in historical imagination\" on a historical character of the student\u0027s own creation related to the themes of the course.",
                                                    "relevance":  "Many features of modern society, such as the nation-state, free-trade economies, religious pluralism, scientific rationalism, and secular culture trace their origins to the early modern era. In this course, students will analyze the historical forces shaping Europe in its transition from the medieval to the modern, and their lasting influence on the present.",
                                                    "learning_resources":  "Texts (both primary and secondary historical sources), visual images, and other materials available via Canvas; an in-class visit to CMU\u0027s Rare Book Room to work with early printed books from the early modern era (c. 1450-1780).",
                                                    "extra_time_commitment":  null
                                            }
}