{
        "code":  "79-261",
        "name":  "The Last Emperors: Chinese History and Society, 1600-1900",
        "short_name":  "THE LAST EMPERORS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is an introduction to lateimperial Chinese history and society with a focus on the Qing dynasty 16441912. We begin by examining the Qing not just as the last of Chinas imperial dynasties but also as an earlymodern, multiethnic empire that included Mongolia, Tibet, and Xinjiang. In fact, Chinas last emperors were actually Manchus from northeast Asia. Secondly we investigate the social, economic, intellectual and demographic developments that transformed lateimperial China prior to the coming of the West. Thirdly, we examine Qing responses to a string of nineteenthcentury disruptions, including but not limited to western imperialism, that threatened to not only end the dynasty but also challenged the very tenants of Chinese civilization. Lastly, we will look at the fall of Chinas imperial system, the end of empire, and the postimperial struggle to reformulate the state and reimagine society for the twentieth century.  This course meets the Dietrich Gen Ed Humanities requirement.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1. Introduce the history of lateimperial China2. Analyze issues and events in lateimperial Chinese history both within their immediate contexts and in the breadth of Chinese history and its transformation from an imperial formation to a nationstate3. Engage scholarly debates on topics such as empire and nation, imperialism, tradition and modernity, ethnicity and identity, social movements, and revolution in the context of early modern and modern Chinese history. 4. Strengthen ability to critically analyze various types of primary and secondary source material5. Develop skills as writers able to analyze sources and support arguments based on evidence6. Increase awareness, knowledge and sensitivity toward nonwestern cultures and societies by considering how ways Chinese society developed and situating it within their own ways of thinking in relation to historical trajectories",
                                                    "key_topics":  "This course is an introduction to some of the major issues in late imperial \"Chinese\" history and society with a focus on the Qing dynasty (1644-1912). Special attention will be given to questions of political, social, intellectual and economic transformation, gender, ethnicity and identity, imperialism and globalization, social movements and revolution, and the transition from empire to nation.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "Written assignments, exams, class participation, and reading responses",
                                                    "relevance":  "Dietrich Gen Ed: Disciplinary Perspectives - Humanities\n\nIncrease awareness, knowledge and sensitivity toward non-western cultures and societies by considering how ways Chinese society developed and situating it within their own ways of thinking in relation to historical trajectories.",
                                                    "learning_resources":  "Primary and secondary readings, documentary film, including books to purchase and other materials posted on Canvas",
                                                    "extra_time_commitment":  "No."
                                            }
}