{
        "code":  "79-223",
        "name":  "Mexico: From the Aztec Empire to the Drug War",
        "short_name":  "MEXCO:AZTEC EMP-DRUG",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course provides a survey of Mexican history and culture over a variety of periods, from the rise of the Aztec empire, to Spanish conquest and colonization, to national independence, to the Mexican Revolution and contemporary Mexico. A wide range of topics will be addressed, such as race, ethnicity, and indigeneity state formation and politics national identity and the politics of memory the border, migration, and the deportation regime and the drug war. Students will discuss historical and anthropological scholarship on Mexico, but will also consider cultural documents of various kinds, like Mexican music, art, cinema and food.  This course is interdisciplinary, bringing together the perspectives of both history and anthropology. A majority of readings for the course are primary documentshistorical, but also cultural textsand hence a good amount of time is spent considering issues around primary source interpretation in historical and cultural terms.  This course stresses the importance of taking account of difference social, cultural, historical as we consider large questions about history, politics, and in some cases, policy. This course meets the Dietrich Gen Ed Humanities requirement.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of this course, students should understand diverse aspects of Mexican culture, history and politics. In particular, theyshould be able to define and identify critical historical events, institutions, and geographical and cultural aspects of Mexicoincluding the diversity and complexity of Mexicos indigenous populations from before the Spanish conquest, through colonial ruleto the present Mexicos struggles with issues of political and civil rights, governance, and national identity from the time ofindependence and the U.S.Mexican war through the Mexican Revolution and in its wake and the ways such earlier struggles havecontinued to play a role in contemporary Mexico.Through discussion of a wide range of texts, from historical documents, to historical and anthropological scholarship, to visualarts, film, and music, students will gain experience critically interpreting historical primary sources, as well as cultural sources, toarrive at salient observations about Mexico past and present. Through readings, written assignments and classroom discussion,students will use such sources to perform close historical and textual analysis of period sources, in ways shaped by an understanding of historical context and cultural difference. In doing so, they will learn how to assess the quality of historical and cultural arguments based on primary source evidence, and how to generate substantive arguments in ways consistent with the conventions of history,anthropology and related fields of cultural analysis, and informed by possibilities, and limitations, where definitive conclusions are not possible.",
                                                    "key_topics":  "This course provides a survey of Mexican history and culture over a variety of periods, from the rise of the Aztec empire, to Spanish\nconquest and colonization, to national independence, to the Mexican Revolution and contemporary Mexico. A wide range of topics will be addressed, such as: race, ethnicity, and indigeneity; state formation and politics; national identity and the politics of memory; the border, migration, and the deportation regime; and the drug war.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "class participation, small group workshops, two short commentaries; one 5-7 final essay.",
                                                    "relevance":  "Dietrich Gen Ed: Disciplinary Perspectives - Humanities\n\nStudents will discuss historical and anthropological scholarship on Mexico, but will also consider cultural documents of various kinds,\nlike Mexican music, art, and food.",
                                                    "learning_resources":  "All course resources are provided via Canvas.",
                                                    "extra_time_commitment":  null
                                            }
}