{
        "code":  "79-217",
        "name":  "Entertainment and Popular Culture in the Roaring Twenties",
        "short_name":  "EN POP CLTR RG TWENT",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The Roaring Twenties was a time of Jazz Age speakeasys, technological innovation, and mass advertising. This course will examine a different topic in popular culture and entertainment per week, exploring the excitement of daily life alongside larger structural forces that gave shape to the eras distinctive identity. Guiding questions will be How did the countrys economy, society, and politics shape the development of popular culture How did artistic performers and business entrepreneurs develop their craft and products in this environment And how did popular culture impact the countrys economy, society, and politics",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "After completing this course, students should know how to interpret how government policies and individual actions shaped technological integration into popular culture analyze how performers and entrepreneurs developed their crafts and products into expansive industries explain the impact of the countrys economy, society, and politics on popular culture and vice versa.Students should improve their communication skills by producing effective essays and reading reflections. Students should improve their critical thinking and analytical skills by assessing the construction of popular memory in a final essay. Finally, students should be able to identify, interpret, and critique the key themes in the history of popular culture and connect these to contemporary society, thus enabling them to take part in civil discourse.",
                                                    "key_topics":  "This course will examine a different topic in popular culture and entertainment per week, exploring the excitement of daily life alongside larger structural forces that gave shape to the era\u0027s distinctive identity. Guiding questions will be: How did the country\u0027s economy, society, and politics shape the development of popular culture? How did artistic performers and business entrepreneurs develop their craft and products in this environment? And how did popular culture impact the country\u0027s economy, society, and politics?",
                                                    "prerequisite_knowledge":  "Little prior knowledge of American history is assumed. Students should be proficient with basic technology assumed of any college student (Word, email, etc).",
                                                    "assessment_structure":  "This course will require reading of selected book chapters, the completion of weekly reading responses, the completion of a short essay and final essay, and participation in class discussions.",
                                                    "relevance":  "This course will pay careful attention to the valuable contributions Americans from diverse backgrounds (spanning racial, class, gender, and ethnic groups) made to the country\u0027s popular culture.",
                                                    "learning_resources":  "Certain readings and relevant primary source material will be distributed to students through a Canvas site. Lectures will be offered to the class via PowerPoint presentations.",
                                                    "extra_time_commitment":  "No extra time will be expected beyond the time required to complete course assignments."
                                            }
}