{
        "code":  "79-216",
        "name":  "Genghis Khan and the Mongol Empire",
        "short_name":  "GENGHIS KHAN/MON EMP",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course examines the rise, rule, and impact of the Mongol Empire on global history. In the 13th century, Eurasia was shaken by a force contemporary chroniclers likened to an apocalypse. Within a few decades, horsemen under the command of Chinggis Genghis Khan swept out of the northeastern steppe to establish the largest land empire the world would ever know. Few events in world history have inspired such fear and awe. However, the Mongol period also ushered in the socalled pax Mongolica, the first period of sustained contact and exchange across Eurasia as people, technologies, arts, biodiversity, and ideas spread throughout the Mongol domains and beyond. Questions to be examined include Who was Genghis Khan and how did he lead a little known nomadic people to conquer much of the known world What cultural and technological innovations aided the Mongols rise and conquest How did Genghiss successors rule their vast, diverse domains What role did religion play in Mongol Eurasia Why did a unified Mongol empire fall apart in such a relatively short period of time And how did the Mongols and their empire help shape the world we live in today",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}