{
        "code":  "79-279",
        "name":  "Science and Technology in World History",
        "short_name":  "SCI AND TECH WORLD",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Science and technology permeate every aspect of our lives. Science represents the most widely accepted and trusted source of knowledge in contemporary society. Likewise, technology  the tools and practical application of scientific understanding  endures as pivotal feature of human history. In many ways, the story of scientific and technological shifts is the story of world history. To this end, we will trace major social and cultural themes as we follow the transfer of knowledge and machines over time and between cultures. Overall, we will focus on comprehending the social impact of science and technology working with case studies. from around the globe spanning the period 1500 to the late twentieth century. This course examines colonial exploration and extractivism, classification, racemaking and race relations, infrastructure and transportation, economic development, architecture, and design. Most importantly, this course will challenge you to think beyond conventional patterns and historical narratives of scientific innovation and technological triumph and to develop a critical understanding of our entangled relationship with such dominant forces.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Identify and explain key themes related to the development of scientific knowledge and machines across time and placeexplore the history of science and technology as a way to understand cultures and societies across the worldengage critically with a range of scholarly materials to better understand issues of scientific exploration and technological innovationconsider how Westerncolonial ideologies have shaped perceptions of science and technology in other parts of the world and vice versa expand both academic and creative skills by completing traditional and nontraditional written assignments and small projects",
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Discussion Board postings\n3 Response Papers\nMuseum Visit and Report\nMapping Technology Report\nFinal Project",
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}