{
        "code":  "79-249",
        "name":  "20th Century U.S. History",
        "short_name":  "20TH CENTURY US HIS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This survey course covers the history of the United States from Reconstruction to today through by focusing on migration, race and ethnicity, and citizenship or national belonging. Chronologically organized, the course centers key themes and issues of social, economic, and political importance in both past and present. We will also explore how historical events and their documentation change in meaning and importance over time, and what forces and influences shape these realities. Overall, we will consider the causes, processes, and experiences shaping the arrival of different immigrant groups to the United States at different historical moments. More specifically, we will follow migrations of different groups of people, like African Americans, north and westward European immigrants into coastal port cities and beyond Mexican bracero workers into agricultural industries Chinese laborers work experiences in diverse economic settings and more. We will apply critical lenses toward movements like Americanization and try to understand different groups of citizens divergent experiences with national belonging. We will also interrogate the logics, values, and symbols that shaped ideas regarding ethnic, racial, class, and gender difference, particularly as they were used to characterize difference regarding citizenship.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will be able to critically examine American history and connect seemingly distant events to current socioeconomic and political issues. They will appreciate the impact that the past continues to have on their lives as both American and global citizens. Students will improve their writing and become more efficient oral and written communicatators.SUMMER ONE 2023Students will expand their awareness of historical events, sharpen their understanding of the causes and influences shaping historical development, expand and apply information literacy and communication skills, demonstrate civic minded critical analysisof the influence of immigration on sociopolitical change in the twentieth century United States.",
                                                    "key_topics":  "The course will analyze American history largely through the lens of seemingly \"ordinary\" people who influenced American history. We will take seriously the idea that ordinary people can do extraordinary things. We will take a bottom-up approach to history. We will pay particular attention to cultural conflict and the collective push for equality from minority groups.\n\nSUMMER ONE 2023\nThe course will analyze American history largely through the lens of seemingly \"ordinary\" people who influenced American history. We will take seriously the idea that ordinary people can do extraordinary things. We will take a bottom-up approach to history. We will pay particular attention to cultural conflict and the collective push for equality from minority groups.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "There will be extensive reading, three short (1-2 pp) response papers to a current events reading, two short essays (4-5pp), and a final cumulative essay (6-7pp.)\n\nSUMMER ONE 2023\nThis course will involve substantial reading balanced across short academic articles, chapters from historical non-fiction texts/resource books, one or more works of historical fiction, and occasional current events news/popular media. Beyond a short final paper/presentation, the course will entail small weekly interrelated writing assignments intended to emphasize critical thinking and succinct communication.",
                                                    "relevance":  "Students will better appreciate the \"patterns\" of history. The idea that many social, political, and economic issues that occurred in the 20th century have many similarities to those we currently encounter. By looking at these issues through the lens of ordinary people, students will be able to understand that they are not just bystanders to history but, in fact, impactful contributors to the American story.\n\nSUMMER ONE 2023\nStudents will develop a critical awareness of historical events and sociohistorical forces contributing to or at base of many contemporary social, economic, and political issues, enabling them to better understand and informedly engage with the world around them, specifically the sociopolitical and economic policy structures that shape lived experiences from out-of-sight. Students will develop information literacy skills through diverse source analysis. Students will develop a civic-minded awareness of the ways race and ethnicity reflect constructs and political needs of specific moments and be able to communicate about the values and symbols used to create distinctions in the past and present.",
                                                    "learning_resources":  "While I am still deciding which books to assign (there will be two), students will be required to read various articles and primary sources posted on Canvas\n\nSUMMER ONE 2023\nAll resources will be provided in digital form by the instructor. Possible required resources include articles and books.",
                                                    "extra_time_commitment":  "There will be no extra time commitment outside of the time it takes students to read the brief assigned readings and the two books that are assigned.\n\nSUMMER ONE 2023\nWith the meaningfulness of both lecture and discussion in-part predicated on all participants reading and becoming familiar with the same material, this course requires the commitment of time to reading and note-taking outside of class. Different methods and\nstrategies will be taught and applied throughout the course, but it should be expected that reading will take an additional 1-2 hours/week outside of regular class meetings."
                                            }
}