{
        "code":  "79-267",
        "name":  "The Soviet Union in World War II: Military, Political, and Social History",
        "short_name":  "SVT UN WWII ML PL HS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "On June 22, 1941, Hitler invaded the Soviet Union. German troops surrounded Leningrad in the longest running siege in modern history, reached the outskirts of Moscow, and slaughtered millions of Soviet civilians. Of the 6 million Jews murdered by the Nazis, almost 2 million were killed on Soviet soil. Over 26 million Soviet citizens died in the war. Eventually, the Red Army came back from defeat to free the occupied territories and drive Hitler39s army back to Berlin. Using history, film, poetry, veterans accounts, documentaries, and journalism, this course surveys the great military battles as well as life in the occupied territories and on the home front. It highlights the rise of fascism, the Stalinist purges of the Red Army, and the Nazi massacres of the civilian population. Occasional film screenings may be required.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will learn 1. the diplomatic background to the war2. the ideologies of socialism and fascism3. the prewar purge of the Red Army4. debates over the relationship between Soviet policy and counter intelligence5. the partisan movement and the holocaust in the occupied territory6. the decisive battles of the war7. the siege of Leningrad8. the roots of the Cold WarStudents will learn to work from primary sources to write their own short history based on oral interviews of survivors in the Centropa archive",
                                                    "key_topics":  "This course surveys the role of the Soviet Union in World War II. It reviews the great military battles as well as life in the occupied territories and on the home front. It highlights the rise of fascism, the Stalinist purges of the Red Army, the failures of diplomacy, the siege of Leningrad, the great turn around at Stalingrad, the Nazi massacres of the civilian population, and the Red Army\u0027s liberation of the occupied territories.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "Three 7-10 page papers, and participation in discussion of readings and films",
                                                    "relevance":  "The course profiles a critical but often ignored chapter in World War II, namely the contribution of the Soviet Union to the Allied victory over fascism. The course is essential to a student understanding of global history, of fascism and its ideology, and the Cold War.",
                                                    "learning_resources":  "Books, articles, films, poetry, Centropa archive, veterans\u0027 accounts, documentaries, and journalism.",
                                                    "extra_time_commitment":  "There may be some evening film screenings"
                                            }
}