{
        "code":  "79-205",
        "name":  "20th Century Europe",
        "short_name":  "20TH CENTURY EUROPE",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course surveys the history of Europe from 1900 through the present. We shall examine some of the major political trends and socialeconomic changes of the last century, including the collapse of Europes multiethnic empires and the rise of the modern nationstate the extraordinary violence and impact of WWI and the rise of ethnonationalism and fascism during the interwar period The Spanish Civil War, WWII and the War in the Balkans in the 1990s. We will also examine Communism and its collapse colonial resistance and the process of decolonization and the creation of the European Union. In addressing contemporary Europe, we shall discuss the reemergence of ethnonationalism and rising antiimmigrant sentiment and antisemitism over the last decades cultural and political debates surrounding Islam and Muslims contemporary debates over the memory of the Holocaust, and Russias brutal war against Ukraine.  Primary sources, academic articles, memoir and film will be used in the classroom to explore these topics. Classes will combine lecture, discussion and group work.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will obtain an understanding of the major historical events and ideologies of 20th Century Europe including The end of empire and the rise of the nationstate and ethnonationalism The extraordinary violence of two World Wars and the Spanish Civil War and their continuing impact on politics, society, and culture Social and political movementsregimes of the far right and of the socialistcommunist left The rise and crisis of the European welfare state and of the European Union The wars of the 1990s in the former Yugoslavia Conflicts within the European Union such as Brexit Contemporary debates over World WWII Cultural and political controversies surrounding Islam and Muslims and reemergent antisemitism in Europe.",
                                                    "key_topics":  "The history of Europe from 1900 through today. Including, the end of empire and the rise of the nation-state and ethno-nationalism in Europe; The extraordinary violence of two World Wars and the Spanish Civil War; Social and political movements/regimes of the far right and of the socialist/communist left; The rise of the European Union; The wars of the 1990s in the former Yugoslavia; Conflicts within the European Union such as Brexit; Contemporary debates over historical memory of World WWII; Cultural and political controversies surrounding Islam and Muslims in and re-emergent antisemitism in Europe; Russia\u0027s war against Ukraine.",
                                                    "prerequisite_knowledge":  "No prerequisite knowledge is required.",
                                                    "assessment_structure":  "Students will be required to participate in classroom discussions, to prepare readings and will be responsible for submitting weekly reading comments and several reaction papers.",
                                                    "relevance":  "University students will understand the history of Europe from 1900 to 2000 and beyond and learn how to think and write critically about this history.",
                                                    "learning_resources":  "Primary sources; academic articles; memoirs; documentary film; and news articles.",
                                                    "extra_time_commitment":  null
                                            }
}