{
        "code":  "79-263",
        "name":  "Mao and the Chinese Cultural Revolution",
        "short_name":  "MAO/CHINES CLT RVLTN",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is an indepth examination of Chinas Great Proletarian Cultural Revolution 19661976, one of the most impactful and bewildering events of the twentieth century. It started when Mao Zedong announced that enemies had infiltrated the Communist Party that he led. Soon students were attacking their teachers, teenagers in army uniforms were raiding homes and destroying remnants of feudal and bourgeois culture, and armed fighting had erupted among factions of ordinary Chinese people. Why What were the political and social dynamics of Maoist China that propelled it along this violent trajectory What was everyday life like during the Cultural Revolution, an event that could be both terrifying and empowering for those that lived through it What were the social, political and cultural consequences How has the Cultural Revolution been judged in China and the west, and are their other possible interpretations This class will explore these questions from a variety of perspectives and sources, including documents, literature, memoir, film, academic writings, visual arts and performing arts.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}