{
        "code":  "79-204",
        "name":  "American Environmental History",
        "short_name":  "AMERCN ENVIRON HIST",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course examines how people in North America have interacted with their surroundings from the end of the last ice age to the present.  This course fulfills Dietrich Colleges Contextual Thinking general education requirement.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The goals of this course are to a deepen your understanding of the interaction between people and their environments over time, and b advance your critical and contextual thinking skills. By the end of the course, you should be able to meet these objectives\n1. To explain how people in North America have interacted with their surroundings over time. You should be able\nto identify similarities and differences between periods.\n2. To explain how the past has shaped the world in which we live, which will help you put todays environmental problems into social and historical context. We do not create a new world each day. We modify a world inherited from our predecessors. Studying the past is one of the best ways to understand the opportunities and challenges facing us today.\n3. To pose questions about the world, analyze data, and express conclusions clearly. These skills are important for college, work, personal lives, and democracy.",
                                                    "key_topics":  "Topics include Native American economics, colonialism, westward expansion, industrialization, romanticism, conservation, and environmentalism.",
                                                    "prerequisite_knowledge":  "No prerequisite knowledge is required.",
                                                    "assessment_structure":  "Students will be evaluated on performance on exams, short papers, and discussion.",
                                                    "relevance":  "This course fulfills Dietrich College\u0027s \"Contextual Thinking\" general education requirement. (For Dietrich\u0027s GenEd program prior to 2021, this course fulfills the \"Reflecting\" requirement.)\n\nThis course will help students understand the origins of environmental problems and solutions in the past, which will help them place current environmental problems (including climate change) and solutions in their historical and social contexts.",
                                                    "learning_resources":  "Students will read Ted Steinberg, \"Down to Earth,\" and primary and secondary sources provided via Canvas.",
                                                    "extra_time_commitment":  null
                                            }
}