{
        "code":  "79-212",
        "name":  "Jim Crow America",
        "short_name":  "JIM CROW AMERICA",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Michelle Alexanders The New Jim Crow The New Pres 2010 has drawn attention to the ways that American institutions and social systems continue to produce racial inequalities. The recent failure of federal voting rights bills in the United States Congress and the proliferation of stateled efforts to constrain voting rights have led activists to claim Jim Crow 2.0. Using these presentday assessments as a point of departure, this course introduces students to the Jim Crow period of American history spanning the late nineteenth century to the midtwentieth century. From the 1890s to the 1950s, Black freedoms were limited by the policies and practices of racial segregation in the Jim Crow system of American apartheid. This course critically examines Black life in Jim Crow America, from the halls of federal power, to the everyday practices of racial subjugation and resistance. It examines crosscutting themes how racial segregation structured the legal, social, economic, and political sectors of American life the role of national, state, and local policy mandating racial segregation African American modes of resistancevigilante and state racial violence. This course will also endeavor to make connections between the consequences of antiBlack racism and the social life of other American minoritized populations. Throughout the course, as an exercise in historical Interpretation and periodization, students will consider the question Is this current moment Jim Crow 2.0.  This course fulfills Dietrich Colleges Contextual Thinking general education requirement.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1.Students will be introduced to the essentials of historical study and practice including analysis of primary and secondary\nsources2.Students will learn about the Jim Crow period of American history, and how African Americans responded and resisted patterns of segregation and exclusion.3.Students will compare and contrast historical periods paying close attention to the 5 cs of history Chronology, Context, change over time, causality, and complexity. 4.Students will learn about the political uses of history",
                                                    "key_topics":  "1.\tUnited States History, 20th C.\n\n2.\tAfrican American History, 20th C.\n\n3.\tRacial Segregation (Law/policy, education, housing, employment, medicine/health)",
                                                    "prerequisite_knowledge":  "Some understanding of major events in 19th and 20th c. United States history including the American Civil War, Reconstruction, World Wars I \u0026 II, and the Great Migration would be helpful, but not required.",
                                                    "assessment_structure":  "1.\tStudents will be expected to participate fully in class discussions.\n\n2.\tStudents will complete weekly writing response assignments.\n\n3.\tStudents will have two short writing assignments.\n\n4.\tStudents will complete a final long paper.",
                                                    "relevance":  "This course fulfills Dietrich College\u0027s \"Contextual Thinking\" general education requirement.\n\nThis course will situate current debates about the history of racial inequality in the United States in historical context.",
                                                    "learning_resources":  "Course Canvas Page will include all relevant course materials including syllabi.",
                                                    "extra_time_commitment":  null
                                            }
}