{
        "code":  "79-264",
        "name":  "Tibet and China: History and Propaganda",
        "short_name":  "TIBET AND CHINA",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is an introduction to the Tibet Question, the dispute over whether Tibet should be part of China, an independent nationstate, or, as the current Dalai Lama now advocates, something in between. History often serves as the battleground on which competing visions of the nation are fought  who should be included and excluded, where natural boundaries begin and end. This almost always requires a process of simplification in which inconvenient details are forgotten or repurposed in the service of national agendas. The Tibet Question is a telling example. In this class, we investigate the historical relationship between China and Tibet from the 13th century through the present, and note the ways advocates on both sides of the Tibet Question have constructed historical narratives propaganda in support of their political positions. We will also discuss the prospects for a political solution and consider the lessons the Tibet Question may hold for understanding other outstanding historical disputes.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "A primary goal of all history courses is to develop the ability to think critically and creatively. In this course, we will seek to 1. Introduce Tibetan history and the history of the SinoTibetan Dispute2. Strengthen abilities to critically analyze and asses various types of source material and narratives3. Develop skills as writers able to analyze sources and support arguments based on evidence4. Increase awareness, knowledge and sensitivity toward nonwestern cultures and societies5. Demonstrate that the past is not static, but it is continuously being reconstructed and appropriated according by often competing interests",
                                                    "key_topics":  "This course investigates the historical relationship between \"China\" and \"Tibet\" from the 13th century through the present, and note the ways advocates on both sides of the \"Tibet Question\" have constructed historical narratives (propaganda) in support of their political positions. We will also discuss the prospects for a political solution and consider the lessons the \"Tibet Question\" may hold for understanding other outstanding \"historical\" disputes.",
                                                    "prerequisite_knowledge":  "No prerequisites",
                                                    "assessment_structure":  "In class presentations, short reflection papers, final essay",
                                                    "relevance":  "In addition to introducing the history of Sino-Tibetan relations and the \"Tibet Question,\" this course provides students the opportunity to investigate ways in which \"history\" often serves as a battleground on which competing visions of the nation are waged.",
                                                    "learning_resources":  "Primary and secondary readings, film to be viewed outside of class",
                                                    "extra_time_commitment":  null
                                            }
}