{
        "code":  "79-207",
        "name":  "Asian American History through the Novel",
        "short_name":  "ASN AMRC HISTY NOVEL",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course examines the interwoven histories of migration, language, and identity formation and reformation in Asian American experience. How have migrant and diasporic identities been represented in fictional or quasifictional terms How have factors such as race, religion, class, gender, and sexuality shaped everyday Asian American life And how can literary sources enrich our understanding of such historical experiences Course readings consist primarily of novels, representing a variety of Asian ethnicities and experiences, by authors including Gaiutra Bahadur, Carlos Bulosan, Maxine Hong Kingston, Joy Kogawa, ChangRae Lee, and John Okada. These works are supplemented by selected historical documents and short lectures to shed additional light onto the sociohistorical contexts and issues under study.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1. Students will deepen their understanding of Asian American histories and experiences and narrativizations thereof.2. Students will improve their ability to evaluate and make crossdisciplinary, evidencebased arguments.3. Students will learn to write more clearly and persuasively, through a mix of analytical, creative, and researchbased writing assignments.4. Students will hone their skills of academic debate and deliberation in a respectful and reflective atmosphere.",
                                                    "key_topics":  "1. Thematic issues (race, culture, language, discrimination, etc.) and experiences in Asian\nAmerican history\n2. How to study and think about the past using diverse texts and sources",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Active participation in class discussions, a 10-minute in-class presentation, a short essay (3-4 pages), a midterm creative writing assignment (5-7 pages), and a final paper (7-8 pages).",
                                                    "relevance":  "By the end of this course, students will have deepened their knowledge of assorted topics in Asian American history and improved their ability to analyze and write about diverse kinds of texts (historical as well as literary).",
                                                    "learning_resources":  "Six novels and a moderate number of supplementary readings on Canvas.",
                                                    "extra_time_commitment":  null
                                            }
}