{
        "code":  "79-262",
        "name":  "Modern China: From the Birth of Mao ... to Now",
        "short_name":  "MODERN CHINA",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is an introduction to major themes in twentiethcentury Chinese history, including the transition from empire to nation, revolution, social change and modernization, western and Japanese imperialism, the rise of the partystate, Chinese socialism, economic liberalization and the socalled Chinese Dream.  The first half of the class is devoted to the period between the fall of the imperial system and the founding of the Peoples Republic of China 19111949.  If the victory of the Chinese Communist Party and development of the socialist state are to be considered in historical context, it is necessary to first understand the political, cultural, economic and intellectual currents that immediately preceded them. During the second half of the course, we will examine the Maoist period 19491976. We will investigate the Chinese Communist Party as both a statebuilding institution and an engine of social transformation, and consider the tensions these dual roles produced.  Finally, we will look at the Reform Period 1978present, and reflect on a newly robust Chinas attempts to come to terms with its own recent past and what the consequences might be for both China and the world. This course meets the Dietrich Gen Ed Contextual Thinking requirement.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Course goals include 1. Introduce the history of 20thcentury China2. Strengthen ability to critically analyze various types of primary and secondary source material3. Develop skills as writers able to analyze sources and support arguments based on evidence4. Engage scholarly debates on topics such as empire and nation, tradition and modernity, social movements and revolution, imperialism, socialism, neoliberalism and globalization5. Increase awareness, knowledge and sensitivity toward nonwestern cultures and societies.",
                                                    "key_topics":  "This course is an introduction to major themes in twentieth-century Chinese history, including the transition from empire to nation, revolution, social change and modernization, western imperialism, the rise of the party-state, Chinese socialism, economic liberalization and the so-called \"Chinese Dream.\"",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "Written assignments and exams, in addition to class participation.",
                                                    "relevance":  "Dietrich Gen Ed: Foundations - Contextual Thinking\n\nFurthermore, students will critically engage in debates on topics such as empire and nation, tradition and modernity, social movements and revolution, imperialism, socialism, neoliberalism and globalization.",
                                                    "learning_resources":  "Primary documents, secondary readings, and documentary film.",
                                                    "extra_time_commitment":  null
                                            }
}