{
        "code":  "79-234",
        "name":  "Technology and Society",
        "short_name":  "TECHNOLOGY \u0026 SOCIETY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "How has technology shaped human society And how have human beings shaped technology in return This course investigates these questions across historyfrom stone tools, agriculture, and ancient cities to windmills, cathedrals, and the printing press from railroads, electricity, and airplanes to atom bombs, the internet, and the dishwasher. In analyzing these tools, we will explore the dynamic relationships between technological systems and the social, political, religious, artistic, and economic worlds in which they emerged. We will also pay particular attention to technologys effects, asking both who benefited from and who was harmed by technological change. By the end of the course, students will be able to reflect critically on how humanity chooses which technologies to exploit and how human societies have been transformed by these choices. This course meets the Dietrich Gen Ed Humanities requirement.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will gain detailed knowledge about the development and impact of a variety of historicallysignificant technologies. More broadly, students will be able to reflect critically on the ways in which individuals and groups have chosen which technologies todevelop and use as well as how societies have been transformed by these choices.",
                                                    "key_topics":  "The course will explore the dynamic relationships between technological artifacts and systems and the social, economic, political, and cultural environments from which they emerged over the past 5,000 years of human history.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "Students will be assigned weekly readings and discussion posts and will complete three papers over the course of the semester. Participation in in-class discussions and class activities will contribute to the final grade.",
                                                    "relevance":  "Dietrich Gen Ed: Disciplinary Perspectives - Humanities\n\nFor majors in the humanities and social sciences, the course will provide both a concrete engagement with historically-significant technologies and an introduction to the contributions of history of technology to historical thinking more generally. It will also\nhelp students in engineering and other technical fields to think critically about the history of their own disciplines and evaluate contemporary practices in a broader historical frame.",
                                                    "learning_resources":  "Students will read a selection of scholarly articles and selected chapters from synthetic texts in the global history of technology. They will also engage with a variety of primary sources, including both textual and visual materials and physical objects. Students will\nencounter theoretical, ethnographic, oral history, and case-study resources from a variety of virtual databases.",
                                                    "extra_time_commitment":  "Students will be required to complete assigned course readings in advance of the course meeting associated with those specific readings. There are no major external commitments outside of regularly scheduled meeting times, though the instructor may\narrange for voluntary enrichment activities (film screenings, field trips, etc.) related to course themes that may students may opto attend or not with no effect on grade or class standing."
                                            }
}