{
        "code":  "79-210",
        "name":  "Identity, Ethnicity, and Place in Modern China",
        "short_name":  "IDENTITY IN CHINA",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Within popular imagination, China is often considered to be the worlds oldest nation. As a result, concepts such as China and Chinese have become so embedded in our consciousness that we often fail to consider how, like all identities, ideas of Chineseness have been constructed handinhand with the invention of the modern Chinese nationstate. This course examines nationmaking in China from the outside in. We privilege avenues of inquiry that challenge statesponsored narratives, complicate the hegemonic notion of Han as a majority identity, and consider ways in which processes of state consolidation and majoritization have subjected various ethnic, subethnic, diasporic, linguistic, gender, and religious communities to discrimination, marginalization, exclusion, and in some cases state and majoritarian violence. Rather than uncritically accepting the notion that China is a uniquely historical nation, we instead consider the possibility that the Chinese state and nation are products of the same transglobal currentssuch as imperialism, settler colonialism, assimilation, minoritization, and exclusion that has made our modern world. Whenever possible, we employ historical texts, short stories, novels, memoirs, and film produced by members of disadvantaged, marginalized, andor targeted communities in order to demonstrate how and why historical experiences and memories for example among ethnic minorities differ from the Han majority and from state orthodoxy, and why these differing perspectives matter.  This course fulfills Dietrich Colleges Perspectives on Justice and Injustice general education requirement.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Explore how the idea of Chineseness is constructed and contested within greater China and in the diaspora and its relation to other ethnic, subethnic, diasporic, gendered, and regional identitiesAnalyze how privilege and marginalization are systematized through political, economic, educational, and territorial institutions of state powerDemonstrate ways in which modern identities in the era of nationstates differ from those held under previous political formations.Raise awareness of diversity, inequality, and systematic racism in China as well as in comparative perspectiveIncrease awareness, knowledge and sensitivity toward nonwestern cultures and societiesConsider our ethical obligations and the limits to our ability for direct action in the context of an authoritarian state which has made dissent a criminal actStrengthen ability to critically analyze various types of primary and secondary source materialDevelop skills as writers able to analyze sources and support arguments based on evidence Demonstrate that the past is not static, but it is continuously being reconstructed and appropriated, often by competing interests",
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  "No prerequisite knowledge is required.",
                                                    "assessment_structure":  "Submitted Reading Responses, Class Discussion, Two Short Essays, Final Paper \u0026 Presentation",
                                                    "relevance":  "Dietrich GenEd: Perspectives on Justice and Injustice.",
                                                    "learning_resources":  "Combination of books students acquire, plus many readings posted on Canvas.",
                                                    "extra_time_commitment":  null
                                            }
}