{
        "code":  "79-201",
        "name":  "Introduction to Anthropology",
        "short_name":  "INTRO ANTHROPOLOGY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Anthropologist Ruth Benedict claimed that anthropologys mission is truly to make the world safe for human difference. Cultural anthropologists make the strange familiar and the familiar strange, attempting to understand the internal logic of cultures which might, at first glance, seem bizarre to us. At the same time, anthropologists probe those aspects of our own society which might appear equally bizarre to outsiders. The goal of this course is to raise questions basic to the study of culture and social relationships in a multitude of contexts. We will also discuss the particular research methods informing anthropology, as well as anthropologists relationship to the people they study, and the responsibilities informing those relationships. The readings focus on topics that have long captured anthropologists attention and that continue to be intensely debated social inequality, race, colonialism, body, kinship, religion, gender, social lives of things, globalization and migration. Through written work, including ethnographic readings and a novel, films, and inclass discussions, we will examine how anthropology makes us more aware of our own culturally ingrained assumptions, while broadening our understanding of human experiences. This course is structured as a combination of lectures and seminar discussions. In the first part of the course, I will give a lecture every week, followed by a class session that will focus solely on discussing the readings and key concepts. In the second part of the course, I will introduce the readings by placing them within larger debates, but the course will become more discussion oriented. This course meets the Dietrich Gen Ed Social Sciences requirement. This class also satisfies one of the core requirements for the Anthropology minor.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will 1 identify and describe foundational questions in cultural anthropology and the major contributions of the field to our understanding of cultural and social difference, 2 distinguish the research methods of anthropologists and assess the ethical issues that emerge in the practice of ethnography, and 3 apply key tools and concepts of critical social analysis.Students will explain how anthropologists formulate theories about cultural variation by drawing on multifarious evidence conversations, participant observation, as well as archives and written primary sources. Also, they will describe and critique arguments that emerge from the class readings and lectures to evaluate the strength and resonance of the conclusions.In addition, the course will be writing intensive, which will enable students to strengthen their writing skills and build up their ability to develop persuasive and well structured arguments.",
                                                    "key_topics":  "The readings focus on topics that have long captured anthropologists\u0027 attention and that continue to be intensely debated: social inequality, race, colonialism, body, kinship, religion, gender, social lives of things, globalization and migration. Through readings,\ndocumentaries, and class discussions, we will examine how anthropology makes us more aware of our own culturally ingrained assumptions, while broadening our understanding of human experiences.\n\nThey reveal the diversity of human practices and experiences across time and space, as well as the wide range of approaches to these practices within the field of anthropology.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "* Attendance and participation (25% of the final grade)\n* Group presentation of a book (15%)\n* Paper 1 (20%)\n* Paper 2 (based on a visit to a museum) (20%)\n* Paper 3: review of the book you presented in class, as part of the group presentations (20%)",
                                                    "relevance":  "Dietrich Gen Ed: Disciplinary Perspectives - Social Sciences\n\nThrough written work, readings, films, and in-class discussion, we will examine how anthropology makes us more aware of our own culturally-ingrained assumptions, while broadening our understanding of human experiences.",
                                                    "learning_resources":  "The resources will include articles and books chapters, two books, two documentaries to be watched outside the class, and lectures.",
                                                    "extra_time_commitment":  "No extra time commitments."
                                            }
}