{
        "code":  "79-222",
        "name":  "China and the Second World War",
        "short_name":  "CHINA AND WWII",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is an introduction to Chinas experiences during the Second World War. Although Chinas involvement in the war is often considered to be of secondary importance, it was in China that the war began 1937 and China was occupied longer than any other allied country. Throughout, sustained Chinese resistance ensured that 1.5 million Japanese troops could not be transferred to other war theaters. However, it came at great cost. Only the Soviet Union suffered more casualties during World War II, perhaps as many as 20 million lives lost. In this class we explore the roots of the Second World War in both China and Japan, trace the political and military history of the war, contemplate the terrible levels of violence that were inflicated upon the Chinese population, including violence committed by Chinese forces, seek to understand the social impact of the war, and think about the consequences of the war for China and the world, including the rise of Mao Zedongs Chinese Communist Party. We also explore the manner in which the war is commemorated in China and Japan and the role communal memory plays in galvanizing nationalism among both the Chinese and Japanese publics.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}