{
        "code":  "79-235",
        "name":  "Crime and Punishment in Russian History and Culture",
        "short_name":  "CRIME/PUNISH RUS HIS",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Crime and punishment constitute not only the title of a classic Russian novel, but an enduring theme in Russian history. Russian art and literature are rich in scenes of exile and incarceration, and the history of a modernizing states efforts to control both crime and dissent through judicial systems reveals the shifting boundaries of its power over its people. At a moment when Americans are increasingly questioning policing and mass incarceration in their own country, this course offers students a way to understand how crime and punishment have been constructed in a different historical context.  Russian and Soviet practices of punishment have often embodied acute clashes of values between different social, national, and ideological groups. Actions deemed criminal by one group may be seen as justified, even admirable, by another. The course will deepen students understanding of those values as well as familiarizing them with the lived experiences of people whose circumstances or convictions led them to courts, exile, and incarceration. Using novels, poetry, memoirs, archival and visual materials, we will consider such questions as How did peasants avoid or invoke the Tsarist state to order their communal lives How did revolutionaries use the jury trial to propagate their ideas Why did Marxists believe that a socialist state would have no need for a legal system How did prisoners in the Gulag make sense of their experiences Assessment will include participation in class discussion, short written assignments, and a final project.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will understand the methods Russian people used to control criminal or harmful behavior in the absence of a strong or trusted state presenceStudents will evaluate the relationship between legal and judicial structures and the political and revolutionary activity these structures were supposed to repress in the Imperial periodStudents will understand why Communists made reforms to the legal and judicial systems in light of their ideologyStudents will understand how the Soviet state and people used law enforcement and judicial structures in the Terror of the 1930s Students will learn about life in exile and prison for criminal and dissident convicts at different stages in Russian and Soviet historyStudents will read and discuss passages from Russian and Soviet literature and memoir in the context of this history",
                                                    "key_topics":  "Crime\nSocial control\nPrison and punishment\nRepression of political opposition\nRevolutionary activity\nRussian and Soviet history",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Class discussions, short written assignments, final project",
                                                    "relevance":  "Students will better understand relationships between crime, political dissidence, revolutionary activity, and the state by exploring these phenomena in the context of Russian history.",
                                                    "learning_resources":  "Variety of primary and secondary sources, usually",
                                                    "extra_time_commitment":  null
                                            }
}