{
        "code":  "79-229",
        "name":  "The Origins of the Palestinian-Israeli Conflict, 1880-1948",
        "short_name":  "PALESTIN-ISRAEL,1880",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course considers the historical origins of the contemporary ArabIsraeli conflict, beginning with the decline of the Ottoman Empire and the rise of Arab nationalism and Zionism in the late 19th century and emphasizing the period of the British Mandate over Palestine 19201948. Students will move beyond textbooks to explore primary source documents, maps, photographs, biographies and historical testimony. For five weeks in the middle of the semester, students will immerse themselves in an extended roleplaying exercise, The Struggle for Palestine, 1936, an elaborate simulation game linked to Barnard Colleges Reacting to the Past program. Students portraying British examiners, specific Arab and Zionist characters and journalists will recreate the activities of the 1936 Royal Commission that came to Palestine to investigate the causes of an Arab rebellion and ArabJewish strife. This historical reenactment experience constitutes an exciting pedagogical opportunity for delving deeper into the topic material than regular coursework allows. All the roleplaying will take place during regular class time, but students should be aware that they will need to devote outside time for preparation and research. Outstanding attendance is also a requirement. Regular classroom activity resumes at the end of the five weeks. The goal of the course is for students to develop a nuanced understanding of the varying goals and priorities of all the actors in Mandate Palestine. Running throughout the course is the question, was peace ever possible",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The goal of the course is for students to develop a nuanced understanding of the varying goals and priorities of all the actors in Mandate Palestine. In the process students should enhance their skills in reading critically so as to analyze evidence, arguments, and competing interpretations and to challenge assumptions and values in writing analytical, historical arguments based upon the careful use of evidence, language, reasoning, and organization in presenting arguments orally and in understanding events within the context of a specific time and space.",
                                                    "key_topics":  "This course considers the historical origins and development of the contemporary Arab-Israeli conflict, beginning with the decline of the Ottoman Empire and the rise of Arab nationalism and Zionism in the late 19th century and emphasizing the period of the British Mandate over Palestine (1920-1948).",
                                                    "prerequisite_knowledge":  "There is no prerequisite knowledge required or assumed.",
                                                    "assessment_structure":  "Students will be assessed based on 2 documentary analyses, a photo essay, participation in the extended role playing exercise (which includes 3 short written assignments) and a final one-day simulation, attendance, class participation and a final exam.",
                                                    "relevance":  "Students will understand the historical background of the Arab-Israeli conflict and will be able to follow and understand current events and breaking news from the Middle East / Arab-Israeli / Palestinian-Israeli arenas.",
                                                    "learning_resources":  "Assigned readings come from two textbooks, from the Canvas site, and from primary source document sites, all clearly indicated on the syllabus. I will provide the students with unpublished materials relevant to the role playing activity.",
                                                    "extra_time_commitment":  "Yes, preparation for the role-playing exercise requires significant outside reading and group-work."
                                            }
}