{
        "code":  "79-255",
        "name":  "Modern Ireland:  Politics and Culture from the Famine (1847) to Today",
        "short_name":  "MODERN IRELAND",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "[Note students who have already taken this course under its former number 79255 and former titles, Irish History, or Politics, Religion, and Conflict in the 19th and 20th Century Ireland, may not enroll.    This course studies the political, economic and social development of Ireland across its long nineteenth century.  Beginning with the social and economic effects of the Famine of the 1840s, it studies Irelands growing incorporation into the Britishcentric global economy, the growing role of Catholicism in Irish politics, the cultural ferment of the late nineteenth century and the events leading up to formal independence in 1922.  Following on from this, the course reviews the development of the two Irelands the Republic of Ireland and Northern Ireland, the rise to hegemony of Fianna Fil and the Ulster Unionist Party, the politics of gender and sexuality in two of western Europes most conservative societies, violence in Northern Ireland, and rapid economic, social and political changes since the 1990s.  Ultimately, this course seeks to use Ireland as a case study for understanding the history of small nations and modern European nationalism as well as economic and political development on the periphery of Europe.  This course fulfills Dietrich Colleges Humanities general education requirement.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "As well as gaining an indepth empirical knowledge of modern Irish history, students will also gain experience in the study of controversial issues like religion, nationalism, gender relations, and the politics of sexuality.",
                                                    "key_topics":  "Nationalism, Religion, Church-State Relations, Postcolonialism, Gender, Sexuality, Conflicts and Terrorism.",
                                                    "prerequisite_knowledge":  "No prerequisite knowledge is required.",
                                                    "assessment_structure":  "Students will be assessed through a joint reading response and paper and an in-class presentation. They will also have a participation/attendance grade.",
                                                    "relevance":  "This course fulfills Dietrich College\u0027s \"Humanities\" general education requirement.\n\nIn the wake of of Brexit, an event complicated by the role of the Irish border, students will understand the history of Ireland that has led to this moment.The course seeks to use Ireland as a case study for understanding the history of small nations, economic and political development on the periphery of Europe, and the history of modern European nationalism.",
                                                    "learning_resources":  "Readings will be made available via Canvas. This course is primarily chronologically organised and lecture-based. This, however, is broken up with discussion-based classes, which will focus on larger issues thematic issues in modern Irish history.",
                                                    "extra_time_commitment":  "Beyond regularly scheduled course meeting times, students will be expected to spend time outside of class reading and writing as required for the course assignments. Aside from this there are no other extra time commitments required."
                                            }
}