{
        "code":  "79-242",
        "name":  "African American History: Reconstruction to the Present",
        "short_name":  "AFR AMR HST: REC PRS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course explores changes in the African American experience from the end of the Civil War to the emerging era of Joe Biden and Kamala Harris.  Through an examination of a wide range of scholarly and popular debates in African American life and history, this course will emphasize transformations in both inter and intrarace relations economic mobility as well as economic inequality and forms of political engagement and grassroots movements for social change. We will explore these developments under the impact of the segregationist regime the Great Migration the rise of the urbanindustrial working class increasing residential segregation growth and expansion of the middle class and the fluorescence of the Modern Black Liberation Movement. Students will compare the dynamics of the contemporary Black Lives Matter Movement with earlier 20th century grassroots social and political movements in African American and U.S. history. Finally, based upon a mix of primary and secondary sources and lectures, students will write a series of short analytical essays and establish their own unique interpretation of key issues in Black History.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will develop skills in the identification and use of diverse sources to forging their own interpretation and understanding of controversial issues in African American and U.S. history.",
                                                    "key_topics":  "This course explores changes in African American migration, work, housing, living conditions, institutions, and politics from the end of the Civil War to the emerging era of Joe Biden and Kamala Harris.",
                                                    "prerequisite_knowledge":  "No prerequisite knowledge is required.",
                                                    "assessment_structure":  "In addition to discussion of weekly reading assignments, students will be assessed on the basis of several critical essays (5-7 pages type-written and double-spaced) on specific facets of the African American experience.",
                                                    "relevance":  "In today\u0027s changing world of race and class relations, this course will enable students to place some of the most divisive issues in contemporary American society in historical perspective.",
                                                    "learning_resources":  "Student will read a series of local case studies of the African American experience, supplemented by a set of primary documents.",
                                                    "extra_time_commitment":  null
                                            }
}