{
        "code":  "79-361",
        "name":  "Nation, Culture, and Society in South Asian Cinema",
        "short_name":  "SOUTH ASIAN CINEMA",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course uses cinema to explore the portrayal of contemporary South Asia. It traces the development of South Asia through film and highlights the changing images of the region since the 1950s. In addition to outlining the political history of South Asia, themes of nationbuilding, political culture, corruption, inequality, and social tension based on gender, caste, religion, region, and language, as well as transnationalglobal South Asian cinema, will be addressed.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1. An understanding of the uses of cinema as a primary source for understanding social,cultural, and political change in South Asia.2. Consider films critically from the perspective of history and film studies and thehistorical and cultural context in which they have been created.3. Analyze the films looking at visual, aural, and narrative concerns and locate themwithin South Asian society.4. Trace the creation of the idea of a nation through films like 39Mother India39 and39Bombay,39 and will explore the positioning of culture, gender, and state in South Asianmovies.5. Directly engage with the films and assess them regarding essential readings fromsecondary sources and theoretical texts.6. Awareness of the primary historiographical debates and themes in the study of postcolonial South Asia7. Ability to analyze independently historical evidence8. To understand the changing relationship between cinema and the broader societythrough the period.",
                                                    "key_topics":  "This course uses cinema to explore the portrayal of contemporary South Asia. It traces\nthe development of South Asia through film and highlights the changing images of the\nregion since the 1950s. In addition to outlining the political history of South Asia,\nthemes of nation-building, political culture, corruption, inequality, and social tension\nbased on gender, caste, religion, region, and language, as well as transnational/global\nSouth Asian cinema, will be addressed.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "There will be extensive reading, film-viweing, a mid-semester exam, and final research\npaper , along with a student presentations.\nThe breakdown is as follows:\nParticipation in class discussions   - 30% \nMid-term - 15% \nResearch paper  - 20 % \nReflection journals -15%    \nGroup Presentation - 15%\nAttendance - 5%\nTotal - 100%",
                                                    "relevance":  "This course will be relevant to students interested in examining the social, cultural,\neconomic, and political forces that shaped the development of post-colonial South Asia\nfrom independence to the present day through the medium of one visual medium -\ncinema.",
                                                    "learning_resources":  "Students will be required to read secondary texts and peer-reviewed articles. Chapters\nfrom these texts/articles will be posted on canvas weekly.",
                                                    "extra_time_commitment":  null
                                            }
}