{
        "code":  "79-386",
        "name":  "A Tale of Two Epidemics: Influenza 1918 and Covid 19",
        "short_name":  "TALE OF TWO EPIDEMIC",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will compare the experiences of Americans during its two deadliest pandemics, the Influenza 1918 epidemic and the Covid19 epidemic. Each week we will compare a facet of the two epidemics, such as government responses, medical knowledge, public health measures, African American experiences, global dimensions, and more. Students will do guided original research comparing a facet of the two epidemics.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will increase their knowledge of epidemics in history, enhance their research skills, and selfpublish a book of student research.",
                                                    "key_topics":  "This course will compare the experiences of Americans during its two deadliest pandemics, the Influenza 1918 epidemic and the Covid-19 epidemic.",
                                                    "prerequisite_knowledge":  "No prerequisites.",
                                                    "assessment_structure":  "The course will have readings, discussion, essays, a research project and paper, and oral presentations.",
                                                    "relevance":  "The course will help students understand their experience of the Covid-19 epidemic by putting it in a historical context.",
                                                    "learning_resources":  "Course materials will be available on line through Canvas, the CMU library, and other web sites.",
                                                    "extra_time_commitment":  null
                                            }
}