{
        "code":  "79-395",
        "name":  "The Arts in Pittsburgh",
        "short_name":  "ARTS IN PITTSBURGH",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will examine the arts in Pittsburgh, both historically and in the present. We will pay special attention to musical events and art exhibits scheduled by the citys concert halls and art museums, several of which we will attend as a group. Our curriculum, in other words, will derive partly from the citys artistic presentations themselves, which will provide a springboard for reading assignments, discussions, a small research project which I will work out individually with each of you, and one or two essay exams.    The History Department will pay for students admission to all museums. However, students will be charged a supplemental fee at discounted prices to help subsidize the considerable expense of purchasing tickets for performances by the Pittsburgh Symphony, Pittsburgh Opera, Pittsburgh Ballet, Chamber Music Pittsburgh, or other musical organizations. Attendance at all musical events and art exhibits is required.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "To make students active citizens who participate in the cultural life of their community.",
                                                    "key_topics":  "The course will examine the arts in Pittsburgh, both historically and in the present.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "Active reading, book reports, a small research paper (instructor will work individual with students on this assignment).",
                                                    "relevance":  "Students will learn about and experience several key components of modern-day cultural life in Pittsburgh.",
                                                    "learning_resources":  "The \"curriculum\" will derive from the artistic presentations themselves, which will provide a springboard for reading assignments and research papers in the history of music and art.",
                                                    "extra_time_commitment":  "Availability to attend musical events and art exhibits on Sunday afternoons."
                                            }
}