{
        "code":  "79-300",
        "name":  "Controversial Topics in the History of American Public Policy",
        "short_name":  "HSTRY AMERCN PUB POL",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course traces the development of US domestic public policy, the growth of the federal government, and the changing relationship among citizens, states, and the federal government over time. We begin with an examination of the current policy landscape and then go back in time to understand how we got to where we are today. We very quickly discover that our current political predicaments are not accidental. Particular people or groups across the political spectrum have worked hard to shape public policy at various critical points in history and have reaped tremendous benefit, even if their influence makes the overall system unstable or unworkable today. We identify critical moments of crisis or change in American politics, examine the imaginaries and policy levers available to people at that time, and explain how policy decisions were made. Students will gain a clear understanding of how interests and political will have been cultivated and mobilized in the past, which can offer them useful models for advancing their own priorities and those of their generation. Topics covered currently include health care and health insurance, abortion, and immigration. This course meets the Dietrich Gen Ed Contextual Thinking requirement.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1 Describe past domestic public policy debates in the United States that exemplify a broad range of historical and contemporary concerns.2 Describe some aspects of the expansion and contraction of federal intervention in social and economic life over the past 200plus years, and evaluate arguments for and against these actions.3 Document the changing relationship among citizens, states, and the federal government over time.4 Critically analyze how historical actors argued for and against particular policy choices using a broad range of primary and secondary sources.5 Explain how past policy decisions helped create the political, social, and healthsituation that were dealing with today and how we can create a better future by making better policy decisions.6 Constructively debate particular policy choices by appreciating the importance of considering and responding to counterarguments to the claims you are making. 7 Apply the contextual thinking approach learned in this class to other courses you take at Carnegie Mellon.",
                                                    "key_topics":  "This course will describe and analyze aspects of the development of public policy in the United States from the colonial era to the present, with a focus on the post-Civil War era. Topics covered include health care and health insurance, abortion, and immigration.",
                                                    "prerequisite_knowledge":  "Students should have a basic introductory-level understanding of American History.",
                                                    "assessment_structure":  "Students\u0027 Final Grade will be based on Participation and Attendance plus performance on three relatively equally weighted assignments throughout the semester. The exact nature of these assignments changes from year to year, but typically include at least one academic essay as well an Op-ed assignment, policy brief, and/or a debate.",
                                                    "relevance":  "Dietrich Gen Ed: Foundations - Contextual Thinking\n\nThis course will help you make sense of the current debates about domestic public policy.",
                                                    "learning_resources":  "Students will be required to do assigned readings, listen to podcasts/media broadcasts, watch documentaries that involve immigration and healthcare/health insurance, and keep up with current news on the topics we address in the class. Most resources are provided free via Canvas or the university library. Occasionally students need to rent a documentary for a small cost.",
                                                    "extra_time_commitment":  null
                                            }
}