{
        "code":  "79-377",
        "name":  "Food, Culture, and Power: A History of Eating",
        "short_name":  "FOOD: HISTORY EATING",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "How can human societies ensure that 8 billion people have enough good food to eat without exploiting people or the planet This course will start with the assumption that the answer to that question requires not only technological innovations, but also an understanding of the cultural and political dimensions of food. For the first half of the course, we will explore the history of human eating, starting in deep time and then moving toward the present, considering along the way the historical evolution of food production and consumption, paying attention to both cultural diversity and cultural exchanges of foods and cuisine.  Students will pursue individual research projects focused on a topic of their choose related to major course themes during the second half of the semester. Evaluation based on inclass participation, analytical reflections on weekly readings, and the research paper.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Overall goals include giving students experience defining and carrying out an analytical paper focused on food and gaining knowledge of historical and contemporary food systems.",
                                                    "key_topics":  "This course will introduce students to interdisciplinary perspectives on food and cuisine with an emphasis on connection food production and food consumption. We will consider cultural, economic, ecological, and political dimensions of food.",
                                                    "prerequisite_knowledge":  "No prior content knowledge required; strong reading and writing skills helpful.",
                                                    "assessment_structure":  "Weekly readings and short writing assignments during the first half of the semester; individual research/analytical papers the second half of semester.",
                                                    "relevance":  "This course will help students to understand the origins of both cuisines and their importance for cultural identities as well as problems with current food system related to sustainability and justice and also consider ways to improve systems.",
                                                    "learning_resources":  "Materials will be made available via Canvas.",
                                                    "extra_time_commitment":  "No extra time requirements."
                                            }
}