{
        "code":  "79-307",
        "name":  "Religion and Politics in the Middle East",
        "short_name":  "RELGN POLTC MDL EAST",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course looks at the historic relationship among Islam, Judaism and Christianity and what they have to say about the nature of government, the states treatment of religious minorities, and relations among states in the Middle East. We will consider the impact of religion on domestic and foreign policy in selected Middle Eastern countries and communities, the role of religion in fueling conflicts, the phenomenon of religious fundamentalism, the challenge and opportunity this presents to the United States, and the potential for religion to help advance Middle East peace. Over the course of the semester student teams will research and produce updates as to where religion and politics seem to be intersecting in the states we have been studying.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will become familiar with the history and basic precepts of Islam and Judaism and able to identify the different ways they are manifest in the domestic and foreign policies of selected states and communities in the Middle East. Students will understand the difference between orthodox observance and religious fundamentalism and consider how religion can both perpetuate hostility and contribute to conflict resolution. Students should be able to interpret breaking news events in the contemporary Middle East in light of the political and religious forces historically endemic to the region.",
                                                    "key_topics":  "This course looks at the historic relationship among Islam, Judaism and, to a much lesser extent, Christianity, and what they have to say about the nature of government, the state\u0027s treatment of religious minorities, and relations among states. We will consider the impact of religion on domestic and foreign policy in selected Middle Eastern countries, the role of religion in fueling conflicts, the phenomenon of religious fundamentalism, and the opportunity for religion to contribute to Middle East peace. We will take advantage of the unprecedented upheavals currently roiling the Arab world and use contemporary media and contact with people on the ground in the regions we are studying to produce \"updates\" as to where religion and politics seem to be intersecting at this time.",
                                                    "prerequisite_knowledge":  "No prerequisite knowledge required.",
                                                    "assessment_structure":  "The final grade will be based upon several short homework exercises, 3 film reviews, classroom attendance and participation, one group presentation and a final exam.",
                                                    "relevance":  "This course provides an important and clarifying historical backdrop to very serious current events of great relevance to the students, perhaps personally and definitely as informed global citizens and consumers of news from a variety of sources.",
                                                    "learning_resources":  "Small monographs on Islam and Judaism; articles from a wide variety of sources posted on the course Canvas page; maps; one educational film, two feature films; articles from English language Middle Eastern websites and news platforms; students will be provided contact information for correspondents on the ground in the countries we are studying; primary sources from many Middle Eastern communities translated into English.",
                                                    "extra_time_commitment":  "One group project will require meeting and coordinating as a group outside of class"
                                            }
}