{
        "code":  "79-383",
        "name":  "The History of Capitalism",
        "short_name":  "HISTORY OF CAPITALSM",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "What is capitalism  How does it differ from systems that preceded it, and how did it come to revolutionize the globe  This course will cover the global development of capitalism from the 16th century to the present.  We will examine the theories of Karl Marx and Adam Smith, who both attempted to theorize the new system of labor organization.  We will look at how the transition from feudalism to capitalism took place, including the role of new world slavery, commodity production, dispossession of the peasantry, and changes in the household and gender relations.  We will examine globalization, the latest dynamic phase of capitalism and its impact on people.  Finally, we will discuss the advent of robotization, the loss of industrial jobs, and the potential impact of casual labor, low wages, and unemployment on democracy and the rise of a technocratic elite.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will obtain a basic historical understanding of how the system of capitalism developed, its impact on the world, and where we might be expected to go in the future based on a solid historical grounding.",
                                                    "key_topics":  "The transition from feudalism to capitalism, the theoretical understanding of Adam Smith and Karl Marx, the development of commodity production, legal scaffolding of capitalism, dispossession, the role of slavery in he development of early capitalism, industrialization, de-industrialization, environmental degradation, and the social impact of globalization and robotization",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Grades will be based on two 7-10 page papers, drawing on assigned readings, lectures, and other visual materials, as well as class participation.",
                                                    "relevance":  "This course will address critical questions that student have today about the rapid transformation of our world and the role of capitalism in that transformation.",
                                                    "learning_resources":  "Scholarly monographs, theoretical literature, articles, videos, films, music",
                                                    "extra_time_commitment":  "Possible evening film"
                                            }
}