{
        "code":  "79-310",
        "name":  "U. S. Business History: 1870 to the Present",
        "short_name":  "US BUSINESS HISTORY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course explores the development of American business within its economic, political, and social context from the late nineteenth century to the present. Through the lens of history of capitalism, readings and discussions will explore the interconnections of State and Market in the twentieth century United States that shaped how, why, and where business transactions occurred. Particular attention will be paid to the institutional, social, technological, environmental, labor, and cultural context in which American commerce developed, from the rise of the modern corporation in the late nineteenth century to the emergence of a true information economy in the twentyfirst. Students will encounter primary sources, scholarly secondary readings, business case studies, and cultural artifacts as they explore how business functioned and changed over time in an American context.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "This course is intended to promote the following1 Students general knowledge of and historical appreciation for the history of American capitalism since the Civil War, including providing a basis for placing the role of business within the greater social, political, cultural and economic context of American history and tracing the deep roots of contemporary societal issues and policy debates surrounding business and markets.2 Historical literacy in the form of increased student ability to identify, differentiate among, and analyze various types of historical documents including primary sources, secondary academic works, and memoirs. Students ability to discern and respond to key pints in scholarly arguments should be enhanced, as should their ability to construct historical arguments by piecing together relevant evidence.3 Critical writing skills, particularly the crucial set of skills associated with making evidencebased, analytical arguments derived from historical evidence. Students will practice how to contribute to scholarly debate by learning how to integrate analysis, primary evidence, and supporting secondary works in a cohesive, essayform argument. 4 Oral communication skills, in this case enhanced both through regular classroomstyle discussion and conversation with the instructor during office hours. Students will additionally practice their ability to employ communication skills in a collaborative, creative setting through participation in impromptu, inclass breakout sessions.",
                                                    "key_topics":  "This course explores the development of American business within its economic, political, and social context from the late nineteenth century to the present. Using a history of capitalism framework, readings and discussions will explore the interconnections of state and market in the twentieth century United States that shaped how, why, and where business transactions occurred. Particular attention will be paid to the institutional, social, technological, environmental, labor, and cultural context in which American commerce developed, from the rise of the modern corporation in the late nineteenth century to the emergence of a true information economy in the twenty-first. Students will encounter primary sources, scholarly secondary readings, business case studies, and cultural artifacts as they explore how business functioned and changed over time in an American context.",
                                                    "prerequisite_knowledge":  "No prerequisite knowledge is required.",
                                                    "assessment_structure":  "Students will be assessed through short weekly responses to readings, in-class participation, an open book/source midterm and final examination, a group project, and other focused writing assignments.",
                                                    "relevance":  "This course is relevant to students interested in why American business functions the way it does in modern society. Contextualized deep history of how American capitalism has developed provides insights to students of history and business.",
                                                    "learning_resources":  "Student resources will be coordinated through the course Canvas site, where readings, assignments, and instructor communications will be posted. All assigned short readings (including articles, book chapters, and case studies) will be made available through the website. Any assigned textbooks will be widely-accessible in print or electronic format and will be made available through library reserves.",
                                                    "extra_time_commitment":  "Students will have a decent amount of reading most weeks, and an end-of-term group project that will require some out-of-class team meetings. Any additional activities associated with the class outside of regularly scheduled course meeting times (including film screenings or field trips) would be voluntary enrichment experiences with no effect on assessment."
                                            }
}