{
        "code":  "79-330",
        "name":  "Medicine and Society: Health, Healers, and Hospitals",
        "short_name":  "MEDICINE \u0026 SOCIETY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "How have notions of health and healing changed over time in the United States Why are doctors seen as professional heroes Why are hospitals so central to patient care and professional training How has American healthcare developed into its present form This course explores the history of American medicine and its relationship to American society. By exploring major developments in the history of American medicine and public health, students will examine the voices of historical actors, including physicians, patients, activists, policymakers, and researchers. In analyzing these voices, students will learn what was at stake as Americans confronted diseases and struggled to explain and cure them. Students will also examine medical research, education, disease patterns, patient experiences, and technologies from the colonial period to the present day. Readings include a range of primary accounts and secondary sources of medicine and health in America.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1.Introduce students to the mutually constitutive historical relationship between medicine and society.2.Introduce students to major developments in the history of American medicine, situated in social and political context3.Introduce students to the historical method, primary and secondary source analysis, and historical thinking",
                                                    "key_topics":  "This course will survey the history and development of American medicine and public health from the early colonial period to the present day.\n-\tHistory of Medicine\n-\tUS History\n-\tHistory of the health professions\n-\tHistory of health institutions\n-\tHistories of health and disease",
                                                    "prerequisite_knowledge":  "A general understanding/familiarity with US history is recommended, but not required.",
                                                    "assessment_structure":  "1.\tStudents will be expected to participate fully in class discussions\n2.\tStudents will complete weekly writing response assignments\n3.\tStudents will have two short writing assignments\n4.\tStudents will complete a final long paper.",
                                                    "relevance":  "Students will become familiar with major topics, themes, actors, and historical moments in the development of American Medicine. This course will be of particular interest for pre-health students and those interested in the medical humanities.",
                                                    "learning_resources":  "-\tCourse Canvas Webpage\n\nStudents will be required to read\n-\tSinclair Lewis, Arrowsmith (1925).",
                                                    "extra_time_commitment":  null
                                            }
}