{
        "code":  "79-331",
        "name":  "Body Politics: Women and Health in America",
        "short_name":  "BDY PLTC: WM HLT AM",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "[Note Students who have taken 66121, First Year Seminar Body Politics Women and Health in America, may not enroll.  This course takes a topical, intersectional approach to the history of U.S. womens health in the nineteenth and twentieth centuries.   It is less about governmental politics, although we do some of that.  Rather, it sees bodies as cultural texts through which power is built and contested.   The course covers topics such as the history of anatomy, menstruation, reproductive rights, body image, mental health, sexuality, violence, childbirth, and menopause. We explore how science and American culture both have constructed these issues over time some of it is super whacky, while also examining womens organizing around them.  This course is open to all students and majors alike, and it also satisfies one of the core requirements for the Gender Studies minor.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students should learn how to discuss and analyze issues around womens bodies and health, using an intersectional gender analysis. Students should also learn some basic reproductive biology.",
                                                    "key_topics":  "Key topics to be covered include:\n\n1. How to understand bodies as sites of power and political contest.\n\n2. Basic reproductive biology (not overly science-y).\n\n3. The historical understanding and current issues around many women\u0027s health topics, such as reproductive biology, menstruation, sexuality, mental health, body image, violence, pregnancy, breast cancer, reproductive rights, and menopause.\n\n4. How to understand all these issues through an intersectional lens.\n\n5. How to read and understand your own body.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "Assessments will include:\n\n1. Class discussion and participation, around assigned readings.\n\n2. Several short assignments, due in class.\n\n3. Three 1-2 page reflections.\n\n4. Two projects.",
                                                    "relevance":  "Students should learn how to discuss and analyze issues around women\u0027s bodies and health, using gender analysis. Students should also learn some basic reproductive biology.",
                                                    "learning_resources":  "Learning resources will include:\n\n1. Readings on Canvas;\n\n2. Documentary films;\n\n3. Speaker from the Community; and\n\n4. News/Media.",
                                                    "extra_time_commitment":  null
                                            }
}