{
        "code":  "79-370",
        "name":  "Technology in the United States",
        "short_name":  "TECHNOLOGY IN THE US",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course examines the ways in which technology and society have shaped each other in the United States from the colonial era to the present.  Topics include Native Americans and technologies, farming, industrialization, transportation, automobiles, aerospace, information technology, drugs, and biotechnology.  Students will read a textbook, write brief essays about technologies of their choice, and discuss their essays and the text in class.  The course welcomes students from any major.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The goals of this course are to a deepen our understanding of the interaction between people and technology over time, b advance critical thinking skills, and c develop research and writing skills.",
                                                    "key_topics":  "The interaction between people and technology in the U.S.",
                                                    "prerequisite_knowledge":  "NO PRE-REQ COURSES",
                                                    "assessment_structure":  "Course grades will be based on participation in discussion, short weekly papers, and short informal class presentations.",
                                                    "relevance":  "Shapes our daily lives, and this course will help students understand why and how it does so.",
                                                    "learning_resources":  "Students will read Ruth Schwartz Cowan and Matthew H. Hirsch, A Social History of American Technology.\n\nStudents will find examples of past technologies to discuss in class. They can complete these assignments using sources on line, such as old newspapers and magazines.",
                                                    "extra_time_commitment":  null
                                            }
}