{
        "code":  "79-350",
        "name":  "Early Christianity",
        "short_name":  "EARLY CHRISTIANITY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course examines the origins of Christianity in historical perspective. Using both Christian and nonChristian sources from the period, we will examine how and why Christianity assumed the form that it did by analyzing its background in the Jewish community of Palestine, its place in the classical world, and its relationship to other religious and philosophical traditions of the time. We will also examine historically how the earliest Christians understood the life and message of Jesus, the debates about belief and practice that arose among them, and the factors influencing the extraordinary spread of the movement in its earliest centuries. This course satisfies one of the elective requirements for the Religious Studies minor.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will understand the historical, cultural, political, and sociological factors that shaped the formation of the beliefs, institutions, and practices of the early Christian church and the influence of that history upon current debates theyll learn how to critically analyze historical texts and effectively communicate scholarly arguments in writing and discussion.",
                                                    "key_topics":  "The historical development of Christianity between the 1st-5th centuries A.D. The historical evolution of how the earliest Christians described Jesus, the debates about belief and practice that arose among them, and the factors influencing the spread of the Christian movement.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "Participation in class discussion of assigned readings, midterm and final exams, and short written assignments.",
                                                    "relevance":  "Students will understand the origin and spread of one of the major world religions today.",
                                                    "learning_resources":  "Readings from primary and secondary historical sources; visual sources",
                                                    "extra_time_commitment":  null
                                            }
}