{
        "code":  "79-342",
        "name":  "Age of Crusading, 1000-1800",
        "short_name":  "AGE OF CRUSADING",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "What does it mean to become a crusaderor be crusaded  How did a popes sermon galvanize over 100,000 people to leave their homes and undertake a perilous journey across Europe to a place many had never seen  Why did one military campaign in 1096 initiate a seismic shift in the articulation and acceptance of Christian holy war  What started as a series of expeditions to Jerusalemwhich we now call the crusadeslater extended to the cities of Constantinople and Cairo, to the regions of Southern France and Italy, and even to the Baltic Sea and the Americas.  In this course, we will trace crusading ideology and knighthood from their roots to their fullest expressions throughout the Middle Ages and into modernity.  These individuals who took up the crossor encouraged others to do likewiseradically shaped the ideas of identity and piety in Latin Christendom.  Perceiving themselves as Gods agents in an apocalyptic age, crusaders came to fight Muslims, Jews, pagans, heretics, and even their fellow Christians.  They also served as heroic inspiration in bardic song and courtly literature across Spain, France, and England.  As scholars we will explore the perspectives of the invaders and those who were invaded, thereby reimagining how people responded to the crusaders presence and their accompanying violence.  Our sources will include prophecies, sermons, scripture, poetry, art and archeological remains, and film.  Together, we will approach this challenging topic critically, yet respectfully, while completing short analytical papers and a set of reflective quizzes.  This course is open to all students, requires no prerequisites, and may be used to fulfill the Religious Studies minor.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "This course will introduce students to the idea of crusading both past and present. More specifically, you will gain a broad understanding of the impact that such campaigns had on the Franks themselves and the indigenous peoples of Europe, the Middle East, North Africa, and the Americas. While using the crusades as our main lens, you will learn how to engage primary and secondary readings thoughtfully, which requires us to grapple with the theoretical and practical underpinnings of historical inquiry. Specifically, you will gain valuable research skills by learning how to contextualize primary sources, how to draw valid comparisons between different cultural and societal viewpoints, and how to cite relevant texts as evidentiary support. Moreover, students will hone their analytical writing skills through a series of short essays and by engaging one another in weekly conversations and group activities.",
                                                    "key_topics":  "Key topics include the origins of martyrdom, sacralized violence, and holy warfare; prophecy and apocalypticism in medieval Europe; pilgrimage and crusading; Latin Jerusalem and the Crusader States; Jewish and Muslim perspectives of the crusades; knighthood and the military orders; religious polemics; chivalry, courtly love, and tournament culture; the Conquistadors and La Conquistadora; and finally, the appropriation of crusader imagery and ideology in modern colonialism and militia groups.",
                                                    "prerequisite_knowledge":  "No prerequisite knowledge is required.",
                                                    "assessment_structure":  "Course assessment will include attendance and active participation in classroom discussions, short thematic essays, and a set of reflective quizzes spread across the span of the semester.",
                                                    "relevance":  "In a modern era where we see glimpses of crusader tattoos on a militiaman\u0027s arm, or hear the term \"crusade\" invoked by U.S. presidents and pundits alike, it is difficult to argue that the crusades fully belong to the past. This course reveals that how we think about religious conflict today has its source in medieval conceptions of crusading and just war. While this class covers the earliest crusades and Frankish warriorhood prior to the twelfth century, we will also examine how crusading influenced other forms of widespread violence, including pogroms against Jewish communities in Europe; persecution of heretics in France and beyond; and the legacy of the Conquistadors in Central and Southern America. This course comes first circle--beginning with a prophecy that casts crusaders as divine agents at the end of history, to the adoption of crusader symbols by political factions that may define our future.",
                                                    "learning_resources":  "All available readings and visual images will be made available as scans on Canvas by the instructor. In addition, the instructor may post/upload short history videos, radio stories, and select podcasts from open education platforms, including the BBC, PBS, NPR, and YouTube, onto Canvas. While students are not required to purchase a physical copy of our textbook, Susanna Throop and Jonathan Riley-Smith\u0027s \"The Crusades: A History,\" 4th ed. (Bloomsbury, 2022), they are encouraged to obtain a copy for future reference.",
                                                    "extra_time_commitment":  "There will be no external commitments outside of regularly scheduled meeting times, though the instructor may\narrange for voluntary enrichment activities (film screenings, field trips, visits to library\u0027s Rare Book Room, etc.) related to course themes that may students may choose to attend or not with no effect on grade or class standing."
                                            }
}