{
        "code":  "79-349",
        "name":  "The Holocaust in History and Culture",
        "short_name":  "HOLOCAUST HIS CULTR",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The Holocaust in History and Culture will examine the Holocaust in its historical and cultural context.  Historical analysis of the Holocaust will examine how and why it came about, placing it within the frameworks of modern German history, European AntiSemitism, and the Second World War. The course will cover the history of the National Socialist party and ideology of Adolf Hitler. We will trace the rapid radicalization and intensifying violence of Nazi policies against Jews during the first two years of the war.  We will discuss how historians explanations of the Holocaust have been shaped by the mountain of new evidence that has been discovered since 1945. Cultural analysis will examine the everevolving place of the Holocaust within German, Jewish, and Eastern European postwar cultures, and it will consider the ways that writers, filmmakers, and other cultural producers have understood the challenges posed by the Holocaust in the context of their own time and cultural milieu. This course meets the Dietrich Gen Ed Perspectives on Justice and Injustice requirement.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Our primary course goals will include 1. Identify the historical specificity of the Holocaust who, what, where, when, why, and how in order to understand how and why it came about where and when it did. 2. Identify key texts films, stories, novels, works of art and music that have dealt with the Holocaust and interpret them in their cultural context. 3. Analyze ways in which thinking about the Holocaust has changed over time, both historically and culturally. 4. Explore the ways in which both historians and artists have evolved in their thinking about the Holocaust over time.5. Situate students own thinking about the Holocaust and other genocides within this context.",
                                                    "key_topics":  "Key topics will include the history of the Holocaust (as demonstrated by the book, \"Holocaust by Bullets\"): pre-history of the Holocaust; the Nazi regime and World War Two, industrialized Holocaust in concentration camps; cultural ramifications of the Holocaust; literature of the Holocaust; music of the Holocaust; art of the Holocaust; and film of the Holocaust.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "The course will require students to contribute to weekly discussions online via Canvas, to write brief reactions to each of the films they see, to engage actively in class discussion, and to write three brief papers as well as a final take-home test. The course will also help students to learn skills for interpreting historical and cultural texts, whether written or not.",
                                                    "relevance":  "Dietrich Gen Ed: Special Seminars - Perspectives on Justice and Injustice\n\nThe Holocaust continues to be part of the historical and cultural context of our day, and knowledge of it, both historically and culturally, is a necessary and essential part of informed citizenship. This course will place the Holocaust in the European context of Nazi Germany\u0027s wartime allies, on the one hand, and its occupied territories, on the other. What role did, for example, Fascist Italy play in the Holocaust? To what extent did local people in, for example, occupied France or dismembered Poland collaborate with or, instead, resist Nazi extermination policies? How was postwar literature about the Holocaust shaped by memories of collaboration and resistance?\n\nMoreover, we will consider what was unique about the Holocaust as a genocide as well as discuss whether and how it shares features of other genocides of the twentieth century. Was the Holocaust a civilizational break that places it beyond comparison, or can it be compared to other crimes against humanity? Such debates are also central to the question as to how the Holocaust has altered notions of Western culture and civilization.",
                                                    "learning_resources":  "The collections at Hunt Library; the film library; Canvas (where many of the readings will be located); the Kanopy film database; the two instructors; students will probably have to purchase one book, which will, however, also be available at the library.",
                                                    "extra_time_commitment":  "None, with one visit to the Carnegie Museum during regularly scheduled class-time."
                                            }
}