{
        "code":  "79-335",
        "name":  "Banned Substances: Drugs and Alcohol in American History",
        "short_name":  "BANNED SUBSTANCES",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course traces the development of laws, policies, and social movements related to alcohol and drugs in the United States. By highlighting the ideas proponents and opponents used to justify or oppose prohibition, students will examine how responses to drug and alcohol use has as much to do with ideologies of gender, race, ethnicity, and class as they do with the effects of the substances themselves. This course will also analyze how attempts at prohibition have been historically contingent and explore the ways debates surrounding drug and alcohol use can deepen our understanding of American history. Some topics to be considered include the proliferation of alcohol abuse in the early Republic, temperance and prohibition movements, criminalization of drugs, the war on drugs, and legalization debates.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will understand that debates over prohibition are historically contingent and that responses to drug and alcohol use has as much to do with social ideologies gender, race, ethnicity, class, etc. as they do with the effects of the substances themselves.",
                                                    "key_topics":  "This course will examine the development of laws, policies, and social movements related to alcohol and drug regulations in the United States from the early Republic through 21st century.",
                                                    "prerequisite_knowledge":  "no prior knowledge required",
                                                    "assessment_structure":  "Short reading responses and several short essays.",
                                                    "relevance":  "Students will be able to place the debates surrounding prohibition within the larger context on American history.",
                                                    "learning_resources":  "Students will be assigned readings from several monographs and articles, as well as films/documentaries, and photos.",
                                                    "extra_time_commitment":  null
                                            }
}