{
        "code":  "79-454",
        "name":  "The TransOceanic Railway",
        "short_name":  "TRANSOCEANIC RAILWAY",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is an introduction to railway restructuring and privatization, which arguably began in exactly 1990 with the privatization of Argentinas railways.  The Argentine model has been replicated on other continents and in many settings and is modeled on the successful USA model of private ownership and operation of freight rail, which is generally considered a model for the world. Conversely, passenger rail in the USA almost disappeared while in the UK it has enjoyed a spectacular run with a doubling of ridership since the privatization of its railways in roughly the same era, i.e., the Thatcher years.  The UKs model has been replicated in various forms throughout Europe and beyond.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Starting with the development of the first USA and UK railways, students will gain a basic understanding of the industrys history and economics, with special attention to the last several decades at a global level. In addition, students will participate in small group research projects in particular areas of special interestfor example, economic history, industry culture, network economics, utility regulation andor transportation policy as applied in regions of the world in which they either live or have a particular interest. Upon completion of the course, students will have sufficient knowledge of the industry to have identified areas of personal interest which they can pursue in a professional capacity, in roles ranging from private sector investment to public sector advocacy. They will thus have made progress toward being Part of the Solution in ensuring a more successful industry regardless of their position.",
                                                    "key_topics":  "Economics, Policy, Infrastructure, Environment, Culture, Networks, Regulation",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Letter Grade",
                                                    "relevance":  "Students will acquire a deeper understanding of the Key Subject Topics through the lens of railways: Economics, Policy, Infrastructure, Environment, Culture, Networks, Regulation",
                                                    "learning_resources":  "Mostly web-based research plus several books such as The Men Who Loved Trains, Railroaders Without Borders and Old Man Thunder",
                                                    "extra_time_commitment":  null
                                            }
}