{
        "code":  "79-419",
        "name":  "20th Century Russian Masterpieces",
        "short_name":  "20TH CENT RUSSN MSTR",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "At the beginning of the 20th century, the Russian Empire underwent a series of dramatic changes in quick succession industrial modernization, the unsuccessful 1905 rebellion, terrible losses in the First World War, finally culminating in the 1917 October Revolution. The literature and culture of the era were deeply impacted by these upheavals as artists and writers of the era attempted to capture and convey the world rapidly shifting around them. This course will acquaint students with canonical texts from 20thcentury Russian literature and will also examine the highly specific context in which they were produced. From the findesicle aesthetics of a crumbling Russian Empire to the avantgarde experimentalism of the Russian Revolution and Civil War era, to the establishment of Socialist Realism and the implementation of a Totalitarian regime under Stalin, the course invites students to think about both the realities of life and artistic production in a rapidly transforming country as well as the ways in which these works bring contemporary readers to the inner lives of Soviet citizens.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of this course, students will be able to Frame and reframe fundamental questions of the relationship between art and society, the individual and the state, artist, reader, and censor, and other fundamental questions related to everyday life in the early Soviet era. Interpret key texts of 20th century Russian literature, documentary material, such as official speeches, journal entries, and video footage. Analyze issues, objects, and events from our own postSoviet perspective as well as tracing the political, economic, and aesthetic changes from the Revolution to the time of the Great Terror 19171937. Consider the development of literature from the Tsarist era to Stalin and situate their own attitude towards the relationship between art, society, and progress in relation to the early Soviet period. In addition, students will learn to perform close readings of literary texts and formulate original, critical, and analytical responses to Russian literary works, both written and oral.",
                                                    "key_topics":  "20th Russian literature and culture, Russian Revolution, avant-garde aesthetics, Stalinism, Platonov, Blok, Mayakovsky, Olesha, Bulgakov, and Tsvetaeva, Akhmatova.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "In-class activities; group activities; weekly responses; written compositions (two short essays); final exam",
                                                    "relevance":  "Dietrich GenEd Prior to Fall 2021: Reflecting Dietrich GenEd After Fall 2021: Contextual Thinking Relevant to the study of Russian \u0026 Soviet literature, culture, and history, the history of the Revolution, avant-garde aesthetics, and study of world literature.",
                                                    "learning_resources":  "With the exception of one novel, all course readings are posted on Canvas.",
                                                    "extra_time_commitment":  null
                                            }
}