{
        "code":  "79-458",
        "name":  "Of Minorities and Migrants: Exploring Germany from the Margins",
        "short_name":  "MIN \u0026 MIGRTS: GERMAN",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Of Minorities and Migrants Exploring Germany from the Margins Germany today is home to a multicultural and ethnically diverse population, largely the result of accelerated migratory flows in the wake of the countrys postwar era. In this course, we will explore the impact and cultural dimensions of migrations through the lens of Germanys minorities. By mapping the course of German postwar history, immigration and migration, we will establish the context for our probe into the lived experience of Germanys Turkish, Jewish, Black, East German, and refugee minorities. Examining, comparing, and historically situating these experiences and surrounding debates will allow us to address topical issues related to diversity, multiculturalism, racism, and citizenship that shape contemporary Germany. Appreciating the diversity of minority experiences will help students think more critically about the constructedness of identities. This discussionbased course is taught in English and open to all students.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1. Examine how cultural contexts, including recognition of our identities and possible biases, impact our worldviews. 2. Evaluate how worldviews influence the interpretation of historical and contemporary events, and the perception of cultures and communities. 3. Analyze the role of cultural norms and institutions in creating and perpetuating structural inequalities and discriminatory attitudes.",
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "The course assignments will invite collaboration and learning from all students in the class, and methods will be accessible to different learning abilities and preferences. Examples of these assignments include: daily preparedness and participation in class activities; participation and discussion both in-class and in an on-line discussion forum; nightly/weekly reading and HW with questions; independent and collaborative research and writing assignments; pair/group work; oral presentations/final project presentations; a creative and/or research-oriented final project.",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Reflecting Dietrich GenEd after Fall 2021: Foundations - Intercultural and Global Inquiry",
                                                    "learning_resources":  "Materials will be provided by the instructor. Books may be required as well.",
                                                    "extra_time_commitment":  null
                                            }
}