{
        "code":  "79-415",
        "name":  "Arab Culture Through Dialogues, Film, and Literature",
        "short_name":  "ARB CLTR DLG FLM LIT",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "F23 Minorities in the Middle East and North Africa In todays society that explores Diversity, Equity, and Inclusion DEI, one ought to ponder if Arab societies have made progress to achieve DEI among groups of other religions Muslims, Christians, Jews, sects Sunni and Shia, ethnicities Copts, Nubians, Kurds, Palestinians, LGBTQ, and women. Some of the questions that this course addresses are whether a minority in Arab societies is defined by number or status the role of education, social norms, and media in approaching issues of skin colors and minorities rights the autocratic governments use of identity politics to serve their own interests and the historical changes that have shaped citizenship and belonging. This course aims to enrich students understanding of the diversity of Arab countries and the impact of colonialism, PanArabism, socioeconomy, and cultural norms on minorities status through readings, filmsdocumentaries, music, and data collected via surveys and virtual sessions with students in Arab countries.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "To appreciate the diverse identities. To increase crosscultural understanding and equip students with the skills needed to thrive in todays interconnected world and become global citizens. To build not only cultural literacy but also relationships through virtual meetings with Arab students in Saudi Arabia, Egypt, and Morocco, and strengthen engagement between American and Arab students. To engage in meaningful dialogues that stem from knowledge of the current issues that each society faces.",
                                                    "key_topics":  "Diversity of the Arab World - Social Norms and family values - homo/sexuality - womanhood, manhood, change - the Arab citizen, national identity, and dissent - Palestinian narrative - citizens in conflict zones.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Attendance and participation, contribution to Google Slides, write journals, participate in virtual sessions with Arab students, write post-sessions reports, and final project and presentation.",
                                                    "relevance":  "This course introduces students to the hybrid elements that constitute the diversity of Arab culture and the Arabs\u0027 ways of thinking in the Middle East and North Africa to challenge stereotypes and foster a better understanding of the social reality of Arab societies.",
                                                    "learning_resources":  "2 novels, short articles, films, and short videos.",
                                                    "extra_time_commitment":  null
                                            }
}