{
        "code":  "80-101",
        "name":  "Dangerous Ideas in Science and Society",
        "short_name":  "DANGEROUS IDEAS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Do cancel culture and wokeness stifle free speech on campus When should campus speakers be protested or disinvited Should race be considered in college admissions Should we use genetic engineering to create superintelligent babies Under what circumstances, if any, is abortion permissible When, if ever, can a doctor kill a newborn baby or a dying patient If we can in the future, should we end human aging, allowing people to live for thousands of years Does civilian gun ownership make people safer, and if not, should it be allowed anyway Is the case for defunding the police compelling Should the United States open its borders to more immigrants Has neuroscience shown that free will is an illusion Could a digital computer become sentient What is the probability that we are living in a computer simulation Is it rational to believe in God in a world that contains so much suffering  These are some of the toughest, most pressing questions of current social, moral, and philosophical inquiry. Philosophers address them by producing intricate and often beautiful arguments. In this course, you will assess those arguments and produce your own. You will learn how to have challenging, productive, and respectful discussions across political and moral differences. You will learn to think like a philosopher  to strip an argument presented in prose to its essentials and plainly expose its structure. This course will improve the clarity and rigor of your own thinking and writing. It will put you in a position to make progress on hard questions like those mentioned above. And it will improve your ability to crisply convey your ideas  an ability that will serve you well not just in class, but also in daily life.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1 Learn about why people hold different political and moral views to your own, how to talk productively with people whose beliefs you reject, how to consider others arguments in an unbiased way, and how to think things through for yourself. 2 Recognize the diversity of values that inform others moral, political, and philosophical beliefs. 3 Parse the logical structures of argumentative texts identify conclusions, premises and how they compose to form reasons and objections identify and evaluate inferences. 4 Construct compelling arguments that defend interesting conclusions, not obviously answered in lectures or assigned readings, using clear and effective logical structures. 5 Predict potential objections to your arguments and learn how to acknowledge and address them. 6 Learn when a priori methods are appropriate and when empirical research is necessary. 7 Apply analytic skills to explore any question where reasons and objections are provided. Learn to see how different approaches to a problem are arrayed in logical space.",
                                                    "key_topics":  "Topics:\n\nFree speech (hate speech, cancel culture, campus speech codes, censorship)\n\nHuman morality (group psychology, conformity, moral panics)\n\nBioethics (disability, physician-assisted suicide, genetic abortion and infanticide, genetic engineering, human immortality)\n\nPersonal identity (what is a person, changing genders, changing races)\n\nFree will (meritocracy, responsibility, neuroscience, brain-computer interfacing)\n\nAnimal ethics (scientific experimentation on non-human animals, factory farming)\n\nMetaphysics (are we Sims living in a computer simulation, existence of God)\n\nHappiness and the meaning of life",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Students will choose between two assessment structures, one essay-based, the other problem-set based.",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Reflecting\nDietrich GenEd after Fall 2021: Disciplinary Perspectives - Humanities\n\nYou will learn to think like a philosopher- to strip an argument presented in prose to its bare essentials and plainly expose its structure. Learning to visualize arguments will improve the clarity and rigor of your own thinking and writing. It will put you in a position to make progress on hard questions like those mentioned above. And it will improve your ability to crisply convey your ideas\u0027 an ability that will serve you well not just in class, but also in daily life.\n\nThat a single class can make you meaningfully smarter may seem wild. But it\u0027s true. For evidence, see the following article in Nature, Science of Learning, which demonstrates large gains on LSAT logical reasoning forms in a multi-year study of Princeton University undergraduates who learned argument visualization: https://www.nature.com/articles/s41539-018-0038-5",
                                                    "learning_resources":  "Guided readings from contemporary ethics and philosophy provided on Canvas; Free argument visualization software; PhilosophyMapped website for handy-dandy hints, online exercises, and puzzles for practicing guided by instant feedback.",
                                                    "extra_time_commitment":  "Students can earn extra credit by participating in the Research Participation Program at the Center for Behavioral Decision Research."
                                            }
}