{
        "code":  "80-180",
        "name":  "Introduction to Linguistics",
        "short_name":  "INTRO LINGUISTICS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Language is used to talk about the world or to describe it, but how do we go about describing language itself Linguistics is the name given to the science of language, whose task it is to give such a description. The discipline of linguistics has developed novel tools for describing and analyzing language over the last two hundred years and in this course we learn what these tools are and practice applying them. Subareas of linguistics which we study include phonetics the study of speech sounds, phonology the study of sound systems, morphology the study of parts of words, and syntax the study of combinations of words. Furthermore, we highlight various respects in which language and linguistics intersects with societal issues.  The methods of linguistics are useful in the study of particular languages and in the study of language generally, so this course is useful for students of foreign languages as well as those interested in going on to study language acquisition, psycholinguistics, sociolinguistics, philosophy of language, and computer modeling of language.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will be able to carry out basic linguistic analysis in the areas covered by the course students will understand the fundamental view of language in contemporary linguistics as a rule governed system students will engage with language descriptively, not prescriptively.",
                                                    "key_topics":  "General introductory survey course covering the main subfields of linguistics: phonetics, phonology, morphology, syntax, semantics.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "2 midterms + final; approx. 6 assignments (problem sets); in-class work and a variety of smaller exercises submitted for completion credit",
                                                    "relevance":  "Dietrich GenEd prior to 2021: Communicating\nDietrich GenEd after Fall 2021: Disciplinary Perspectives - Humanities\n\nThe primary objective for this course is for you to be able to approach the study of language scientifically, while considering some of the broad social implications of how language is used.",
                                                    "learning_resources":  "Various: Readings posted on Canvas, slides, handouts, some online resources",
                                                    "extra_time_commitment":  null
                                            }
}