{
        "code":  "80-150",
        "name":  "Nature of Reason",
        "short_name":  "NATURE OF REASON",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course provides an accessible introduction to the historical development of philosophical ideas about the nature of reasoning and rationality with a focus on mathematics and the sciences, from ancient to modern times. The first part of the course traces the search for deductive methods for obtaining certain knowledge, starting with Aristotle and Euclid all the way to the work of Boole and Frege in the 19th century. The second part of the course considers the history of skepticism about empirical knowledge, covering Plato, Descartes, Pascal, and Hume, along with replies to skepticism in the works of Bayes and Kant. The third part of the course discusses theories of the nature of the mind and mental processes, culminating in the computational conception of the mind that underlies contemporary cognitive science.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will learn about central and enduring philosophical debates about the nature of reasoning and rationality. They will learn how to read, analyze, and evaluate philosophical arguments, and they will get acquainted with the basic concepts, problems, and results of deductive logic, inductive logic, the theory of computation, and the theory of mind.",
                                                    "key_topics":  "This course provides an introduction to the historical development of philosophical ideas regarding the nature of reasoning and rationality (with a focus on mathematics and the sciences), from ancient to modern times.",
                                                    "prerequisite_knowledge":  "No prior knowledge necessary",
                                                    "assessment_structure":  "Homework assignments, midterm exam, final exam, recitation attendance and participation.",
                                                    "relevance":  "DC Gen Ed after 2021: Logic/Mathematical Reasoning\n\nThis course offers an accessible introduction to some central debates in philosophy that highlight how philosophical inquiry has helped create and shape disciplines such as computer science, AI, cognitive science, mathematical logic, and Bayesian statistics.",
                                                    "learning_resources":  "Textbook and additional reading materials provided by the instructor.",
                                                    "extra_time_commitment":  null
                                            }
}