{
        "code":  "80-281",
        "name":  "Language and Thought",
        "short_name":  "LANGUAGE AND THOUGHT",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The goal of this course is to provide students with the opportunity to creatively explore some difficult questions about the relationship between language and thought, questions such as How does the human capacity to use language relate to the human capacity to think Does the language that a person speaks affect the way she thinks If meaning is in the head, how can we succeed in communicating with each other How is our ability to reason related to our ability to successfully communicate None of these questions have definite answers throughout the course, we will draw on work in philosophy, psychology and linguistics to try to understand some of the possible answers that might be entertained. Students in the course should be prepared for extensive reading, writing and peer discussion assignments.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will engage with complex topics at the intersection of linguistics, philosophy and cognition, where there are not necessarily clear cut or correct answers to research questions. Students will engage with primary research literature, and will gain skills in developing their own views on the basis of this literature.",
                                                    "key_topics":  "Relations between language and concepts; language as a social and a cognitive phenomenon; the role of language in reasoning; the role of inference in linguistic interpretation; how linguistic structures have meaning",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  "DC General Education: Communicating",
                                                    "learning_resources":  "Primary research literature; classroom slides and handouts",
                                                    "extra_time_commitment":  "During the final unit of the course, students will work in groups to prepare in-class presentations. Some meetings outside of class time will be required."
                                            }
}