{
        "code":  "80-222",
        "name":  "Measurement and Methodology",
        "short_name":  "MEAS AND METHODOLOGY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is intended as an introduction to the theory of measurement a study of one branch of scientific methodology.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will be able to develop appropriate quantitative units for qualitative phenomenon.",
                                                    "key_topics":  "This course is intended as an introduction to the theory of measurement: a study of one branch of scientific methodology.\n•How are units chosen for expressing quantitative laws in the sciences?\n•Under what conditions do qualitative relationships determine quantitative ones?\n\nWe shall investigate several theories of measurement, both with and without error in the observations underlying the measurement systems.\n\nApplications will be taken from the natural and social sciences.\nThese include:\n\textensive measurement for length;\n\tqualitative and quantitative measurement for uncertainty;\n\nconjoint measurement for representing multi-attributed phenomenon.",
                                                    "prerequisite_knowledge":  "Students should have background in elementary logic and be comfortable with taking mathematical approaches to conceptual problems.",
                                                    "assessment_structure":  "There will be regularly scheduled written assignments. But no in-class exams. There will be opportunity for original research.",
                                                    "relevance":  "Students will gain an understanding of the methodology for how to relate quantitative and qualitative aspects of theories and their evidence.",
                                                    "learning_resources":  "In addition to lecture notes, additional readings and exercises will be provided via CANVAS.",
                                                    "extra_time_commitment":  "No extra time commitments are required."
                                            }
}