{
        "code":  "80-221",
        "name":  "Philosophy of Social Science",
        "short_name":  "PHILOS OF SOCIAL SCI",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will explore numerous philosophical issues that arise in the practice of various social sciences. One central question of the course is whether we can use traditional scientific reasoning to understand social phenomena, e.g. social inequalities, violence, changes in politics, discriminary practices, ecnomic forcasting, etc. in the same way that we use them to understand natural phenomena, e.g. gases, organisms, protein structure, and planetary orbits. Some of the more specific questions we address are Because humans possess free will and act with intentions while light rays and planets in motion do not, are we forced to use  different kinds of explanations in the two cases How can we explain social institutions that depend upon cooperation when there considerable pyschological evidence that cooperation doesnt help us in achieving our own personal goals Whereas natural scientists actively conduct experiments, social scientists can often only collect statistical and qualitative data. Does this difference prevent social scientists from inferring causal relations and laws of social behavior Is our understanding of social phenomena always value laden given that values are an inherent aspect of social life",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "When you finish this course, you should be able toGive a general description of what constitutes a social science.Differentiate the kinds of explanations social scientists provide from nonscientific accounts of social phenomena.Describe various strategies for gathering data about social phenomena.Distinguish between naturalist and interpretivist strategies for doing social sciences.Explain concerns about social scientists personal values influencing their work and give the arguments for and against social scientists using their value systems in their inquiries.Distinguish between reductive and nonreductive approaches to understanding social phenomena.Describe the challenges faced by scientists seeking to identify causal relationships in the social sciences.Provide basic scientific strategies for identifying causal connections using correlational data.Explain the meaning of rational choice theory and the form of it known as game theory. Describe how rational choice theory strategies are used to model both individual decisionmaking and patterns of behavior in social phenomena.Describe different kinds of uncertainty involved in formulating and testing theories in the social sciences.Discuss and evaluate different approaches to modeling phenomena in the social sciences.Describe and evaluate agentbased modeling as a fundamental strategy for understanding social phenomena.Describe some cases of the use of results from the social sciences to inform decisions about government or private sector policies.",
                                                    "key_topics":  "Fundamental issues in general philosophy of science including: scientific explanation, confirmation of theories, realism and anit-realism, reductive explanations, and explanation. Specific topics relevant to the social sciences including holism vs. reductionism debates, causal analysis, values and scientific study, simulations, qualitative research methods, game theoretic analyses, and models.",
                                                    "prerequisite_knowledge":  "No prior knowledge necessary",
                                                    "assessment_structure":  "Daily short readings from and about social science. Submit complete answers to two reading questions and notes on three other questions.",
                                                    "relevance":  "ietrich GenEd Prior to Fall 2021: Deciding\nDietrich GenEd After Fall 2021: Scientific Inquiry\n\nUnderstanding similarities and differences in scientific study in the natural and the social sciences. Understanding complexities of theory discovery, confirmation, and change. Understanding the increasingly important role of computational models in the social sciences and well as the value of qualitative research.",
                                                    "learning_resources":  "All readings are provided via Canvas. Each reading is accompanied by a \"reading guide\" provided by the professor.",
                                                    "extra_time_commitment":  null
                                            }
}