{
        "code":  "80-254",
        "name":  "The History of Analytic Philosophy and Its Influence",
        "short_name":  "ANALYTIC PHILOSOPHY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is about the influence of Analytic Philosophy on contemporary thought. Analytic philosophy is a tradition within Western Philosophy that aims for clear writing, rigor in arguments, and continuity with both the formal and the empirical sciences. The goal is to study early Analytic Philosophy and Logical Positivism to lay a foundation for understanding more recent work in their tradition.  Early figures of Analytic Philosophy include Gottlob Frege 1848, who provided a theory of meaning, developed modern logic and aimed to reduce arithmetic to logic Bertrand Russell 1872, who adopted Freges logic as a method to expose the underlying structure of philosophical problems and George Edward Moore 1873, who argued that goodness cannot be analyzed by the methods of natural science and defended common sense beliefs against both skepticism and British idealism. The early figures and Russells student Ludwig Wittgenstein 1889 emphasized creating an ideal language for philosophical analysis, which should be free from the ambiguities of ordinary language. The quest for an ideal language inspired Logical Positivismthe thesis that only statements verifiable through direct observation or logical proof are meaningful.   This course invites you to delve into the development of Analytic Philosophy to date. We will read groundbreaking papers by the mentioned philosophers and more recent ones. This year, we will focus in particular on the subjective interpretation of probability as degrees of belief offered by Frank Plumpton Ramsey 1903 and the development of theories of causality from Hans Reichenbach 1891 over John Leslie Mackie 1917 and David Kellogg Lewis 1941 to the contemporary work conducted at Carnegie Mellon University.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will gain an appreciation for some of the key ideas and foundational texts of analytic philosophy. Additionally, they will hone their skills at analyzing philosophical arguments and at writing wellstructured philosophy essays.",
                                                    "key_topics":  "The course will cover the methods and some of the foundational debates of Analytic Philosophy. We will learn about the central role played by logical and conceptual analysis and by the study of language. Among the topics we will discuss are the nature of meaning and the analysis of truth (Philosophy of Language), inductive reasoning, confirmation, and probability (Epistemology and Philosophy of Science), and theories of causation (Metaphysics, Epistemology, and Philosophy of Science).",
                                                    "prerequisite_knowledge":  "No prior knowledge required. Some acquaintance with formal logic would be beneficial.",
                                                    "assessment_structure":  "There will be extensive reading, a participation grade, a student presentation, two summaries of an assigned text, and a final term paper.",
                                                    "relevance":  "Students will learn about some of the foundational questions and prominent positions in analytic philosophy, the dominant philosophical tradition in the English-speaking world. In doing so, students will get acquainted with an approach to philosophical inquiry that has not only shaped much of contemporary philosophy, but that has also influenced the development of disciplines such as logic, linguistics, computer science, and decision theory.",
                                                    "learning_resources":  "Readings will consists of journal articles and book excerpts, all of which will be available in electronic form on Canvas.",
                                                    "extra_time_commitment":  null
                                            }
}