{
        "code":  "80-249",
        "name":  "AI, Society, and Humanity",
        "short_name":  "AI SOC HUMANITY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The course is divided into three parts. The first part centers on the foundational question of the field of AI Can machines think We will consider an operationalization of the questionthe Turing Testand a philosophical criticism thereofthe Chinese Room Argument. Along the way, we will encounter the principles governing digital computers and artificial neural networks. The next part is on the impacts of AI on society. We will investigate in what sense machine learning algorithms can be said to be unfair or discriminatory. We will discuss the black box problemthe problem that we often dont understand how the output of a machine learning model came about. Further topics include the risks posed by large language models, fake news, echo chambers, twitter aka X, and other threats to democracy.   The last part is on the potential impacts of AI on humanity. We will discuss whether humanity is at risk due to the singularityan anticipated explosion of artificial intelligence such that some AI systems surpass humanlevel intelligence. Does such a superintelligence pose an existential risk to humanity What is the probability that we are doomed in the wake of artificial superintelligence Can we change this probability by aligning AI with human values These are but some of the core questions we will tackle.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Explain many of the different ways that AI robotic technologies can impact people. Understand and consume analyses of technology from multiple disciplinary perspectives.",
                                                    "key_topics":  "What is AI? What are the societal impacts of AI on society? What are the potential impacts of AI on humanity?",
                                                    "prerequisite_knowledge":  "No prior knowledge necessary.",
                                                    "assessment_structure":  "There will be in-class quizzes, critical analyses, and a philosophical essay.",
                                                    "relevance":  "Dietrich GenEd prior to 2021: Reflecting\nTeaches students how to understand the impacts of technology on their lives.",
                                                    "learning_resources":  "Articles and textbook chapters.",
                                                    "extra_time_commitment":  null
                                            }
}