{
        "code":  "80-212",
        "name":  "Arguments and Logical Analysis",
        "short_name":  "ARGUMNTS LOGCL ANLYS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Are there rational methods that can further our knowledge The notion of rational inquiry presupposes that there are appropriate methods for the pursuit of knowledge. In this course, we will investigate the means by which a successful argument justifies its conclusion, as well as various subtle ways in which other arguments fail. The course will explore the use of logic as an instrument in the study of arguments and reasoning, and it will serve as a gentle introduction to the elementary concepts of formal logic. We will take a historically informed approach to studying logic and argumentative fallacies, and we will discover that logical tools and methods are useful for constructing and analyzing arguments in all disciplines, from philosophy and history to psychology and physics. Our goals are to acquire a solid grasp of some fundamental tools of modern logic, and learn how to use them to make our thinking and writing clearer, more precise, and more critical. To this end, our coursework will consist in homework and exams on topics in logic, as well as writing assignments on a variety of topics. This course is intended for students from any discipline who would like to improve their writing and critical thinking skills, as well as students who are interested in learning logic without having had prior contact with the subject.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will gain an understanding of the fundamental notions of modern logic, and will learn how to employ them in constructing and evaluating arguments.",
                                                    "key_topics":  "Introduction to logic, with a focus on the analysis of arguments.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "Weekly homeworks, mid-semester and final exams.",
                                                    "relevance":  "Students will get acquainted with the use of logic as a tool in the study of arguments and reasoning, which will contribute to developing essential critical thinking and argumentative writing skills.",
                                                    "learning_resources":  "Text: Gensler, Harry J. (2017) Introduction to Logic, 3rd Ed. New York: Routledge.",
                                                    "extra_time_commitment":  null
                                            }
}