{
        "code":  "80-211",
        "name":  "Logic and Mathematical Inquiry",
        "short_name":  "LOGIC MATH INQUIRY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Since ancient times, mathematical arguments have served as a paradigm for rational inquiry. We will study fundamental mathematical concepts and informal proofs as they occur in everyday mathematics. We will also use the methods of mathematical logic, which provides formal symbolic languages, to help us understand the structure of a mathematical argument. Finally, we will make use of a new computational proof assistant, called Lean, to develop fully rigorous, machinechecked proofs.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "This course will teach you touse fundamental concepts and methods of mathematical argumentationapply the concepts and methods of symbolic logicwrite clear, literate, mathematical proofsuse symbolic logic to analyze the structure of mathematical proofs and assess their correctnessuse a computational proof assistant for write and mechanically check mathematical proofsuse logic as a precise specification languageexplain the limitations of formal languages and formal systems of reasoning.",
                                                    "key_topics":  "We will introduce the syntax and semantics of propositional and first-order logic. We will cover reasoning about relations and functions, as well as elementary number theory, combinatorics, the construction of basic number systems, and some set theory.",
                                                    "prerequisite_knowledge":  "Confidence with basic high school mathematics",
                                                    "assessment_structure":  "Weekly problem sets and exams, with slightly more weight on the weekly assignments.",
                                                    "relevance":  "Dietrich GenEd Prior to Fall 2021: Modeling - Math\nDietrich GenEd After Fall 2021: Logic / Mathematical Reasoning\n\nThis course prepares students to take the 80-310-80-311 series on the fundamental (in)completeness and (un)decidability theorems of modern logic.\n\nThis course helps students develop skills in precise reasoning and argumentation which is generally useful in life and in many careers.",
                                                    "learning_resources":  "Free online textbook and proof assistant, all organized via Canvas",
                                                    "extra_time_commitment":  null
                                            }
}