{
        "code":  "80-234",
        "name":  "Race, Gender, and Justice",
        "short_name":  "RACE GENDER JUSTICE",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Race and gender, along with their interfaces and interactions with such other social identities as sexuality, disability, and class, structure our experience of almost every aspect of our social and political reality. Philosophers approach these kinds of social identities from a variety of perspectives. They ask what these kinds of social categories really are, what they mean for the ways we live our lives and the ways we perceive and understand the world, how they have misinformed our theoretical and practical understanding of the nature of justice and political power, and what is owed to those affected by racial and gendered injustice. This course explores these topics, drawing on tools and perspectives from epistemology, ethics, and especially social and political philosophy.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students are expected to come away from the course with a strong understanding of some of the major philosophical debates about the nature of race and gender how race and gender intersect with other aspects of identity and how these aspects of social identity impact how we experience and navigate our world, how and what we know, and what kinds of life paths are open to us. Students will gain the theoretical frameworks to analyze ongoing debates about the nature of racial and gender justice and the analytical reading and writing skills to apply these tools to pressing social and political issues in persuasive verbal and written arguments. This course is primarily conducted as a seminar and is discussion rather than lecturebased.",
                                                    "key_topics":  "This course explores a selection of philosophical approaches to race, gender, and related aspects of social identity, and the impact of these identities on issues of justice and for our lives as agents and knowers.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "There will be a reading for every class meeting. Assessments will consist of regular short writing assignments and a few longer papers, as well as participation in class discussion and group activities.",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Reflecting\nDietrich GenEd after Fall 2021: Perspectives on Justice and Injustice\n\nWe live in a society. Course satisfies diversity and equity GenEd requirement.",
                                                    "learning_resources":  "All materials will be made available via Canvas.",
                                                    "extra_time_commitment":  "There are no extra time commitments."
                                            }
}