{
        "code":  "80-271",
        "name":  "Mind and Body: The Objective and the Subjective",
        "short_name":  "MIND \u0026 BODY OBJ SUB",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is about the subjective and the objective. Subjective captures the distinctive features that characterize what it means to be a psychological subject. This includes the power to represent, to think, feel, sense and in general to be conscious. Subjective features seem radically different from the physical world of matter and forces, a world that seems meaningless, unthinking and nonconscious. How can the subjective be rooted in the objective We address this central philosophical problem by engaging philosophy with science. In this course, we will investigate thinking, sensing, imagining, dreaming, hallucinating, mindfulness and selfknowledge. As a result, we will explore how the subjective might be the objective. Students will develop analytical techniques such as conceptual analysis and argument analysis.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will understand how to address fundamental problems about the mind in a systematic way. They will learn how to identify, reconstruct, criticize and generate arguments.",
                                                    "key_topics":  "This course will cover the philosophy and cognitive science of the subjective and how it relates to the physical world.",
                                                    "prerequisite_knowledge":  "An intro course in philosophy, in cognitive psychology or in cognitive neuroscience would be helpful but not required.",
                                                    "assessment_structure":  "There will be argument reconstructions, a mid-term exam based on short essay responses and a few papers.",
                                                    "relevance":  "Dietrich GenEd prior to 2021: Deciding\n\nIt will teach philosophy, psychology and neuroscience students how to think critically about a central problem in their field, how to relate subjective phenomena to physical and biological systems.",
                                                    "learning_resources":  "CANVAS",
                                                    "extra_time_commitment":  null
                                            }
}