{
        "code":  "80-261",
        "name":  "Experience, Reason, and Truth",
        "short_name":  "EXPERIENCE REA TRUTH",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "A central issue in Western philosophy has been whether reason or experience or some of both provides the foundations for human knowledge. This course explores that question by looking at various empiricist vs. rationalist debates from the 17th century to the present day. We will focus on the problems encountered in trying to give an adequate account of the our knowledge of the external world, the structure of our minds, and the nature and limitations of human knowledge. The scope of our investigation will extend to the nature of mathematical knowledge, to thought experiments in both science and philosophy, and to nativism vs. empiricism issues in contemporary cognitive science and moral theory. The course has two main goals 1 to study key metaphysical and epistemological issues surrounding the nature of human knowledge and 2 to help improve our analytical and critical skills by extracting and evaluating various relevant philosophical arguments.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Understand the fundamentals of both empiricist and rationalist views of human knowledge. Provide arguments supporting both empiricism and rationalism. Understand some fundamental epistemological and ontological views of many philosophers. Reconstruct and evaluate arguments from written text. Make useful contributions to collaborative inquiry.",
                                                    "key_topics":  "Differing views on the acquisition and justification of human knowledge, including those if Descartes, Leibniz, Hume, Kant, Mill, Duhem, Hempel, Salmon, Klein, Wigner, and others, including those cognitive scientists, from 20th and 21st century philosophy and cognitive science. Exploring the differences between knowledge of the physical world, pure mathematics, and applied mathematics.",
                                                    "prerequisite_knowledge":  "No prior knowledge necessary",
                                                    "assessment_structure":  "Daily short reading in various theories of knowledge with writing assignments (answering two questions for each assignment).",
                                                    "relevance":  "Dietrich GenEd prior to 2021: Reflecting",
                                                    "learning_resources":  "Excerpts from original philosophy and cognitive science. Each reading is accompanied by a reading guide.",
                                                    "extra_time_commitment":  null
                                            }
}