{
        "code":  "80-226",
        "name":  "The Nature of Scientific Revolutions",
        "short_name":  "SCI REVOLUTIONS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Science is an everchanging enterprise. Most scientific advances, though significant, occur within a stable framework of accepted theories and data. A few episodes of change in the history of science involve discarding and replacing fundamental theories of the world. These are often accompanied by significant changes in the vocabulary in which those theories are expressed, the tools used by scientists, the phenomena on which scientists focus, and the kinds of explanations they consider acceptable. A very small number of these episodes change the way humanity views its ability to know the natural world and its place in the universe. The latter two kinds of change in science have often been called scientific revolutions. We will focus on three such radical transformations The Copernican Revolution or the Scientific Revolution of the 16th and 17th centuries, the Darwinian revolution of the 19th century, and the quantum revolution of the late 19th and 20th centuries. This course has two intertwined components history of science and philosophy of science. In the historical component, we will examine in some detail the three major scientific revolutions. The philosophical components will help us understand the reasoning involved in scientific theory change. This course does not require detailed knowledge of any of the sciences used in examples of revolutionary change.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course, you should be able to do the followingDescribe alternative views on the goals of science.Describe how scientific explanations have been distinguished from nonscientific explanations.Explain what kinds of change in scientific theory and practice might reasonably be identified as revolutionary rather than evolutionary.Describe what conditions prompt proposals for replacement of seemingly wellestablished and widely accepted scientific theories.Explain how fundamental assumptions about the nature of reality play a role in the development and acceptance or rejection of scientific theories.Explain the difference between empirical laws and causal explanations of the behaviors described by such laws.Describe desiderata for scientific theories other than empirical accuracy. Describe and explain the kinds of uncertainty that scientists must deal with in the development and justification of new theories.Give some historical examples of how scientific theories evolve over time and some example causes of that evolution.Explain how scientists argue for the existence of unobservable entities, processes, and events e.g., of subatomic particles or natural selection during periods millions of years ago.Describe various key roles that mathematics has played in natural sciences.Explain the difference between the empirical adequacy of a theory its capacity to save the phenomena and its truth.Describe the epistemic challenges faced by sciences with little access to experimentation, e.g., largely historical sciences like geology and astronomy.Describe how the revolutionary episodes can have a significant impact on general assumptions about the nature of reality and humanitys place in the universe.",
                                                    "key_topics":  "Details of historical examples of scientific \"revolutions\": the Copernican, Darwinian, and Quantum revolutions. Theories of conceptual change in science. Key concepts in the philosophy of science - confirmation, falsification, under-determination of theory by evidence, mathematical models of physical models, historical sciences, experimental sciences, concepts of physical reality, etc.",
                                                    "prerequisite_knowledge":  "No prior knowledge beyond high school science is necessary",
                                                    "assessment_structure":  "Daily short readings about historical episodes in science and from philosophy of science literature. Submit complete answers to two reading questions and notes on three other questions.",
                                                    "relevance":  "Dietrich GenEd Prior to Fall 2021: Modeling - Other\nDietrich GenEd After Fall 2021: Scientific Inquiry\n\nDietrich GenEd prior to 2021: Modeling: Other Students develop a more complete understanding of scientific discovery, the complexity of scientific reasoning, and the nature of scientific theory change. They also learn about significant details about historical episodes in science that reveal the complexities involved.",
                                                    "learning_resources":  "Three inexpensive texts need to be purchased. Each reading is accompanied by a \"reading guide\" provided by the professor.",
                                                    "extra_time_commitment":  null
                                            }
}