{
        "code":  "80-325",
        "name":  "Foundations of Causation and Machine Learning",
        "short_name":  "FDN CAUS MACH LEARN",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "How can we define causality Does smoking cause cancer Can one find causality from observational data without temporal information In our daily life and science, people often attempt to answer such causal questions for the purpose of understanding, proper manipulation of systems, and robust prediction under interventions. In the past decades, interesting advances were made in machine learning, philosophy, statistics, and economics for tackling longstanding causality problems, and a number of researchers have been recognized with the Turing Award to Pearl in 2012 the Nobel Prize to Granger in 2003 and to Sims in 2011. This course is primarily concerned with historical and technical developments of modern causality research, focusing particularly on how to discover causality from observational data and how to infer the causal effect of one variable on another. Thinking more broadly, causal analysis is a particular branch of unsupervised multivariate analysis. Accordingly, this course also provides a big picture of the foundations of causation and unsupervised machine learning. We start with unsupervised learning and multivariate statistical analysis problems including factor analysis, principal component analysis, and independent component analysis, and formulate their assumptions, develop their solutions, and study their connections with causal analysis. Finally, we investigate how the causal perspective helps in solving advanced machine learning or artificial intelligence problems, including transfer learning, imagetoimage translation, reinforcement learning, and unsupervised deep learning.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "As an outcome of this course, participants are expected toDescribe how we distinguish association from causation and how that helps us solve problems across multiple disciplinesExplain the historical developments in the understanding and analysis of clearly causal, seemingly noncausal, and clearly noncausal problems.Use probabilistic graphical causal representations and causal principles for reasoning under uncertainty and decision makingReliably find causal relations from data under a variety of different assumptions, and make use of the causal relationsLeverage causality in understanding and solving seemingly noncausal machine learning and artificial intelligence problemsSelect and use causal analysis and machine learning software tools to solve problemsFormulate and deal with the ethical issues and vulnerability of AI in a causal, computational manner.",
                                                    "key_topics":  "Inferring causal structures from non-experimental data, basic machine learning problems and approaches, applying causal principles for machine learning",
                                                    "prerequisite_knowledge":  "Specific prerequisite courses are not required, but students are expected to be familiar with elementary statistics or machine learning.",
                                                    "assessment_structure":  "Reading questions and problem sets every two-three weeks. Class participation. An essay or project for each individual or team of two students.",
                                                    "relevance":  "Dietrich GenEd Prior to Fall 2021: Modeling - Other\nDietrich GenEd After Fall 2021: Computational Thinking\n\nThis course is relevant to many different scientific disciplines such as economics, biology, and the social sciences that involve inferring causal structures from non-experimental data and multivariate statistical analysis, and to anyone interested in assumptions and methods for unsupervised machine learning.",
                                                    "learning_resources":  "No recommended textbook. Lecture notes and recommended readings available on Canvas.",
                                                    "extra_time_commitment":  null
                                            }
}