{
        "code":  "80-314",
        "name":  "Causal Discovery, Statistics, and Machine Learning",
        "short_name":  "CAUSAL STAT ML",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Statistics and Machine Learning have made tremendous strides in recent years in solving a wide variety of regression and classifiction problems. However, causal discovery problems i.e. discovery of which variables are affected by a given variable that undergoes change due to an external intervention, either manmade or natural, and to what extent other variables are affected by such a change are distinct and more difficult problems. Causal discovery problems arise not only in scientific contexts e.g. discovering which genes regulate which other genes but also in some machine learning contexts e.g. transfer learning problems. This course will i describe how causal discovery problems differs from regression and classification problems in goals, methods, and fundamental assumptions, ii descibe recent advances in modifying machine learning and statistical algorithms to deal with causal discovery problems involving such difficulties as latent confounders, measurement error, selection bias, etc., and iii  what the outstanding problems in causal discovery are and future directions the field might take. Students should have taken at least one course in statistics or machine learning, or obtain the permission of the instructor.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will learn about the theory of causal inference, how causal inference differs from ordinary statistical inference, and how to apply recent algorithms in causal inference from various kinds of observational data",
                                                    "key_topics":  "We will examine the representation of causal models, what can be inferred from the data about the causal models, and what can be inferred from causal models about the effects of interventions, and the difference between causal models and ordinary statistical models.",
                                                    "prerequisite_knowledge":  "Some statistical background.",
                                                    "assessment_structure":  "Several homework assignments, class project and class participation",
                                                    "relevance":  "The course will provide students with the necessary background to employ recent advances in the inference of causal models from observational data",
                                                    "learning_resources":  "Text books, online software, online tutorials",
                                                    "extra_time_commitment":  null
                                            }
}