{
        "code":  "80-305",
        "name":  "Game Theory",
        "short_name":  "GAME THEORY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Game theory is the study of interactive decisionmaking making choices in the context of other agents who are also making choices. Famous examples include the Prisoners Dilemma pitting rational selfinterest against the benefits of cooperation, and the Cournot duopoly a basic model of market competition and supplyanddemand. Game theory has been applied to situations as diverse as traffic flow, auctions, the search and competition for scarce resources, and bargaining. This course will develop conceptual and technical facility with the mathematical tools used to model and analyze such situations. We will cover both simultaneous and sequential games and become familiar with a variety of concepts such as strict and weak dominance, randomization, expected utility maximization, neverbest responses, noncredible threats, and time discounting. Well also study solution concepts such as Nash equilibrium, correlated equilibrium, rationalizability, and subgame perfect equilibrium. Throughout the course we will take the opportunity to actually play several of the games we study to help build intuitions and foster insights into the formal mathematical models we develop. Some experience with mathematical methods definitions, proofs, etc. will be helpful.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will learn how to read and understand gametheoretic models in a variety of contexts navigate the landscape of solution concepts and find equilibria in games formalize intuitions and analyze problems using gametheoretic tools probe and critically assess the underlying assumptions of standard game theory.",
                                                    "key_topics":  "The course will cover basic concepts in contemporary Game Theory, such as: mixed strategies,Nash equilibrium, correlated equilibrium, rationalizability, repeated games, sequential games,and bargaining theory.",
                                                    "prerequisite_knowledge":  "Some prior exposure to reading and writing mathematical proofs will be very helpful, along with some basic knowledge of probability.",
                                                    "assessment_structure":  "Most of the grade will be based on take-home problem sets assigned every 2 weeks. These willbe supplemented with short in-class tests and quizzes. There is no final exam.",
                                                    "relevance":  "The games we will consider and the tools we will develop to analyze them offer insight into a variety of real-world phenomena, from interactions as concrete as auctions and traffic flow, to bargaining, market competition, coordination, trust, and betrayal.",
                                                    "learning_resources":  "Course notes will be provided along with a recommended (not required) textbook.",
                                                    "extra_time_commitment":  null
                                            }
}