{
        "code":  "80-312",
        "name":  "Mathematical Revolutions",
        "short_name":  "MATH REVOLUTIONS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Mathematics is a central part of our intellectual experience. It is connected to sophisticated philosophical perspectives, say, in the work of Plato, Descartes, Leibniz, Kant, as well as in contemporary analytic philosophy it is equally connected to fundamental views in the sciences, say, in the work of Ptolemy, Galileo, Newton, Einstein, as well as in contemporary cosmology. The common view that mathematics  if not directly static  is evolving in a linear fashion, does not withstand historical scrutiny. Indeed, there are many dramatic conceptual changes concerning the very nature and object of mathematics.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will obtain a quite novel perspective on the nature of mathematics. In addition, they will gain a deep understanding of three transformative developments in modern mathematics and logic.Students will learn to1Articulate axiomatic foundations and use logical tools to develop rigorous arguments.2Assess conflicting perspectives of mathematicians about the foundations and methods of their subject.3Apply the methods mathematicians use to argue for their foundational claims.",
                                                    "key_topics":  "We examine three episodes in the relatively recent past that reflect radical transformations of the subject. They are closely associated with three mathematicians in whose work those revolutionary changes come to the fore most poignantly. The three episodes are framed by a discussion, at the beginning, of the axiomatic method and, at the end, of contemporary computational models of mathematical thinking. The episodes fall within the period from 1854 to 1954, but have deep roots in the past. The first episode deals with the shift from geometry to arithmetic as the foundational discipline for mathematics. The accompanying change in the methodological perspective is expressed in Hilbert\u0027s \"Foundations of Geometry\". When joined with contemporaneous logical developments, that perspective underlies the formalization of mathematics and is at the center of the second episode. Gödel\u0027s incompleteness theorems imposed theoretical limits on that work. Given Turing\u0027s analysis of computations, the question \"How much of mathematical reasoning can be accomplished by computing machines?\" is addressed in the third part. Completing a full circle, we incorporate central features of the axiomatic method into computational models of mathematical thinking.",
                                                    "prerequisite_knowledge":  "Some familiarity with either mathematics, logic or theoretical computer science.",
                                                    "assessment_structure":  "Extensive reading for all meetings, brief analytic essays concerning each of the three revolutions, class presentations about readings and one larger term paper together with a brief presentation on a topic of the student\u0027s interest.",
                                                    "relevance":  "Dietrich GenEd Prior to Fall 2021: Modeling - Other\nDietrich GenEd After Fall 2021: Logic / Mathematical Reasoning\n\nFor any student who studies mathematics, computer science, philosophy or cognitive psychology, the material is crucial for grasping the interdependence of these subjects.",
                                                    "learning_resources":  "Important primary sources and illuminating secondary literature provided by the instructor via Canvas.",
                                                    "extra_time_commitment":  null
                                            }
}