{
        "code":  "80-330",
        "name":  "Ethical Theory",
        "short_name":  "ETHICAL THEORY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course provides a detailed survey of the structure of prominent theories of normative ethics. The space of possible consequentialist and nonconsequentialist theories is surveyed. The course engages classic texts from Aristotle, Kant, Mill, Rawls, and contemporary essays by leading philosophers.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1.Students will frame and reframe fundamental questions about key concepts, such as the good, human welfare, the nature of actions and their consequences in order to understand how these concepts can be connected and organized to produce different ethical theories.2.Students will use these framings to interpret key texts in ethical theory with an eye to producing interpretations that are faithful to the original text while being as philosophically compelling as possible.3.Students will consider how different forms of consequentialist and nonconsequentialist ethical theories have developed and be able to compare and contrast the relative merits of these theories under alternate interpretations of their key concepts. 4. Students will also practice sympathetic reconstruction of arguments in the text we read as well as critical reasoning in the analysis and production of arguments in support of the claims they make in their papers.",
                                                    "key_topics":  "Topics include alternative accounts of the following topics and their role in normative ethics: the human good, welfare or wellbeing, rationality, rules and institutions, virtues or dispositions of character, agreement among rational agents, rights, duties, and more. The course is a detailed example of how to construct and evaluate theories, how to reason about ethical issues, and the role of theories in such reasoning.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Attendance, class participation, unit review quizzes and short essays",
                                                    "relevance":  "New DC: Contextual Thinking\nOld DC Gen Ed: Deciding\nThe course is relevant to any discipline that makes normative judgments, from ethics to economics, to policy and artificial intelligence.",
                                                    "learning_resources":  "Shelly Kagan: Normative Ethics (Westview) in bookstore or from Amazon. John Stuart Mill. Utilitarianism \u0026 On Liberty. (PDF on Canvas) Immanuel Kant. Groundwork of the Metaphysics of Morals. (PDF on Canvas) Aristotle. Nicomachean Ethics. (PDF on Canvas) Select essays will be available in PDF on Canvas.",
                                                    "extra_time_commitment":  null
                                            }
}