{
        "code":  "80-335",
        "name":  "Social and Political Philosophy",
        "short_name":  "SOC POL PHILO",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Broadly speaking, political philosophers are interested in whether, and to what extent, government use of coercion can be justified, and how formal social and political institutions should be structured in order to be legitimate. Social philosophy encompasses these political questions, but also looks at how individuals should live together and how individual behaviors can impact not only state institutions but also more informal social norms and institutions.  This is an advanced course in social and political philosophy, aimed at providing students with an indepth familiarity with classic and contemporary questions both theoretical and applied.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students are expected to come away from the course with a strong understanding of some of the major debates in social and political theory as well as the theoretical tools to analyze ongoing debates about the nature of justice, including racial and gender justice, and who is responsible for ensuring a just society and why. Students are also expected to come away from the course with improved analytical reading and writing skills and the ability to apply the theoretical frameworks considered in class to pressing social and political issues of our time in persuasive writing. This course is primarily conducted as a seminar and is discussion rather than lecturebased.",
                                                    "key_topics":  "The course is topical, and course topics vary from year to year. Typically 4-5 topics are covered in a term. Previous years\u0027 topics have included the nature and value of freedom, social contract theory, racial and epistemic injustice and the nature of white ignorance, sexism and the nature of misogyny, the intersecting concepts of justice and equality, structural injustice, responsibility for injustice, and immigration.",
                                                    "prerequisite_knowledge":  "No prior knowledge is necessary, but a previous class in philosophy would be helpful.",
                                                    "assessment_structure":  "Typically: regular short writing assignments; 3 longer-form essays; attendance and participation in class discussions and activities",
                                                    "relevance":  "Dietrich Gen Ed prior to Fall 2021: Reflecting\nDietrich GenEd After Fall 2021: Equity and Justice\n\nCounts as Values \u0026 Normative Theory for Philosophy major, Political Philosophy for EHPP major. Course option for Global Studies students and International Relations and Politics students.",
                                                    "learning_resources":  "All readings are provided by the instructor via Canvas.",
                                                    "extra_time_commitment":  null
                                            }
}