{
        "code":  "80-324",
        "name":  "Philosophy of Economics",
        "short_name":  "PHILOSOPHY ECONOMCS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The science of economics has come to occupy a central position in contemporary society. Because of this central position in political decision making, economics is intertwined with a number of other philosophical issues surrounding justice, rights, and fairness. The central theme of this course will be on the arguments in favor and against markets as effective solutions to political problems. This issue will allow us to analyze a wide number of foundational issues in economics including the testability of economic claims, the use of rationality postulates, the foundation of the right to property, and measuring the success or failure of an economy.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of this course, I want you to understand the underlying assumptions used by economists when making economic models. I want you to be able to think critically about those assumptions. Whether or not you ultimately decide you like them or hate them is irrelevant to me. I want you to know whyyou like them or dislike them.",
                                                    "key_topics":  "This course looks at the discipline of economics from a philosophical point of view. The course is organized around a basic question: why do people think markets are good? This question provides us an opportunity to look at a number of interesting questions at the boundary of philosophy and economics like: why do people have a right to property and why do we think we can learn from mathematical models of social behavior?",
                                                    "prerequisite_knowledge":  "No knowledge of either philosophy or economics is presumed",
                                                    "assessment_structure":  "The course is built around a large final project which involves applying the course concepts to a good or service of your choice.",
                                                    "relevance":  "Dietrich GenEd Prior to Fall 2021: Deciding\nDietrich GenEd After Fall 2021: Equity and Justice\n\nMany political questions turn on using a market. People argue about whether education, healthcare, and recreational drugs should be distributed via a market or some other mechanism. This course will help you to unravel the various arguments for and against the market in this different domains.",
                                                    "learning_resources":  "Online readings",
                                                    "extra_time_commitment":  null
                                            }
}