{
        "code":  "80-413",
        "name":  "Category Theory",
        "short_name":  "CATEGORY THEORY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Category theory is a formal framework devoted to studying the structural relationships between mathematical objects. Developed in the mid20th century to attack geometrical problems, subsequent progress has revealed deep connections to algebra and logic, as well as to mathematical physics and computer science. The course emphasizes two perspectives. On one hand, we develop the basic theory of categories, regarded as mathematical structures in their own right. At the same time, we will consider the application of these results to concrete examples from logic and algebra. Some familiarity with abstract algebra or logic required.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Get a working knowledge of the fundamental concepts of category theory, to be able to read literature using categorical language and use this language in research.",
                                                    "key_topics":  "Category theory is a formal framework devoted to studying the structural relationships between mathematical objects. It has connections to algebra and logic, as well as to mathematical physics and computer science. In the course we develop the basic theory of categories, and consider the application of these results to some examples from logic and algebra.",
                                                    "prerequisite_knowledge":  "Some familiarity with abstract algebra or logic required. In particular, the students should have some experience in writing mathematical proofs.",
                                                    "assessment_structure":  "Weekly exercises and an in-classroom final exam.",
                                                    "relevance":  "Relevant to philosophers interested in logic, computer scientists interested in types and programming languages, and to mathematicians.",
                                                    "learning_resources":  "Textbook \"Category Theory\" by Awodey and additional literature listed on the website.",
                                                    "extra_time_commitment":  "Students are expected to spend several hours per week on homework."
                                            }
}