{
        "code":  "80-516",
        "name":  "Causality and Machine Learning",
        "short_name":  "CAUSALITY \u0026 ML",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In the past decades, significant progress has been made in tackling longstanding causality problems, such as discovering causality from observational data and inferring causal effects. Moreover, it has recently been shown that the causal perspective aids in understanding and solving various machine learning problems such as transfer learning, outofdistribution prediction, disentanglement, representation learning, and adversarial vulnerability. Accordingly, this course is concerned with understanding causality, learning it from observational data, and using it to tackle other learning problems.The course covers representations of causal models, how causality is different from association, methods for causal discovery and causal representation learning, and how causality enhances advanced learning tasks, including generative AI. We will address the following questions. Why is causality essential How can we learn it, including latent variables, from observational data What role does causality play in learning under data heterogeneity Can causal principles make generative AI more controllable and capable of extrapolation How can deep learning benefit from a causal perspective Two main causality problems are emphasized. One is causal discovery or causal representation learning. It is well known that correlation does not imply causality, but we will make it more precise by asking what assumptions, what information in the data, and what procedures enable us to successfully recover causal information. Causal relations may happen among the underlying hidden variableswe will also see how to uncover the underlying hidden causal variables as well as their causal relations from the measured variables. The other is how to properly make use of causal information. This includes identification of causal effects, counterfactual reasoning, and improving machine learning with causal knowledge.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "As an outcome of this course, participants are expected to Understand how causality is different from association and why it is useful,Get familiar with graphical models, causalityrelated concepts and principles, and emerging approaches to causal discovery or causal representation learning from observational data,Be acquainted with the stateoftheart of causality research in different disciplines,Be able to develop suitable methods for causal representation learning or causal discovery to address problems in specific domains,Properly leverage causality in understanding and solving advanced machine learning and artificial intelligence problems,Identify and formulate causal problems in your respective fields, and be able to find potential solutions.",
                                                    "key_topics":  "Discovering causality from observational data, causal representation learning, identification of causal effects, unsupervised machine learning, causal approaches to advanced machine learning and AI problems, generative AI, history of modern causality research.",
                                                    "prerequisite_knowledge":  "Students are expected to have taken at least one class in statistics, probability theory, or machine learning.",
                                                    "assessment_structure":  "3 problem sets (worth 50%). Involvement in in-class discussions (15%). An essay or final project (35%).",
                                                    "relevance":  "The course is relevant to a number of disciplines that involves finding causality from observational data or estimating causal effects of one variable on another, including policy making, economics, biology, electronic engineering. and neuroscience. It is also highly relevant to machine learning and data science, given that causal modeling, which is becoming a new branch of machine, and traditional machine learning may benefit each other in various ways. Open problems discussed in this class are expected to lead to publishable projects.",
                                                    "learning_resources":  "No required textbook. Lecture notes and recommended readings available on Canvas.",
                                                    "extra_time_commitment":  null
                                            }
}