{
        "code":  "82-193",
        "name":  "Global Minorities: Stories of Diversity Resistance and Survivance",
        "short_name":  "GLBL MNRTS DIV RESIS",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This micro course examines gender and immigrantrefugee inequalities in Arab countries, namely in Lebanon, Morocco, and Egypt, and the intersections of inequalities with social expectations, socioeconomy, race, and immigration status. Case studies will focus on Palestinian, Syrian, and African refugees against the backdrop of political instabilities, geopolitics, national economic struggle, identity politics, and the historical stigmatization of blackness produced by the colonial racialization discourse. The course reflects on the impact of global civil rights movements on artistic expressions graffiti and music, for instance and the ways in which these movements resonated globally, creating solidarity and raising awareness of the commonalities of global structural inequalities. The course material will include filmdocumentaries, personal narratives, and literary and artist voices. Students will engage in virtual exchange dialogue with students in Arab countries and a filmmaker.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "To contextualize minority rights in their respective histories, from colonial to postindependence and contemporary times, shaping perspectives of the self and others, and creating a hybrid of disparity of powers. To explore and analyze how colonial to contemporary regimes limit and control discourses that include minority groups, and construct identities, shaping selfperceptions and relation to others. To identify foundational factors, like Arab social norms, laws, biased education, and media, and their impact in shaping divergent contemporary perspectives on minority rights. To engage and compare multidisciplinary perspectives through visual art, film, personal stories, literature, intercultural dialogue, interview with artists, and how these might inform discourses on minoritization and injustices. To increase students crosscultural literacy and equip them to become global citizens in todays interconnected world by bridging American and Arab students through virtual exchange and cultivating informed conversations about global social justice.",
                                                    "key_topics":  "minorities, cultures, and histories; issues of ethnicity, race and migration; human rights; social justice; Arabic studies; global studies; cultural resistance and resilience",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Students will be assessed on class participation; Discussion Lead; Discussion Forum on Canvas; Virtual Exchange with students in other Arab countries \u0026 one follow-up Report; Final Project.",
                                                    "relevance":  "DC: Perspectives on Justice and Injustice",
                                                    "learning_resources":  "Materials will be provided via Canvas.",
                                                    "extra_time_commitment":  "Opportunities for additional interaction during the weeks faculty are in Doha"
                                            }
}