{
        "code":  "82-111",
        "name":  "Elementary Arabic I",
        "short_name":  "ELEMENTARY ARABIC I",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course introduces learners to Modern Standard Arabic MSA in its written and spoken forms to achieve communicative competence at the elementary level in all language skills listening, speaking, reading, and writing. To this end the course follows a proficiencyoriented approach to language teaching. In addition to MSA, the course introduces students to one of the popular spoken dialects in the Arab world such as Egyptian, Levantine, or Moroccan depending upon the instructors backgroundexpertise. Students will also study various cultural aspects of the Arab world through written, audiovisual and onlinebased materials.  Students with prior knowledge of Arabic must take the placement exam.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "To develop contextuallyappropriate, interpersonal communication skills in both written and spoken Arabic, develop reading and listening skills through the use of media, understand fundamental grammar, acquire a wide range of vocabulary, and gain a basic understanding of the diversity of Arab culture.",
                                                    "key_topics":  "Develop contextually appropriate interpersonal communication skills in both written and spoken French, develop reading and listening skills through the use of various media, understand fundamental grammar, acquire vocabulary, and gain a basic understanding of Arabic.",
                                                    "prerequisite_knowledge":  "No prerequisite although taking the placement test is required for anyone with prior knowledge of the language.",
                                                    "assessment_structure":  "Attendance and participation, homework, conversation meetings, presentations in Modern Standard Arabic and in dialect, midterm and final exam.",
                                                    "relevance":  "This course offers Modern Standard Arabic (MSA) for reading, writing, listening, and speaking skills, with minor focus on learning the Egyptian dialect for listening and speaking skills.",
                                                    "learning_resources":  "Textbook that includes audio clips and short videos.",
                                                    "extra_time_commitment":  null
                                            }
}