{
        "code":  "82-119",
        "name":  "Arabic Calligraphy Culture \u0026 Skills",
        "short_name":  "ARABIC CALL CLTR SK",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course introduces its participants to historical and cultural contexts and various techniques used to produce Arabic calligraphy works.  No previous knowledge of the Arabic script or language is necessary.  At the end of the course, participants will demonstrate familiarity and comfort with key movements in the history and art of Arabic calligraphy, and read simple alphabet constructions or words in a variety of styles.  Participants will apply proper techniques to producing calligraphy in two of the most commonly used styles, Naskh and Riqah, as well as experiment with some modern script styles. The class will use lecture discussions, audiovisual media, projects, guest speakers, and field trips as occasions arise.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Analyze and critique calligraphy art samples in terms of elements of style, purpose, and cultural impact.Critically assess Arabic calligraphy and Islamic art examples based on aesthetic characteristics, cultural relevance, intended message, andor impact on its audience.Place Arabic calligraphy works in the context of the disciplines cultural history, genre, impact, or reception to demonstrate a broader understanding of its artistic relevance.Use learned techniques to create an example of Arabic calligraphy that adheres to the standards of the discipline and successfully defends the work.",
                                                    "key_topics":  "(see course description)",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Weekly Reflections / Discussions, Weekly Work Samples, Calligraphy Assignments, Presentations, Final Calligraphy Project (with drafts) \u0026 Related Description",
                                                    "relevance":  "DC GenEd: Disciplinary Perspectives: The Arts\n\nFor students who prefer to explore before they commit to learning Arabic, this course is an excellent opportunity to do just that. The course introduces the writing system in an artistic context that allows for the discovery of cultural connections. Senior students may not have had the opportunity to learn much about Arabic or Arab culture but will find the focus on artistic expressions of Arabic a welcome ending to their time at Carnegie Mellon. The course will help those enrolled, including our cultural heritage students, see the Arabic alphabet and Arabic culture from a different perspective. This course is an opportunity to see Arabic in a broader context and from a rarely explored perspective: Visual Expression.",
                                                    "learning_resources":  "Students need to purchase calligraphy materials that cost about $40 in total.\nStudents use chapters of textbooks, a collection of articles, videos, VR site visits, and manuscript collections in print and online, all provided via Canvas.",
                                                    "extra_time_commitment":  "Extra credit is available for viewing and critiquing Arabic and Islamic, depending on what is available in the community that semester."
                                            }
}