{
        "code":  "82-104",
        "name":  "Elementary French II Online",
        "short_name":  "ELEM FRNCH II ONLINE",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "(82-103 [] at least D) or (82-101 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is designed for students who need a more flexible approach to language learning than that offered in a standard classroom course. Students will learn more useful and complex expressions and sentence structures necessary for use in everyday life. Students will continue building their skills in listening, speaking, reading, and writing for everyday communication. Additionally, course materials and assignments are designed to improve students understanding of French and francophone cultures and societies. Materials are webbased with extensive use of Internet technologies for listening, reading, and communication. During regular semesters, this course is offered in a hybrid mode requiring one 80minute class per week in addition to weekly 20minute individual meetings with the instructor or a peer speaking  assistant. There is a materials fee for taking this course which is paid by credit card on first login to the course website. A student with prior experience in French must take the placement exam.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "To communicate, learn moderate control of grammar, vocabulary, and pronunciation to understand the importance of cultural information in language and pragmatics. They do so primarily through the use of isolated words, phrases, and sentences that have been encountered, memorized, and recalled. They will also be able to build their knowledge of French language and culture.",
                                                    "key_topics":  "Language, communication, pragmatic skill development in speaking, reading, writing, and listening, and cultural knowledge.",
                                                    "prerequisite_knowledge":  "82-101, 82-103, or placement score",
                                                    "assessment_structure":  "Class participation, homework, quizzes, unit/chapter exams, presentations, oral exams/meetings; meetings with a speaking or writing peer assistant. Final exams are course dependent.",
                                                    "relevance":  "This elementary level course extends students\u0027 abilities to communicate in the target language. Students can achieve up to Intermediate Low (ACTFL) or the A2 level (CEFR: European framework).",
                                                    "learning_resources":  "Depending on the course, textbooks, online resources, materials provided by instructors. For the online courses, all course material is provided through the Open Learning Initiative (oli.cmu.edu).",
                                                    "extra_time_commitment":  null
                                            }
}