{
        "code":  "82-179",
        "name":  "Multicultural Japan",
        "short_name":  "MULTICULTURAL JAPAN",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course explores multicultural experiences in Japan by examining the interactions between Japanese people on the one hand and two indigenous peoples the Ainu and the Okinawans, three immigrant communities Chinese, Korean, and Brazilian communities, and hafu or people of mixed heritage on the other. Contrary to the timehonored myth of being a monoethnic, monocultural, and monolingual society, Japan has been a multiethnic, multicultural, and multilingual nation for most of its history. Students will learn about the life experiences of those minority groups in Japan and about the ways their cultures have enriched Japanese culture. In the past three decades, due to an acceleration of globalization and a relaxed immigration policy, Japan has become more accepting of foreign workers from around the globe including the descendants of those Japanese who emigrated to South America more than a century ago. The number of foreign residents in Japan has more than doubled in the decades with Chinese and Koreans now accounting for less than half of them. In response, Japan has been promoting the idea of Tabunka Kyosei Shakai Multicultural Coexistence Society, where people of diverse cultural backgrounds can coexist harmoniously. Key topics of the course include globalization, recent immigration policy changes, various immigrant groups, multiculturalism, Japanese colonialism, and Japanese diaspora. The course uses video clips, newspaper articles, and other reading materials to understand a multiculturaltranscultural Japan. Students will have opportunities to compare Japan and their own country and to reflect on the cultural diversity of their own society.  The course is taught in English with no knowledge of Japanese assumed there are no prerequisites.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Examine how cultural contexts, including recognition of our identities and possible biases, impact our worldviews. 2. Evaluate how worldviews influence the interpretation of historical and contemporary events, and the perception of cultures and communities. 3. Analyze the role of cultural norms and institutions in creating and perpetuating structural inequalities and discriminatory attitudes.",
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "The course assignments will invite collaboration and learning from all students in the class, and methods will be accessible to different learning abilities and preferences. Examples of these assignments include: daily preparedness and participation in class activities; participation and discussion both in-class and in an on-line discussion forum; nightly/weekly reading and HW with questions; independent and collaborative research and writing assignments; pair/group work; oral presentations/final project presentations; a creative and/or research-oriented final project.",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Reflecting Dietrich GenEd after Fall 2021: Foundations - Intercultural and Global Inquiry",
                                                    "learning_resources":  "Materials will be provided by the instructor. Books may be required as well.",
                                                    "extra_time_commitment":  null
                                            }
}