{
        "code":  "82-272",
        "name":  "Intermediate Japanese II",
        "short_name":  "INTERMED JAPANESE II",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "82-271 [] at least D"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Intermediate Japanese II is the second part of a twosemester course sequence 82271, 82272 and continues the shift in instructional focus, which started in Intermediate Japanese I, from learning to use Japanese in a culturally appropriate manner to using Japanese to learn Japanese culture. With a dual focus on developing communication skills and cultural analysis skills, the course takes an integrated approach in designing meaningful, goaloriented learning activities so that students can practice communication skills and cultural analysis skills simultaneously. In pairs and small groups, students will discuss various cultural topics of current relevance for Japan by drawing on authentic materials e.g., newspaper articles, comic strips, TV commercials, films as well as learner materials in the textbook and the course packet and by comparing Japanese culture and their own in regard to those topics. As part of the course work, students will also enjoy an opportunity to have a small group discussion on the topics of their term projects with Japanese residents in Pittsburgh as well as a oneonone discussion on the same topics with a speaking assistant.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of this course, students will be able tounderstand authentic Japanese materials e.g., newspaper articles, cartoons, films with the use of a dictionaryuse Japanese to exchange and present their ideas and thoughts in speech and writing at the intermediatehigh level, especially kanji words, and idiomatic expressionsbuild a solid foundation for studying the advanced level of Japanese.analyze Japanese language, culture, and society to explain Japanese worldviews in comparison with your own culture and societyEvaluate how the Japanese worldviews influence the interpretation of contemporary events and the perception of other cultures.Analyze the role of Japanese norms and institutions in creating and perpetuating discriminatory attitudes related to gender, minority status, etc.",
                                                    "key_topics":  "Units include college students and jobs, families and lifestyles, status of women in society, minority issues, teaching and learning Japanese language overseas, etc.",
                                                    "prerequisite_knowledge":  "Knowledge covered in Elementary Japanese (82-171 and 82-172) and Intermediate Japanese I (82-271), placement test, or permission of the instructor.",
                                                    "assessment_structure":  "Class participation, unit compositions and other types of homework, quizzes (review, vocabulary, kanji [Chinese character], and grammar), two conversation sessions with speaking assistants, conversation session with Japanese guests, two performance (small group discussion) tests, two unit tests, project (presentation and essay).",
                                                    "relevance":  "DC: Intercultural \u0026 Global Inquiry\n\nThis course is relevant to students who want to further develop from 82-271 their cultural and cross-cultural analysis skills and communicative ability. They can achieve up to Intermediate High (ACTFL) or the B1.2 level (CEFR). It provides more opportunities to create with the language in cultural and cross-cultural analysis. It contributes to such goals of the Department of Modern Languages as Communication and Collaboration, Critical Thinking and Problem Solving, Innovation and Creativity through Interdisciplinary, Cross-Cultural Skills, and Content and Cultural Knowledge.",
                                                    "learning_resources":  "Course packet, textbooks, CDs, DVDs, materials on Canvas provided by instructors, student speaking assistants, Japanese guests",
                                                    "extra_time_commitment":  null
                                            }
}