{
        "code":  "82-239",
        "name":  "Crazy Linguistically Rich Asian Languages",
        "short_name":  "CRZY LING RCH ASN LN",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "For many monolingual Americans, English is the only language they have thought in, spoken, and tried to understand. Languages vary considerably and understanding how and why languages differ and what this means for communication, society, and culture are important steps in creating more global and intercultural citizens. The languages spoken in China, Japan, and Korea and more broadly, East Asia differ from English in a number of striking ways.  In this course, students will gain an understanding of the sound systems, morphosyntax, lexicon, and writing systems of various East Asian languages. Students will also learn how these neighboring languages and cultures have interacted and changed over time.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course, students will be able toDiscuss how ones own experiences are shaped by language.Explain that there are multiple worldviews that are all, in part, shaped by linguistic characteristics.Appreciate and respect the diversity of languages and cultures throughout Asia.Analyze and critique social and linguistic norms from a global perspective",
                                                    "key_topics":  "China, Japan, Linguistics, Chinese and Japanese writing systems, dialects and standardizations, language diversity, language and cognition",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Students will be evaluated on written reflections on the readings/videos; in-class presentations and discussions; three team projects involving design and collection of preliminary data; a short individual final paper.",
                                                    "relevance":  "DC GenEd: Intercultural and Global Inquiry\n\nIt is hoped that the knowledge acquired in this course will result in a better understanding of languages in general. This knowledge will be useful for language learning and application. At the end of the course, students should be able to discuss basic linguistic principles and theories and apply them to any language while effectively comparing and contrasting English to other languages. Moreover, students should be able to discuss more advanced linguistic concepts as they apply to various East Asian languages.",
                                                    "learning_resources":  "Everything is provided via Canvas, including journal/handbook articles, websites, online videos, canvas discussion board.",
                                                    "extra_time_commitment":  null
                                            }
}