{
        "code":  "82-278",
        "name":  "Japanese Film and Literature: The Art of Storytelling",
        "short_name":  "JAPANESE FLM LIT",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The course covers modern Japanese literature from 1868 to the present and postwar Japanese film from 1945 to the present. The modern film and literature have inherited unique premodern characteristics such as an openended plot without any closure, a nonlinear as well as linear way of storytelling, and a preference of atmosphere and beauty over a structured plot. On the other hand, partly owing to the Western influences, they have seen innovations in the art of storytelling e.g., contextualization of modern self in an openended story, filming techniques.   The course focuses on the artistic media e.g., language, sound, color, film techniques of each film and literary work and their interactions with the plot and the historical and social contexts of each work.  It also explores how the art of storytelling is in tandem with the vicissitudes of human condition as illustrated in Japans variety of films and literature in the twentieth and twentyfirst century. Analyses of each storytelling not only reveal cultural dynamics behind Japanese modernity, but also invite students to find new insights into Japanese culture and their ways to perceive our globalized world.   What kind of cultural exchanges took place between modern Japan and the West How are Japans traditional values transformed in the face of modern technicalization and industrialization, compared to the modernization of other countries And, in turn, what kind of impact has modern Japanese culture had on todays world Tackling these questions among others, the course also extends to such issues as the legacy of traditional Japanese culture, the modern Emperor system, the World War II experiences, emerging voices of minorities and the popular culture e.g., anime and subculture.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://drive.google.com/file/d/1RU2iXs7Vyc-6F-HRozPu7_YdV7oYuOGn/view",
        "custom_fields":  {
                                                    "goals":  "This course seeks toengage students with the craft of storytelling that is made possible in the intersection of the artistic media, the plot, and the historical and social contextsequip students with the knowledge of the little c culture i.e., features of everyday life by focusing on the concept of human condition of Japan andhelp students develop a range of skills for learning culture to become an effective culture learner.Students will be able to 1 evaluate the development of modern Japanese film and literature after 1868 covered by the chosen topic, 2 identify the socialhistorical and crosscultural conditions for the production of modern Japanese film and literature, 3 gather and analyze evidence by using the interpretive methods and generate a substantive argument with the content, structure, and format appropriate to the study of Japanese film and literature, and 4 communicate insightful interpretations of the artistic media, plot, and historical and social contexts of Japanese film and literature as appropriate to the academic context of the literary and cultural studies.",
                                                    "key_topics":  "Modern Japanese literature (1868-present) and film (1945-present), objective and subjective cultural interpretations, cultural and cross-cultural analysis, modernization, hope and truth in the aftermath of World War II, modern self, women in the shadow of modernity, challenge of inter-generational relationships in postwar Japan, Taisho culture, Japanese B-movie, Japanese new wave, aestheticizing politics, A-bomb literature, Christian literature, Japan\u0027s Christian Century (1550-1650), Japanese Postmodernism, globalization, changing concept of family",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Class participation, short responses to assigned short stories, novels, and films, two short essays with cultural interpretation, work/theme presentation, project (presentation and essay)",
                                                    "relevance":  "Dietrich GenEd Prior to Fall 2021: Reflecting\nDietrich GenEd After Fall 2021: The Arts\n\nThis course is relevant to students who are interested in modern Japanese film and literature and in understanding modern Japan and Japanese culture through cultural interpretation of them. Students have ample opportunities to produce their own cultural interpretation of modern short stories, novels, and films by means of cultural and cross-cultural analysis. It contributes to such goals of the Department of Modern Languages as Collaboration, Critical Thinking and Problem Solving, Innovation and Creativity through Interdisciplinarity, Cross-Cultural Skills, and Content and Cultural Knowledge.",
                                                    "learning_resources":  "Novels, reading materials on Canvas, video clips on the web, Carnegie Mellon film library, Kanopy streaming service",
                                                    "extra_time_commitment":  null
                                            }
}