{
        "code":  "82-215",
        "name":  "Minorities in the Middle East and North Africa",
        "short_name":  "MNORTS MDL EAST AFRI",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In todays society that explores Diversity, Equity, and Inclusion DEI, one ought to ponder the challenges that Arab societies might have and the progress made to celebrate and achieve DEI among its minority groups. Some of the questions that this course addresses are whether a minority in Arab societies is defined by number or status the autocratic governments use of identity politics to serve their own interests the role of education, social norms, and media in approaching issues of skin colors and minorities rights and the historical changes that have shaped citizenship and belonging. This course aims to enrich students understanding of the diversity of minority groups of other religions Muslims, Christians, Jews, sects Sunni and Shia, ethnicities Copts, Nubians, Kurds, Palestinians, LGBTQ, and women. It employs several elements such as the impact of colonialism, PanArabism, socioeconomy, and cultural norms in order to help students contextualize the status of minority groups through readings, filmsdocumentaries, music, and data collected via surveys and virtual sessions with students in Arab countries.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "To challenge stereotypes, appreciate the diversity, and foster a better understanding of the social reality of Arab societies. To understand the complexity of using identity politics on shaping the status of minority groups and their sense of citizenship and belonging. To foster critical thinking when analyzing films, documentaries, and readings, and contextualize them in their short and long term historical, social, and cultural contexts.To increase students crosscultural literacy and intercultural competence and equip them to become global citizens in todays interconnected world by bridging American and Arab cultures through virtual meetings with Arab students in the SWANA.To analyze collected data from past and current survey questions in order to trace the intellectual development of Arab societies and their attitude towards minority issues.",
                                                    "key_topics":  "Orientalism and the Western perspective of the Arab World - Blackness - African and Arab refugees - regime use of identity politics - ethnic, religious, sectarian minorities - sexual and gender issues.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Participation, online discussion forums, one short paper on films and readings, one short paper on novel, one report on virtual exchanges, and a final group project",
                                                    "relevance":  "DC: Perspectives in Justice and Injustice\n\nConsider why certain perceptions of minority groups and their identity issues were formed, in light of their socio-economic, cultural, and/or political milieu, and infer ways to improve the understanding of those issues through multi-faceted comparisons in order to appreciate those challenges in their respective societies.",
                                                    "learning_resources":  "Most resources are provided via Canvas, and students will need to purchase one inexpensive novel and occasionally rent a film online",
                                                    "extra_time_commitment":  null
                                            }
}