{
        "code":  "82-275",
        "name":  "Queer Representations in Contemporary Literature and Culture from Japan",
        "short_name":  "QUEER REP CNTMP CLTR",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will survey queerness in contemporary Japan from the 1980s to the present. Though literature will be the primary focus of this course, we will also look at material from a variety of media including cinema, poetry, manga, and television. The goal is to look at how queerness has been depicted in recent years by a variety of authors and creators, whether or not they happen to be queer themselves. The course will be divided into four large units consisting of approximately four weeks each Unit One  A Brief Historical Survey Unit Two  Japanese Literature as PreAIDSPostAIDS Unit Three  Queerness on the Border and On the Borders of Queerness Unit Four  Queerness in Film, Poetry, and Manga.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  "Defining \"gay studies\"; defining \"queer studies\"; defining AIDS literature; the relevancy and application of queer theory in/on Japan; representations of non-normative sexuality in modern and contemporary Japan; understanding those representations within the larger historical context(s) of sexuality in Japanese history; understanding how authors and creators express queerness in contemporary Japan; major trends in (global and local) applications of queer theory",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Class participation: 20% // Reading quizzes: 30% // Midterm exam: 20% // Final project: 30%",
                                                    "relevance":  "At the department level, this is perhaps the first course examining any aspect of LGBTQ history and culture from/in Japan, and perhaps East Asia. This course is also only a handful offered across the country (and indeed globally). More broadly, students taking the course will be well-positioned to discuss and engage in contemporary discussions surrounding (1) queerness and queer theory in Japan and (2) the very applicability and validity of said theory to a non-European/American cultural context. It also positions students to engage in a variety of dialogues across campus ¿ with English, Fine Arts, etc., where questions of queerness are regularly debated and discussed.",
                                                    "learning_resources":  "Instructor will provide relevant materials.",
                                                    "extra_time_commitment":  "Possible required attendance for applicable lectures or relevant, local exhibits"
                                            }
}