{
        "code":  "82-212",
        "name":  "Intermediate Arabic II",
        "short_name":  "INTRMDT ARABIC II",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "82-211 [] at least D"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course follows Intermediate Arabic I. It continues to build students communicative competence at the Intermediate MidHigh level in Modern Standard Arabic in all four skills listening, reading, speaking, and writing following a proficiencyoriented teaching approach. The course also continues to 1 integrate a spoken dialect to enrich students background in oral communication 2 educate students about various aspects of Arab culture through written and audiovisual materials and 3 engage in conversation with native speakers through the Natakallam program, virtual sessions, and guest speakers from City of Asylum and other institutions, in order to build their cultural literacy.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "To build your communicative competence at the intermediate level in Modern Standard Arabic in all four skills Listening, Reading, Speaking and Writing following a Proficiencyoriented teaching approach.To introduce students to the Arabic spoken in Egypt andor the Levant region as appropriate.To examine cultural differences between the US and the Arab World on the topics of immigrant communities, role of the media, especially during upheavals, freedom of expression and its limitations, and religious practices in the Arab world.To evaluate the US and world media representation of Arab and immigrant communities, the political atmosphere that led them to immigrate, the social issues they face, and the role of religion in everyday life and governance.To contextualize these topics in their historical and social backgrounds to analyze the structural inequalities and discriminatory attitudes to appreciate the cultural, social, and political realities of Arab societies.To identify the ways in which linguistic features of Arabic reflect familial and gender relations, religious values that dictate social norms, as well as cultural beliefs.",
                                                    "key_topics":  "Communication and connection - Immigration - Religious and cultural diversity and practices - Media and freedom of expression.",
                                                    "prerequisite_knowledge":  "82-211, placement, or permission of the instructor",
                                                    "assessment_structure":  "Class participation, conversation sessions, homework, quizzes, short essays, presentations and skits, mid and final exams.",
                                                    "relevance":  "Dietrich GenEd Prior to Fall 2021: Communicating\nDietrich GenEd After Fall 2021: Intercultural and Global Inquiry\n\nThis course is relevant to students who want to continue learning Arabic for the 4th semester to keep developing their abilities to communicate in speaking and writing. The course contributes to such goals of the Department of Modern Languages as Communication, Collaboration, and Cultural Knowledge.\n\nStudents will be able to communicate in everyday topics in a culturally appropriate way. They do so primarily through creating with language at the paragraph level. They will also be able to build their knowledge of Arabic language and culture. Students can achieve up to Intermediate-Low level (ACTFL).",
                                                    "learning_resources":  "Textbook (same as Intermediate I), course packet, dialogue videos, materials on Quizlet and Canvas provided by instructors, speaking with native speakers from the international NATAKALLAM program, student speaking assistants, and other materials online.",
                                                    "extra_time_commitment":  "Natakallam conversation sessions are scheduled outside of class hours (total about 5 hours per semester)."
                                            }
}