{
        "code":  "82-285",
        "name":  "Podcasting: Language and Culture Through Storytelling",
        "short_name":  "PDCTG LNG CLTR STR",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Do you love stories Stories told on the radio have always had significant power. For example, the 1938 War of the Worlds broadcast by Orson Welles was so effective that it panicked the entire United States. Today, podcasts such as Serial, This American Life, and The Moth have the same power to tell stories and provide audiences with rich, intimate and immersive audio experiences while often supporting diversity and giving voice to minorities and those underrepresented in mainstream media. Owing its rising popularity to the ease and accessibility of production and distribution, there has never been a better time to create and tell stories in audio. In this course students will take on the role of podcast producers, learning while creating a series of podcasts that explore linguistic and cultural landscapes with the goals of educating and entertaining. Possible audio resources include field interviews with native speakers in their own language, allowing student producers to document informants personal histories and aspects of their life related to culture, multilingualism, or political, social or environmental issues. Students will blend studio recordings with interviews andor suitable found recordings, music, and sound. Coursework will include skill development on audio recording and podcasting, production management, creative thinking, materials sourcing, and giving and receiving constructive feedback from classmates and varied audiences on team and individual projects. The course will be offered in English.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the semester, you should be able toReflect on your own and others perspectives in order to represent diverse and minoritized voices often underrepresented in mainstream mediaApply cultural competence, cultural humility, and other cultural concepts to reflect on personal identities and related biasesUse concepts of intercultural competence and communication to open a dialogue with people of different cultures and languages to tell their storiesAnalyze the effectiveness of audio and sound to tell stories, with particular attention to the ways language and culture are portrayed and interconnected.Apply technical tools while working professionally in a team to create audio podcasts",
                                                    "key_topics":  "Podcasting, storytelling, and cultural competence",
                                                    "prerequisite_knowledge":  "There are no prerequisites.",
                                                    "assessment_structure":  "Weekly blog entries \u0026 peer responses, three group podcast episodes, mid-term and final self-assessments, individual podcast pitch, attendance and participation",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Creating\nDietrich GenEd after Fall 2021: The Arts",
                                                    "learning_resources":  "All course materials are open access and linked to Canvas, equipment is available for use on campus, and the blog platform is free",
                                                    "extra_time_commitment":  "None, though students are occasionally invited to live events (storytelling / podcasting)"
                                            }
}