{
        "code":  "82-299",
        "name":  "Global Minorities: Stories of Diversity, Resistance and Survivance",
        "short_name":  "GBL MNRTS DIV RES",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course studies the differences and intersections of the experiences of minority peoples across the globe, through case studies of three geographic contexts contemporary Europe, North America, and the Middle East. The first section of the course examines the historical development, criticism and debates of multiculturalism and ethnic diversity in post World War II Europe, through treatments of these themes in contemporary film and other media. The second case study briefly introduces the history of Native Americans in the United States, then hones in on recent cultural critiques, legal challenges, and political movements mounted by Indigenous communities, as they confront the legacies of settler colonialism. The third unit examines gender and immigrantrefugee inequalities in Arab countries, exploring issues of freedom, labor, and citizenship, examining social norms, the legacy of colonialism, and postindependence political instabilities to explore systematic inequality and injustice leading to discrimination based on gender, race, socio economy, and geopolitics. The course uses cultural studies frameworks to examine how perceptions of minority identities are constructed and challenged through cultural products, such as film, literature, and mass media, created about and by the minority cultures studied. The goal is to develop a critical vocabulary to talk about perspectives on justice and injustice in a variety of geographic, political, and cultural contexts.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "To evaluate the differences and intersectionality of the experiences of marginalized groups, explore how perceptions of minority identities are constructed and challenged, and contextualize them in their short and longterm historical, social, and cultural contexts.To examine the role of institutions of power in shaping minority rights. To critically analyze contemporary debates as well as multidisciplinary perspectives on individual and collective responsibility to address systematic inequality and injustice.To foster the ability to critically analyze films and texts.To cultivate informed conversations about global social justice and foster an appreciation for diversity. To increase students crosscultural literacy and equip them to become global citizens in todays interconnected world.",
                                                    "key_topics":  "global minority peoples, cultures, and histories; issues of ethnicity, race and migration; settler and non-settler colonialism; human rights; cultural resistance and resilience",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Students will be assessed on class participation; 2-3 brief film or literary analyses; brief discussion board assignments; and synthesis assignments in the form of oral presentations or short essays. The final project will reflect on all 3 micros.",
                                                    "relevance":  "DC: Equity and Justice\n\nThis course will be of particular relevance to students interested in human rights issues, Hispanic Studies, Global Studies, and Film Studies.\n\nFor students with advanced proficiency in Spanish, coursework (writing, some reading, film viewing) may be done in Spanish for additional practice and possibly elective credit towards the Hispanic Studies major or minor.",
                                                    "learning_resources":  "Materials will be provided via Canvas.",
                                                    "extra_time_commitment":  "Opportunities for additional interaction during the weeks faculty are in Doha"
                                            }
}