{
        "code":  "82-262",
        "name":  "Intermediate Italian II",
        "short_name":  "INTERMED ITALIAN II",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "82-261 [] at least D"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "At the intermediate level, students will continue to improve listening, speaking, reading and writing skills with the goal of becoming more proficient in daily and extended communication needs. In addition to an ongoing review of basic grammar, a greater variety of grammar, expressions and complicated sentence structures will be taught so that students can carry on more sophisticated conversations on various topics. Inclass activities and homework using authentic texts related to the broad spectrum of Italian culture will be used to integrate language learning with content and culture. Regular homework, quizzes, tests, presentations, essays, and class participation are mandatory. A student with prior experience in Italian must take the placement exam.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students continue to progress to a higher level of communicative and cultural competence from the Intermediate I level.Students will be able to ...Expand their capability to comprehend and produce Italian with appropriate grammar, vocabulary, expression in cultural context.Discuss current and relative themes in the multinational life of Italy today.Define how there is an emerging society impacted by individuals of other cultures settling in Italy.Evaluate and describe global realities that are filtering into Italian society.Assess and enumerate the positive attributes of new immigration patterns on the Italian experience.Describe the history, social customs and traditions of the nation and the variants that have developed in regions through reading, discussion and research.",
                                                    "key_topics":  "Discovering cultural traditions and influences reflected in the current themes relevant to the multifaceted reality of Italian life.",
                                                    "prerequisite_knowledge":  "Intermediate Italian 1 or permission of the instructor.",
                                                    "assessment_structure":  "Assignments, presentations, essays, exams with written and oral components.",
                                                    "relevance":  "Dietrich GenEd Prior to Fall 2021: Communicating\nDietrich GenEd After Fall 2021: Intercultural and Global Inquiry\n\nFurther develop communicative competence in all skills while increasing cultural awareness.",
                                                    "learning_resources":  "The textbook (available in both hard copy and e-book), resources available on Canvas, videos and movie clips as well as a short fictional book on CD.",
                                                    "extra_time_commitment":  null
                                            }
}