{
        "code":  "82-255",
        "name":  "Beyond the Korean Wave: A Critical Exploration of K-pop",
        "short_name":  "BYND KRN WAVE KPOP",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Over the last thirty years, Kpop has gained global exposure exponentially and has been quickly incorporated into the Korean Wave Hallyu phenomenon, along with other elements of Korean popular culture TV shows, movies, beauty products, and more. BUT STILL, Kpop is either introduced in the mainstream media as a new phenomenon or as a dark industry while being assimilated into other Korean popular culture elements that have very different audiences.Even though the discourse around the Korean Wave is essential to understand how Kpop gained global exposure, it does not tell you the whole story. To understand the multiple facets of Kpop, it is necessary to take some distance from the Korean Wave and consider Kpop as a single entity. On the other hand, by overfocusing on the global attractivity of Kpop, we tend to forget about the national context, when it is crucial to understand where Kpop originates.Informed by a production and a reception focus and using an interdisciplinary approach that combines Area studies, Ethnomusicology, and Gender Studies, this seminar does not aim at teaching you exactly what Kpop is. Instead, it provides you with the tools to define it in your own way. Students will learn how to express their critical thinking through both nonacademic and academic writing. It engages students in critical readings of written and audiovisual texts, as well as allows them to practice writing as a recursive process of drafting and revision. Consider this seminar as a safe space where students use their interest whichever type of interest it could be in Kpop as a gateway to understanding its cultural conditions through engaging academic discussions.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course, students should be able to Reflect on their own background and experiences as a non Kpop fan and use thoseas a gateway to broader discussions. Analyze the existing scholarship on Kpop and sharpen critical thinking throughplayful assignments. Generate your own argument related to readings about Kpop, while taking part inlively academic discussions and playlist generation with their peers. Discover theoretical concepts from Area Studies, Ethnomusicology, and GenderStudies and apply them to write and reflect on a case study related to Kpop. Complete a cumulative project that strengthens academic skills for writing andother creative media to express their critical thinking.",
                                                    "key_topics":  "Area studies, Ethnomusicology, and Gender Studies",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Class Discussion, Weekly Playlist Curation, Take Home Midterm, Final Project (in 5 Cumulative Steps)",
                                                    "relevance":  "DC GenEd: Disciplinary Perspectives: The Arts",
                                                    "learning_resources":  "All learning resources are available via Canvas.",
                                                    "extra_time_commitment":  "Extra Credit for Attending K-pop Events and Submitting a Review"
                                            }
}