{
        "code":  "82-279",
        "name":  "Anime - Visual Interplay between Japan and the World",
        "short_name":  "ANIME INTPLY JPN WLD",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In contemporary Japanese culture, anime plays a vital role, unfolding a wide range of nonlinear as well as linear ways of storytelling with its distinct modes of visual representation, such as character designs and vibrant use of colors to reconstruct the environmentsocial reality, and complementing to other forms of culture e.g., literature, film, and art. This course explores Japanese animes appeal to the international viewers today, centering on culturalsocial analyses of animated works such as the fantastic of the Studio Ghibli production and Cyberpunks postapocalyptic worldview in consultation with the scholarship of anime as a global cultural phenomenon. Equally important are to locate the origin of Japanese animation, which is also to be investigated through analyses of the prewar and postwar works of animation in conjunction with related forms such as manga, or comic strips e.g., Osamu Tezukas works that was initially inspired by Disney and to discuss the potential of anime as an art form.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://drive.google.com/file/d/1RU2iXs7Vyc-6F-HRozPu7_YdV7oYuOGn/view",
        "custom_fields":  {
                                                    "goals":  "The course seeks toengage students with the craft of anime that is made possible in the intersection of the artistic media, the plot, and the historical and social contextequip students with the knowledge of the little c culture i.e., features of everyday life by focusing on the concept of human condition of Japan and help students develop a range of skills for learning culture to become an effective culture learner.With adequate inclass and outofclass study, students will be able toevaluate the development of Japanese anime after 1945 covered by the chosen topicidentify the socialhistorical and crosscultural conditions for the production of Japanese animegather and analyze evidence by using the interpretive methods and generate a substantive argument with the content, structure, and format appropriate to the study of Japanese anime andcommunicate insightful interpretations of the artistic media, plot, and historical and social contexts of Japanese anime as appropriate to the academic context of the media and cultural studies.",
                                                    "key_topics":  "Japanese Anime, 20th-21st century Japanese popular culture, Film theory and Criticism, Media and Cultural Studies. Cultural Icons: Studio Ghibli and Hayao Miyazaki/Cyberpunk and Akira, The Early Japanese Anime, The Origin of Modern Japanese Anime, The Sports Anime, Modern Japanese Anime, A New Generation of Japanese Anime, Japanese history, Nationalism, Pacifism, Glocalization (= Globalization/Localization), Science Fiction, Ecology.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Class participation, short responses to assigned short stories, novels, and films, two short essays with cultural interpretation, work/theme presentation, project (presentation and essay)",
                                                    "relevance":  "Dietrich GenEd Prior to Fall 2021: Reflecting\nDietrich GenEd After Fall 2021: The Arts\n\nThis course is relevant to students who are interested in Japanese anime and in understanding modern Japan and Japanese culture through cultural interpretation of Japanese anime. Students have ample opportunities to produce their own cultural interpretation of various types of animated works by means of cultural and cross-cultural analysis. It contributes to such goals of the Department of Modern Languages as Collaboration, Critical Thinking and Problem Solving, Innovation and Creativity through Interdisciplinarity, Cross-Cultural Skills, and Content and Cultural Knowledge.",
                                                    "learning_resources":  "Carnegie Mellon film library, MLRC, Canvas where reading materials,\nonline materials of critical works on anime are available.",
                                                    "extra_time_commitment":  null
                                            }
}