{
        "code":  "82-282",
        "name":  "Interpreting Global Texts \u0026 Cultures",
        "short_name":  "INTRP GLBL TXT CLTR",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Literature, film, music, art, theater, and other forms of humanistic artistic expressions, play an important role in society. Few moments in life are as moving as listening to the right song at the right time, and many of us can list films andor books that have shaped who we consider to be. Beyond the individual level, artistic expressions have also influenced revolutions, businesses, science, politics, and the list goes on and on. Yet, we often take culture and artistic expressions for granted. What is their role and value in society How can we interpret these cultural artifacts Is there a right or wrong interpretation These are some of the questions we will explore in this class.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://drive.google.com/file/d/1RU2iXs7Vyc-6F-HRozPu7_YdV7oYuOGn/view",
        "custom_fields":  {
                                                    "goals":  "At the end of the course, students should be able toInterpret primary sources, cultural artifacts, and artistic expressions as texts, and interpret texts as a system of signs, in order to equip the student with basic vocabulary used in Cultural StudiesExpose power relationships within a text and how they affect our interpretationIllustrate the role of historicizing a primary source in order to defend a spoken or written interpretation or argumentIdentify how thinkers and cultural practices from around the world challenged or contributed to the discipline of Cultural StudiesUtilize a variety of strategies for active reading that could be transferred to future personal and professional contexts",
                                                    "key_topics":  "Students will be introduced to some fundamental questions and interpretive skills in the discipline of Cultural Studies, learn how to identify the systems of power at play in a cultural artifact, how to contextualize and write an interpretation, and about their role as readers and interpreters of text. Unique to this class is the focus on how cultural agents from around the world have challenged, contributed, and responded to the field we recognize as Cultural Studies.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Weekly readings, responses, written essays, class presentation",
                                                    "relevance":  "Dietrich GenEd Prior to Fall 2021: Reflecting\nDietrich GenEd after Fall 2021: Disciplinary Perspectives - Humanities\n\nThe set of critical skills exercised in analyzing, interpreting, contextualizing, expressing ideas in an organized and fluent manner, are skills that are transferable to multiple career paths where identifying and gauging problems, providing solutions, and thinking outside the box are essential.",
                                                    "learning_resources":  "Text, audiovisual artifacts, art, literary and non-literary texts, most of which are available on Canvas",
                                                    "extra_time_commitment":  "Possible visits to local museums if theme/topic fits the goals of the course"
                                            }
}