{
        "code":  "82-281",
        "name":  "Gender and Sexuality in the Spanish-speaking World",
        "short_name":  "CNTXL THINKING IN ML",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "SPRING 2023   SEC A Gender and Sexuality in the Spanishspeaking World In recent years, issues of gender and sexuality in the Spanishspeaking world have garnered much international attention  for example the niunamenos movement throughout Latin America, recent protests over restrictive abortion laws in the Dominican Republic, the rise of transgender rights movements in the Americas and Europe, femicide on the USMexico border and throughout the Northern Triangle of Central America. While these are more recent manifestations, gender and sexuality have always played a critical role in an understanding of the Spanishspeaking world. In this course, we will explore how gender, understood as a social construct, and sexuality are inextricably linked to economic and political structures, and importantly, how gender and sexuality intersect with race and class in the very diverse cultures of the Spanishspeaking world. The course is conducted in English but students with knowledge of Spanish will have an opportunity to use their language skills.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://drive.google.com/file/d/1RU2iXs7Vyc-6F-HRozPu7_YdV7oYuOGn/view",
        "custom_fields":  {
                                                    "goals":  "1. Ask fundamental questions who, what, where, when, why, and how to reflect on the world and our place in it.. 2. Select and usearchival records, media sources, literary texts, letters, journals, official documents, images, etc., to understand how world events affect us in different ways.3. Analyze world events from medium and longterm historical perspectives.4. Consider how ways of thinking developed and situate our own way of thinking in relation to world events, cultural traditions, and social and political institutions.",
                                                    "key_topics":  "Specific topics will vary by semester. Click the course URL to read more about each section.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "The course assignments will invite collaboration and learning from all students in the class, and methods will be accessible to different learning abilities and preferences. Examples of these assignments include: daily preparedness and participation in class activities; participation and discussion both in-class and in an on-line discussion forum; nightly/weekly reading and HW with questions; independent and collaborative research and writing assignments; pair/group work; oral presentations/final project presentations; a creative and/or research-oriented final project.",
                                                    "relevance":  "Dietrich GenEd Prior to Fall 2021: Reflecting\nDietrich GenEd After Fall 2021: Contextual Thinking",
                                                    "learning_resources":  "Materials will be provided by the instructor. Books may be required as well.",
                                                    "extra_time_commitment":  null
                                            }
}