{
        "code":  "82-235",
        "name":  "Fables, Legends and Stories from Ancient Chinese Civilization",
        "short_name":  "FBLS LGND STRS CIV",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(82-231 [] at least D) or (82-135 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "By reading, analyzing, and presenting on traditional fables, short stories, and articles on the lifestyle and social changes in China, this course encourages students to look into the historical development of ancient Chinese civilization and the complex relationship between traditional China and its modern counterpart. Activities related to a broad spectrum of Chinese literature, culture and society are organized to facilitate language learning, cultural analysis and crosscultural comparison. Topics of this course include, but are not limited to, the Chinese creation myth, famous historical events and figures, Chinese herb medicine, and Chinese wedding customs. In addition to expanding students knowledge of Chinese society and culture and the sociocultural influences on Chinese language, this course will also help students extend their Chinese vocabulary and improve Chinese reading and writing skills and proficiency. With the help of classroom discussion and debate, reading and writing assignments, and cultural presentations and projects, students are expected to develop longterm retention of Chinese language and indepth understanding of Chinese culture and society from a global perspective.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The specific objectives of the course are1. Students will expand their knowledge of traditional and modern Chinese society and culture through reading creation stories, traditional fables and tales, and short stories about Chinese historical figures. 2. Students will develop critical thinking skills through classroom discussions, debates and presentations that aim to help students look into Chinas past and present analytically and comparatively. 3. Students will learn to compare and analyze their own and others cultural practices, products and perspectives, while developing necessary language skills to articulate their discoveries and thoughts in Chinese with appropriate cultural and crosscultural sensitivity in relation to social, gender or cultural hierarchies. 4. Students will further develop their Chinese linguistic knowledge and skills, especially in reading and writing. 5. Students will learn to use more effective strategies and resources to assist their independent learning of the Chinese language and culture and develop longterm retention and control of the knowledge acquired.",
                                                    "key_topics":  "Extensive and extended reading in Chinese fables, legends and stories from ancient Chinese civilizations. Aim to develop critical thinking skills and global views from both historical and diverse aspects.",
                                                    "prerequisite_knowledge":  "82-135, 82-231, or instructor\u0027s permission",
                                                    "assessment_structure":  "10 in-class reading exercises and outside-of-class assignments; 3 essays; 1 reading test; 1 term project; classroom discussions and debates.",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Communicating\nDietrich GenEd after Fall 2021: Intercultural and Global Inquiry\n\nThrough this course, students will be able to use more effective strategies and resources to assist their independent learning of the Chinese language and culture. They will be able to develop long-term retention and control of the knowledge acquired.",
                                                    "learning_resources":  "All materials are available to students through Canvas.",
                                                    "extra_time_commitment":  "None, though there are opportunities to attend special events, colloquia, etc."
                                            }
}