{
        "code":  "82-294",
        "name":  "19th Century Russian Masterpieces",
        "short_name":  "19TH CENT RSSN MSTRP",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Russian literature of the 19th century was shaped by its engagement with the socalled accursed questionsaccursed for being urgent and inescapable but possibly unanswerable. What is the self What is the meaning of life and of death What is truth What is justice What does it mean to live a righteous life In Russia these existential quandaries fell within the purview not only of philosophers but also of the poets and prosewriters we will consider in this course. While the course roughly follows the chronology of the 19th century, it is structured around these accursed questions rather than by literary movement or genre. There are two reasons for this. First, Russias literary culture began to develop later than other traditions as a result, Russian authors of the 19th century were exposed to many different movements and often participated in several at once. Second, and relatedly, many authors worked across genres and in dialogue with philosophers, critics, novelists, and poets. They published in thick journals, composed of texts ranging from the literary to the journalistic to the academic. For these reasons, it is difficult to categorize these authors along stylistic or generic lines. As philosopher Nikolai Berdyaev observes, what united them was an abiding interest in the most profound existential questions. Students in this course will examine how an authors use of genre, affiliation with particular literary movements, and sociopolitical commitments inflected their treatment of the accursed questions. Students will become familiar with not only the cultural artifacts of this fertile century but also the circumstanceshistorical, cultural, institutionalin which these artifacts were created. They will also be encouraged to reflect on how these perennial accursed questions are articulated at present, and what that reveals about our own sociopolitical commitments and generic loyalties.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course students will be able to ... Consider how the fundamental questions, such as what is the self what is truth what is the good life, are articulated differently depending on the circumstanceshistorical, cultural, institutionalin which they arise. Describe some of the key works of the Russian literary tradition, draw connections between their authors concerns and related formal choices, and consider the social and cultural circumstances in which these works were produced. Identify and describe how literary movements evolve in response to what came before them and how authors work within but also push the boundaries of given forms. Formulate an argumentative essay that advances an original interpretation wellsupported by textual evidence. Reflect on personal ways of answering the accursed questions of 19th century Russian authors.",
                                                    "key_topics":  "19th Russian literature and culture, theory of the novel, examines works by Pushkin, Lermontov, Dostoevsky, Tolstoy, and Chekhov, among others.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Class Participation, Close Reading Exercises, Midterm Exam, Literary Trial, Final Exam",
                                                    "relevance":  "DC GenEd: Contextual Thinking\n\nRelevant to the study of Russian literature, culture, and history, the history of the novel, and study of world literature.",
                                                    "learning_resources":  "Students need to purchase / borrow library copies of novels for the course, with other resources provided on Canvas.",
                                                    "extra_time_commitment":  null
                                            }
}