{
        "code":  "82-270",
        "name":  "Technology in Japanese Culture and Society",
        "short_name":  "TECH JPNS CLTR SOCTY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course explores various ways technology interacts with Japanese culture and society. On the one hand, technology has greatly changed Japanese culture and society, but on the other hand, the actual use of technology in Japan has been significantly influenced by Japanese culture and society. As an illustrative example, the course takes up robotic technology and examines how it has been imagined in culture e.g., anime, manga and implemented to resolve social issues e.g., shrinking labor force by Japanese people. It seeks to show how cultural and social contexts dictate the way technology has been put to use to satisfy the material and other desires of people. This course is taught in English and has no prerequisites. No previous knowledge of Japanese language is required. This course can be taken as an elective course for Japanese majors and minors.  The course starts with a vision of society as demonstrated in anime featuring robots e.g., Astro Boy and Gigantor in the 1960s and in the Japanese governments robot initiative, Innovation 25, for robotizing Japanese society by 2025. In this vision, people and robots will share a deep emotional bond and live together harmoniously. Then, the course discusses various topics in the vision including a family with a robot, genders of robots, laws of robotics by Asimov and Tezuka governing humanrobot interactions, robot rights and human rights, cyborgableism disabilities should be overcome by using robotic technology, and a funeral or memorial rite for inoperative robots and a New Age Buddhism. Finally, it speculates on the extent to which the Japanese humanrobot cohabitation scenario has been realized and the extent to which the scenario remains a product of imagineering melding science and fantasy to create believable makebelieve worlds.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1 Examine how Japanese cultural values affect Japanese perception of technology.2 Frame and reframe fundamental questions about current social phenomena and concerns in Japan in order to interpret issues e.g., Innovation 25, institutions e.g., robot industry, and events e.g., robot funeral.3 Select and interpret materials, both primary e.g., anime, films, video clips, newspaper articles and secondary e.g., research articles, to enrich inquiry into current social phenomena and concerns in Japan.4 Analyze current social phenomena and concerns e.g., shrinking labor force in Japan by examining contributing historical factors in medium and longterm perspectives.5 Consider how ways of thinking regarding technology developed in Japan and situate your own analysis of social issues in relation to such traditions.6 Reflect on your own cultural values in comparison with those of Japanese people.2 Select and interpret materials, both primary e.g., anime, films, video clips, newspaper articles and secondary e.g., research articles, to enrich inquiry into current social phenomena and concerns in Japan.3 Analyze current social phenomena and concerns e.g., shrinking labor force in Japan by examining contributing historical factors in medium and longterm perspectives.4 Consider how ways of thinking regarding technology developed in Japan and situate your own analysis of social issues in relation to such traditions.5 Examine how Japanese cultural values affect Japanese perception of technology.6 Reflect on your own cultural values in comparison with those of Japanese people.",
                                                    "key_topics":  "Innovation 25, robot, family, gender, robot rights vs. human rights, cyber-ableism, uncanny valley, robot and Buddhism",
                                                    "prerequisite_knowledge":  "None, course is taught in English.",
                                                    "assessment_structure":  "Written reflections on the readings; in-class discussions; two cultural and social analysis assignments; one term project involving collection of primary data with a presentation and a final paper.",
                                                    "relevance":  "DC GenEd: Contextual Thinking\n\nThis course is relevant to anyone curious about how technology is perceived, developed, and used in Japanese culture and society. The course contributes to the goals of the Dept. of Modern Language to enhance knowledge and appreciation of the values, traditions, and cultural history of Japanese people; to gain intercultural understanding and to develop research, problem-solving, and critical thinking skills.",
                                                    "learning_resources":  "Freely available digital textbook, with everything else provided via Canvas, such as journal articles, news articles, websites, anime, and video clips.",
                                                    "extra_time_commitment":  null
                                            }
}