{
        "code":  "82-225",
        "name":  "Multiculturalism, Ethnic Diversity, and Debates about Them in Contemporary Europ",
        "short_name":  "MLTCLTR DIV DEB EURO",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will explore ethnic and cultural diversity in contemporary Europe, especially Germany. All of these countries have become increasingly diverse ethnically and culturally over the last few decades, and there have been significant debates about immigration and willingness or lack thereof to accept refugees from other parts of the world. Some have celebrated Europes increasing multiculturalism and diversity, whereas others have criticized it. The goal of the course is to look at both multiculturalism and diversity and also the critics of multiculturalism and diversity.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1. Examine how cultural contexts, including recognition of our identities and possible biases, impact our worldviews.2. Evaluate how worldviews influence the interpretation of historical and contemporary events, and the perception of cultures and communities.3. Analyze the role of cultural norms and institutions in creating and perpetuating structural inequalities and discriminatory attitudes. The goal of this course is to examine contemporary European debates about multiculturalism and ethnic diversity and thereby to gain insight into contemporary Europe and the way that definitions of European identity are undergoing change in an increasingly multicultural and multiethnic context. Concurrent goals are to expand and enhance facility in reading, writing, and talking about multiculturalism, ethnic diversity, and debates about those issues from a variety of viewpoints.",
                                                    "key_topics":  "multiculturalism, ethnic diversity, Europe, Germany, France, the United Kingdom, the refugee crisis, national identity, racism, xenophobia, right-wing movements",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "daily participation, four short papers, four brief film reactions, and one student presentation",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Reflecting\nDietrich GenEd after Fall 2021: Foundations - Intercultural and Global Inquiry",
                                                    "learning_resources":  "Materials will be provided by the instructor. Books may be required as well.",
                                                    "extra_time_commitment":  null
                                            }
}