{
        "code":  "82-297",
        "name":  "Russian and Soviet Science Fiction",
        "short_name":  "RSSN SVT SCI FCTN",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course resituates the science fiction genre so familiar to many of us in the novel setting of Russia and the former Soviet Union. The region has its own deep tradition of utopian and dystopian works, and we will utilize the welldocumented critical possibilities of the science fiction genre to explore some of the most pressing issues facing Russian, Soviet, and postSoviet society the relationship between the past and the future, tradition and innovation, technology and the natural world, and the individual and the state. Throughout the course, these insights will also be applied to our own prior knowledge of science fiction works to place our own particular culture and historical situation into greater context.   The relationships explored throughout the semester allow for a thorough exploration of the possibilities of the science fiction mode. The course covers artistic works spanning over a century, from the musings of a Tsaristera bureaucrat at the close of the 19th century to dystopian dramas directly inspired by the Chernobyl disaster.  This chronological breadth is accompanied by a diversity in form, style, and even medium. We will read epistolary novels and harrowing short stories, watch auteur cinema and slapstick comedies, and even have the opportunity to play video games produced by Russian and Ukrainian game studios. Lastly, the course seeks to always interrogate the varying positions held by the artists themselves their relationship to the Russian or Soviet regime, their attitudes towards modernization and revolution, etc. Underlining all of this will be an exploration of the science fiction genre as a whole how can a work be both realistic and fantastic What are the boundaries of science fiction, and how is fantasy separated or blurred with reality in a fictional world The course is conducted in English, but students will have the option to do work in Russian for three extra course units.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will explore and frame questions concerning the relationship between the individual and the state, tradition and innovation, technology and society, social progress and ideology, and the boundaries of fiction and the creation of imaginary worlds. Students will also acquire a toolkit to analyze and discuss works of art across media in literature, film, visual arts, and video games.Students will interpret a wide array of late 19th and 20th century literature, films, and video games from Russia and the postSoviet space. They will view and analyze nonartistic materialspropaganda posters, manifestos, design sketches, etc., to better understand the interaction between science fiction and everyday living in the USSR and modern Russia.Students will analyze issues, objects, and events from our own postSoviet and capitalist perspective as well as trace political and economic changes in Russia and the Soviet Union through their reflections in the aesthetic makeup of science fiction works.Students will consider the development of science fiction art from the Tsarist era to Putinand situate their own attitude towards the relationship between art, technology, ideology, and progress in relation to the period covered by the course.In addition, students will perform close readings of literary texts and formulate original, critical, and analytical responses to Russian novels and short stories, films, and video games, both written and oral.",
                                                    "key_topics":  "Dystopian Fiction and Totalitarianism, Post-Apocalyptic fiction, Video game and worldbuilding, Language, Science Fiction and Satire, Popular Culture and Children\u0027s Fiction",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Class participation, weekly reading responses, two papers, and final with mini-essays",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021:\nDietrich GenEd after Fall 2021: Contextual Thinking",
                                                    "learning_resources":  "All course resources are provided via Canvas.",
                                                    "extra_time_commitment":  null
                                            }
}