{
        "code":  "82-292",
        "name":  "Intermediate Russian II",
        "short_name":  "INT RUSSIAN II",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "82-291 [] at least D"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In this intermediate course, students will review the basics of Russian grammar, develop listening comprehension, and expand their vocabularies and recognize the conversational, artistic, and academic usage of Russian. They will learn to relate simple narratives on familiar topics, express their opinions, ask questions, and speak about hypothetical situations. Students will be able to grasp the main ideas of newspaper articles and hold straightforward conversations with native speakers.  In addition to working with the course textbook, workbook, and website, students will conduct a semesterlong research project simulating the experience of living in a nonRussian region or country where Russian is frequently spoken. Students will compare and contrast everyday life in the Russianspeaking world with their own worldview, with special attention given to the cultural and ethnic diversity of the global Russophone community.  Students will also utilize Russianlanguage texts and media to explore the historical formation of the Russian Empire and the Soviet Union, as well as the relationships between former Soviet republics and the wider world today. Students will also consider the historical development of the Russian language and the influence of other cultures and languages in producing the modern language we speak today.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course, with reasonable effort, students will be able to significantly improve vocabulary and grammar skills freely comprehend conversations and stories on everyday topics write intermediate level texts such as descriptions, narrations, letters identify and utilize different levels and registers of communication in Russian compare and contrast everyday life in Russia with their own experience, as well as appreciate the diversity of cultures within the greater Russianspeaking community comprehend and offer their own thoughts on the historical and contemporary legacy of the multicultural Russianspeaking world consider how existing cultural norms and institutions in modern Russian society create and perpetuate inequalities and discriminatory attitudes.",
                                                    "key_topics":  "Continued work in language, communication, pragmatic skill development in speaking, reading, writing, and listening, and the history and culture of the diverse Russian-speaking world.",
                                                    "prerequisite_knowledge":  "82-291, placement test, or permission of instructor",
                                                    "assessment_structure":  "Homework, unit/chapter exams, essay, presentations, oral conversations, ex-USSR blog, and final exam.",
                                                    "relevance":  "This intermediate level course builds on and extends students\u0027 abilities to communicate in Russian. Students can achieve up to Dietrich GenEd Prior to Fall 2021: Communicating\nDietrich GenEd After Fall 2021: Intercultural and Global Inquiry\n\nThis intermediate level course builds on and extends students\u0027 abilities to communicate in Russian. Students can achieve up to Intermediate High or the B1 level (European framework). Students will also gain an understanding of the lasting legacy of the USSR and its breakup, as well as the state of inter-ethnic relations in Russia, Eastern Europe, and Central Asia today.",
                                                    "learning_resources":  "Textbook, Canvas, additional materials will be distributed in class and on the course website.",
                                                    "extra_time_commitment":  "Russian Speaking Olympiada (one Saturday in April)"
                                            }
}