{
        "code":  "82-267",
        "name":  "Beyond the Mafia and Michelangelo",
        "short_name":  "BYND MAFIA MCHNGLO",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Beyond the Mafia and Michelangelo Italy Unmasked Eclipsed by the consumer obsessions of tourists and the most wellknown figures of Italian history, the uniqueness of Italy, offering distinct cultures in the north, central, and south, is rarely understood by outsiders. In this course, students will discover an Italy rich with cultural variants, radically diverse histories, customs, cults, and superstitions, in addition to physical expressions of culture in cooking and clothing, art and architecture. Students will identify and critically analyze diversity within the peninsula and its islands, and expand their awareness and understanding of the role of culture in behavior. Film, documentaries, and readings from epistolary and literary sources will help reveal a more profound Italy, for example, the science of Dulbecco the Human Genome, the architecture of Trulli conical houses, the religious importance of Pitigliano Little Jerusalem, and the immigration problems of San Marino. Coursework will include class participation, readings, film viewings, and writing. Final projects will be based on interviews and oral histories with the ItaloAmerican community in Bloomfield Pittsburgh, leading to critical comparisons of that population with Italians in Italy. This course is offered in English.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Identify key elements of norther, central, southern Italy, analyze peninsular diversity and culture roles",
                                                    "key_topics":  "Unique hidden treasures of Italy, cultural identity, art, geography",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Worksheets, class discussion,j presentation, journaling",
                                                    "relevance":  "Italian history, geography, regionalism,",
                                                    "learning_resources":  "Travel logs, epistolary, saint writings, film provided by the instructor",
                                                    "extra_time_commitment":  null
                                            }
}