{
        "code":  "82-273",
        "name":  "Introduction to Japanese Language and Culture",
        "short_name":  "INTRO JAP LANG/CULT",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is an introduction to modern Japanese culture, examining Japanese society, its socialization processes, and the role of language in expressing, transmitting and maintaining social structure and cultural values. Learning key concepts to better understand Japanese culture and society from the post war to presentday Japan, students develop a range of skills to analyze cultural perspectives from observable behaviors and social phenomena. Students explore cultural diversity in relation to the traditional view of Japans homogeneity.This course is taught in English and is intended for those who want to gain better understanding of modern Japanese society and of their own cultural identities, as well as for students of the Japanese language.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://drive.google.com/file/d/1RU2iXs7Vyc-6F-HRozPu7_YdV7oYuOGn/view",
        "custom_fields":  {
                                                    "goals":  "1 Frame and reframe fundamental questions about current social phenomena and concerns in Japan in order to interpret issues e.g., multiculturalism, globalization, institutions e.g., Ministry of Education and events e.g., postwar economic recovery.2 Select and interpret materials, both primary e.g., films, video clips, newspaper articles and secondary e.g., research articles, to enrich inquiry into current social phenomena and concerns in Japan. 3 Analyze current social phenomena and concerns in Japan by examining the contributing historical factors in medium and longterm perspectives.4 Use the contextual information e.g., time, place, occasion, participants, gestures, shared knowledge in interpreting Japanese communication.5 Consider how traditional cultural values of postwar Japan 19451990 developed and how their own analyses of social issues in postbubble Japan 1990present show these values to be evolving.6 Reflect on your own cultural identity, values, and biases.",
                                                    "key_topics":  "Japanese society, its socialization processes, and the role of language in expressing and maintaining social structure and cultural identity; emic perspective on Japanese cultural values, family, community and neighborhood, early socialization and education, business and economy, language and communication, mixed Japanese, multilingual and multicultural Japan, globalization",
                                                    "prerequisite_knowledge":  "None, and the course is taught in English",
                                                    "assessment_structure":  "Written reflections on the readings; in-class discussions; short quizzes, two cultural analysis assignments; one term project involving collection of primary data with a presentation and a final paper.",
                                                    "relevance":  "Dietrich GenEd Prior to Fall 2021: Reflecting\nDietrich GenEd After Fall 2021: Contextual Thinking\n\nThis course is relevant to anyone curious about Japanese culture and society. The course contributes to the goals of the Dept. of Modern Language to enhance knowledge and appreciation of the values, traditions, and cultural history of Japanese people; to gain intercultural understanding; to build competence in communicating in Japanese by linking language learning with cultural studies; and to develop research, problem-solving, and critical thinking skills through cross-cultural analysis. It contributes to Dietrich College General Education requirements in the category of \"Reflecting,\" and may meet other colleges\u0027 General Education requirements as well.",
                                                    "learning_resources":  "textbook, Canvas, journal articles, news articles, websites, documentary and other films and videos.",
                                                    "extra_time_commitment":  null
                                            }
}