{
        "code":  "82-313",
        "name":  "Topics in Modern Arabic Language,Literature \u0026 Culture: Cinema in the Arab World",
        "short_name":  "CINEMA IN ARAB WORLD",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Through an exploration of contemporary Arab cinema, this course will introducestudents to issues in modern Arab societies that represent the diversity of theregion as well as shared aspirations and challenges. We will explore how Arabfilmmakers represent social, political, and economic changes and realities. We willanalyze select movies, including their cultural and historical background, as wellas relevant written and audiovisual materials from different media sources andliterary texts as appropriate. Some topics include nationalism and nationalidentitys, womens issues, diversity in the region, religious and political strife,social and economic challenges, and the recent revolts. This course also aims toadvance students competence in the Arabic language while considering thechanging sociolinguistic and sociocultural landscape in the Arab world. In ourwork with course materials, we will employ linguistic and paralinguistic analysesof the movies as a means to explore modern Arab thought and cultures.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Enhance students knowledge and understanding of select social, cultural,political, and economic realities in Arab societies and their historical roots,as well as debates that currently engage Arab thought and cultures. Enhance students appreciation of the discussed issues from a humanisticperspective. Develop students Arabic competence and abilities to communicateeffectively in Arabic, including in academic writing and speech in anintegrated skills format. Develop an ear for different Arabic varieties while enhancing studentsknowledge of Modern Standard Arabic. Develop students abilities to argue, debate, and present persuasivearguments in writing and in speech. Develop students analytical abilities and critical thinking.",
                                                    "key_topics":  "Through an exploration of contemporary Arab cinema, this course will introduce\nstudents to issues in modern Arab societies that represent the diversity of the\nregion as well as shared aspirations and challenges. We will explore how Arab\nfilmmakers represent social, political, and economic changes and realities. We will\nanalyze select movies, including their cultural and historical background, as well\nas relevant written and audiovisual materials from different media sources and\nliterary texts (as appropriate). Some topics include nationalism and national\nidentity(s), women\u0027s issues, diversity in the region, religious and political strife,\nsocial and economic challenges, and the recent revolts. This course also aims to\nadvance students\u0027 competence in the Arabic language while considering the\nchanging sociolinguistic and sociocultural landscape in the Arab world. In our\nwork with course materials, we will employ linguistic and paralinguistic analyses\nof the movies as a means to explore modern Arab thought and cultures.",
                                                    "prerequisite_knowledge":  "Students are expected to have advanced knowledge in the Arabic language to\nbetter understand assigned materials and effectively take part in class\ndiscussions.",
                                                    "assessment_structure":  "Effective daily participation;\n¿ Homework assignments;\n¿ Responses to course materials;\n¿ Presenting and holding a movie-based class discussion;\n¿ Attention to feedback;\n¿ One exam;\n¿ Final paper",
                                                    "relevance":  "Within an overall focus on advancing competence in the Arabic language, the\ncourse seeks to enhance students\u0027 knowledge and understanding of issues and\ndebates that currently engage Arab thought, communities, and cultures within a\nchanging sociolinguistic and sociocultural landscape. It aims to help students\nbetter understand and appreciate issues that impact Arab and Arabic-speaking\n\ncommunities, while developing a humanistic understanding of issues in ways that\ndevelop intercultural understanding.",
                                                    "learning_resources":  "Netflix\n¿ Kanope\n\n¿ YouTube\n¿ Selections of Arabic Literature\n¿ Aljazeera\n¿ BBC Arabic\n¿ CNN Arabic\n¿ Opinion Pieces in Arab press\n¿ Movie reviews\n-¿¿¿ ¿¿¿¿¿ ¿¿¿¿¿¿¿¿ ¿¿¿¿¿¿ ¿¿¿¿ ¿¿¿¿¿\n-Selected short stories and articles.",
                                                    "extra_time_commitment":  null
                                            }
}