{
        "code":  "82-312",
        "name":  "Advanced Arabic II",
        "short_name":  "ADVANCED ARABIC II",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "82-311 [] at least D"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The course is the continuation of Advanced Arabic I. It continues promoting multiple literacies in an integrated approach to Arabic language and culture studies and builds students ability to function at the advanced level in a variety of topics. It also embraces the diglossic nature of Arabic by explicitly integrating the teaching of Arabic regional spoken varieties alongside Modern Standard Arabic. Class will be of a multidialectal and multilingual nature to encourage questioning, analyzing, and conceptualizing topics in various contexts which will enhance and develop the students understanding of Arabic regional spoken varieties alongside MSA. Students will learn to examine cultural contexts and analyse world views that have been propagated as a result of political inequalities that are consequences of events such as the Arab Spring in the MENA region. Students will also examine and analyse cultural contexts relative to social media in contemporary politics, implications of climate change in global cultures, along with human rights on a global scale. This course also consists of topics pertaining to cultural heritage in the MENA region and the United States. During the course, students will also evaluate the influence of cultural norms and humanitarian institutions on the perpetuation of structural inequalities that affect the organizations of human rights, climate change, freedom of speech, and specific marginalized communities.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1. Abide by discussion etiquette and engage in discussion with different perspectives to create more inclusivity and reliability for the students to share opinions and engage in class discussions. 2.Continue building your communicative competence at the advanced level in Modern Standard Arabic MSA in all four skills Listening, Reading, Speaking, and Writing following a proficiencyoriented teaching approach.3.Continue expanding your knowledge of Arabic regional spoken varieties alongside Modern Standard Arabic depending on students background.4.Continue expanding your understanding of the Arabic language and culture studies and to continue building your ability to function at the advanced level in a variety of topics in reading, writing and analyzing material in which MSA is significantly utilized in our modern age.5. Develop your understanding and knowledge of linguistic conventions for reading, writing, and speaking in MSA through, writing and giving presentations to demonstrate your understanding of covered topics.6. Examine cultural contexts that have been propagated through political inequalities resulting in consequences such as the Arab Spring in the MENA region, the role of social media and technology in contemporary politics, implications of climate change towards global cultures and droughts, and human rights on a global scale, along with the significance of such cultural contexts in relation to students identities and biases and how such contemporary cultural contexts hold an impact to students worldviews.7. Examine topics that are related to their own cultural heritage, and the presence of cultural heritage in the MENA region and the United States from this, they will delve into how cultural heritage affects their own worldviews. 8.Examine issues related to general worldviews toward human rights in the MENA region and the United States, along with issues pertaining to human rights",
                                                    "key_topics":  "Arab Spring in the MENA region, social media and technology in contemporary politics, climate change and human rights in the MENA region and beyond, freedom of speech, inequalities and political implications on education.",
                                                    "prerequisite_knowledge":  "82-212, placement, or permission of the instructor",
                                                    "assessment_structure":  "Class participation, online discussion forum, conversations for learning, homework, essays, presentations and skits, final project (essay and presentation).",
                                                    "relevance":  "DC: Intercultural and Global Inquiry\n\nThis course is relevant to students who want to continue learning Arabic at the Advanced level to keep developing their linguistic and cultural repertoires. The course contributes to such goals of the Department of Modern Languages as Communication, Collaboration, and Cultural Knowledge.",
                                                    "learning_resources":  "Textbook, dialogue videos, materials on Canvas provided by instructors, and other materials online.",
                                                    "extra_time_commitment":  null
                                            }
}