{
        "code":  "82-332",
        "name":  "Reading Into a New China II: Transportation, Education, Pop Culture, \u0026 Health",
        "short_name":  "RDG NEW CHINA II",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(82-232 [] at least C) or (82-235 [] at least C)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "A continuation of Reading into a New China I, this course is designed to help students further improve their Chinese language proficiency and knowledge about Chinese society and culture. Students will continue to learn more complex language phenomena in order to do exposition, explanation, description and argumentation with Chinese. These language phenomena will be introduced to students together with their social and cultural background through texts and multimedia programs related to various social issues in China, such as transportation, education, pop culture and healthy living. Classroom discussions and research project presentations will be the major forms of oral practice and writing practice will mainly focus on essays and research papers.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "For this course, students are expected toExplain the social and cultural issues related to traffic, education, employment, pop culture, and healthy living in modern China, as well as analyze how these issues affect Chinese peoples perception of their living condition, cultural identity and heritage, and their connections with and views of the world. Analyze the historical, social and cultural background of the aforementioned issues. Through intercultural comparison, evaluate how different positions and worldviews affect peoples perception and interpretations of similar issues in different regions.Describe the historical and social origins and contexts of certain cultural norms, and evaluate how these cultural norms have become entrenched in peoples thinking to create and perpetuate structural inequalities and discriminatory attitudes in different societies, including their own.Further enhance their language skills by using more abstract and sophisticated words, more complicated grammar and sentence structures, and more coherent paragraphlevel argumentations to express their opinions, in speaking and writing, on those social and cultural issues.",
                                                    "key_topics":  "Chinese language, communication, modern Chinese society and culture after the 1950s including transportation, education, pop culture and healthy living.",
                                                    "prerequisite_knowledge":  "82-232, placement, or permission of the professor",
                                                    "assessment_structure":  "8 homework, 4 online unit tests, 4 short essays, 1 research paper, presentations and oral activities, weekly preview/review assignments, classroom discussion.",
                                                    "relevance":  "DC GenEd: Intercultural and Global Learning\nThis course further enhances students\u0027 communicative abilities in Chinese at the advanced level and enriches their intercultural understanding of modern Chinese society and culture from a global perspective. It helps students develop critical thinking skills on socio-cultural issues related to China and the world.",
                                                    "learning_resources":  "A Changing China: Part 2 (Textbook). Movies, TV programs and online materials provided by the instructor",
                                                    "extra_time_commitment":  null
                                            }
}