{
        "code":  "82-333",
        "name":  "Chinese Language and Culture",
        "short_name":  "CHNSE LNG CLTR",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "SECTION A With China as a growing political and economic power, understanding the country through its history and culture becomes necessary for students as responsible citizens of the world. This course is designed to help students, previously unexposed to Chinese culture and civilization, better understand Chinas past.  By learning about the history of the Middle Kingdom, students will be exposed to the deep and fascinating foundation of Chinese civilization. We will not cover thousands of years of history, but discuss a chronological timeline of dynasties for reference. Areas of focus include the general knowledge of geography, religion, art, ancient lifestyles, and values.  This course is conducted in English with no requirement of prior knowledge of Chinese language.     SECTION B This course will introduce students to important developments in Chinas culture and language since the end of the nineteenth century focusing on the interactions between Chinese and Western cultural traditions and the historical, social, and political contexts in which these interactions evolved. The following questions will motivate discussion What is Chinese culture in the modern world What is modern and what traditional Chinese culture How does high culture interact with folk culture and popular culture How have education and language policies shaped Chinese cultural identities over the last century What does it mean to be Chinese in a diaspora context   This course is conducted in English with no requirement of prior knowledge of Chinese language.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1. Deepen students knowledge on social, historical, political, and cultural themes of modern China 2. Improve problemsolving, and critical thinking skills through doing crosslinguistic, crosscultural, and comparative historical analysis 2. Develop independent research skills 4. For Chinese majorsminors Develop reading skills in Chinese by broadening topical domains of the language.",
                                                    "key_topics":  "Chinese History since 1919, Contemporary China, May Forth Movement/New Culture movement, Revolutionary Culture, Cultural Fever, Market Reform and Opening up, The rise of China, Gender/Marriage, Current Events, Socialization/School, Business Culture, , Confucianism in China.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "12 reading journals, 4 discussion prompts,1 map quiz, 1 movie analysis, 1 mid-term test, 1 current event analysis and 1 final project(team work).",
                                                    "relevance":  "This course enhances students\u0027 academic knowledge regarding the emergence of modern Chinese culture and its underlying socio-political context. It helps students develop critical thinking skills about China and Chinese society in a global age through research projects and intercultural discussions in class.",
                                                    "learning_resources":  "A Bitter Revolution: China\u0027s Struggle with the Modern World(Textbook); other reading materials provided by the instructor.",
                                                    "extra_time_commitment":  null
                                            }
}