{
        "code":  "82-371",
        "name":  "Advanced Japanese I: An Exploration of Critical Global Topics",
        "short_name":  "ADV JAPANESE I",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "82-272 [] at least D"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In todays world, there are many problems that we have never had to think about before  the use of new information technology, genome editing, and cloning technology. There are serious environmental issues such as global warming, and we have to change our society drastically before it is too late by regulating our industries and economies. Through this Japanese course, we are going to utilize critical thinking skills to generate important questions on various globally relevant topics in order to break down large issues and identify critical points within each topic. By the end of the course, students will be equipped with skills to break down large problems into more approachable questions and to critically utilize appropriate textbased resources in Japanese.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "TBD",
                                                    "key_topics":  "TBD",
                                                    "prerequisite_knowledge":  "82-272, placement, or permission of the instructor.",
                                                    "assessment_structure":  "TBD",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Communicating\nDietrich GenEd after Fall 2021: Intercultural and Global Inquiry\n\nThis course is relevant to students who want to further develop from\n82-272 their cultural and cross-cultural analysis skills and\ncommunicative ability. They can achieve up to Advanced Low\n(ACTFL) or the B2.1 level (CEFR). It provides more opportunities to\ncreate with the language in cultural and cross-cultural analysis. It\ncontributes to such goals of the Department of Modern Languages as\nCommunication and Collaboration, Critical Thinking and Problem\nSolving, Innovation and Creativity through Interdisciplinary,\nCross-Cultural Skills, and Content and Cultural Knowledge.",
                                                    "learning_resources":  "2 Textbooks, video clips, materials on Canvas provided by instructor, student\nwriting assistant, and Japanese guests.",
                                                    "extra_time_commitment":  null
                                            }
}