{
        "code":  "82-387",
        "name":  "Introduction to Linguistic Data Analysis Using R",
        "short_name":  "INTRO LING DATA ANLY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course provides a handson introduction to the fundamental aspects of statistical analysis of quantitative linguistic data using the open source statistical environment R.The course assumes no prior programming or statistics training. Students will first understand how spoken and written language can be conceptualized as data. Students will learn what this data looks like and how to think about such data from a computational perspective. Students will build a level of confidence in using R that can lead to more advanced programming and statistics classes. Students will also learn how to visualize and appropriately form specific research questions related to linguistic analysis, and how data and its presentation can be manipulated in unethical ways. Students will also examine how the same data set can tell different storiesoutcomes depending on the analyses and presentation. Inclass labs and homework will make use of corpus, psycholinguistic, and survey data from a variety of languages and methods. At the end of the course, students will be able to select and use appropriate quantitative methods to analyze linguistic phenomena with the help of R. More practically, students will be able to use and understand the R code provided in class and modify it for the purposes of their own research.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course, students will be able toUtilize computational thinking in order to conceptualize spoken and written language as data.Visualize and appropriately form specific research questions related to linguistic analysis.Select and use appropriate quantitative methods to analyze linguistic phenomena with the help of R.Describe the limitations of linguistic data and its analyses.Examine how the same data set can tell different storiesoutcomes.",
                                                    "key_topics":  "linguistic data, variables, visualization, descriptive and inferential statistics",
                                                    "prerequisite_knowledge":  "The course assumes no prior programming or statistics training.",
                                                    "assessment_structure":  "Take home assignments, weekly practice, short writing assignments, participation, lab visit, final project and presentation",
                                                    "relevance":  "Dietrich GenEd Prior to Fall 2021: Modeling - Other\nDietrich GenEd After Fall 2021: Computational Thinking\n\nStudents interested in conversation, lab, and corpus data relating to language can learn to analyze it computationally.",
                                                    "learning_resources":  "Canvas, open source software, no purchase requirements",
                                                    "extra_time_commitment":  "Lab visit outside of class on their own time"
                                            }
}