{
        "code":  "82-399",
        "name":  "Equity \u0026 Justice in Modern Languages (Language-Specific)",
        "short_name":  "EQUITY \u0026 JUSTICE ML",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "82-242 [] at least C"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "S23 Derechos Humanos y Cine en Latinoamrica  This course has the dual purpose of examining important human rights issues in Latin America and questioning the role of film in making visible, critiquing, or even sustaining the structures that lead to human rights violations. We will study specific human rights issues tackled by filmmakers in Latin America, such as cultural rights, gender and sexuality rights, economic rights, environmental issues, and war and state terror. Furthermore, we will discuss specific film schools and movements that developed to address human rights and social justice issues in diverse Latin American contexts. Finally, we will look at how Latin American films work the international human rights film festival circuit, and the ethical and practical implications of filming local human rights issues for international audiences. All coursework for this section in Spanish may count for Hispanic Studies credit. Students interested in doing coursework in English credit should register under 82299.  9 units",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  "82242 or permission of the department/instructor",
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}