{
        "code":  "82-344",
        "name":  "U.S. Latine Cultures",
        "short_name":  "U.S. LATINE CULTURE",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(82-244 [] at least D) or (82-242 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [
                                    {
                                            "code":  "82-342",
                                            "id":  6321,
                                            "name":  "Cultures of Spain",
                                            "units":  9.0
                                    },
                                    {
                                            "code":  "82-343",
                                            "id":  6322,
                                            "name":  "Cultures of Latin America",
                                            "units":  9.0
                                    },
                                    {
                                            "code":  "82-345",
                                            "id":  6324,
                                            "name":  "Using Spanish in Social Contexts",
                                            "units":  9.0
                                    }
                            ],
        "long_desc":  "This course is part of the postintermediate, 300level program that forms the introduction to the major or minor in Hispanic Studies. Students may begin with any one of the three courses at this level or they may be taken concurrently.  This course provides an introduction to and analysis of the cultures and histories of U.S. Latinos.  The course will trace the historical trajectories of these groups, both those dating back centuries, such as MexicanAmericans and certain Caribbean populations, and those with more recent, quickly growing populations, such as Salvadoran and Honduran immigrants, in an effort to understand how their identities are forged and transformed over time, considering both internal and external perspectives.  Our exploration of U.S. Latino history and cultures will compare and contrast the experiences of people from the abovedescribed categories and analyze the dynamic tension amongst them, with other minority groups, and with the mainstream US society. We will examine a wide variety of materials, including texts, film, art, music etc. in order to gain a better understanding of Latino populations in the United States. Ultimately, we seek to question and to understand the complexities of Latinidad in the 21st century U.S. The course will be taught in Spanish.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will be introduced to literature and works of art from different Latino groups in different regions of the U.S. in order to identify and understand their language and the significant historical events that influence their presence in the U.S.Students will hone their oral, aural, reading, and writing skills in Spanish not only through the discussion of literary texts and other cultural artifacts but also through the class activities that promote and require the Spanish language.Students will be exposed to different dialects and vocabulary in Spanish and Spanglish, both through class readings and through other media for the course.Students will learn how to formulate and express arguments in Spanish related to the culture of Latino groups in the U.S., a set of skills that will be useful in future studies.",
                                                    "key_topics":  "The theme this semester for this course is \"Focus on América: Contemporary Latinx Theater in the U.S.\" Our course examines Spanish-language Latinx theater and performance in the United States, beginning with the turbulent 1960\u0027s, and reaching the present, and the historical context from which it emerged.",
                                                    "prerequisite_knowledge":  "82-242, placement test, or permission of the professor",
                                                    "assessment_structure":  "Assessment will be based on attendance; daily preparedness and participation in class activities; participation and discussion both in-class and in an on- line discussion forum; nightly/weekly reading and HW with questions; independent and collaborative research and writing assignments; pair/group readings and discussion; one, final research project/paper; one final oral presentation. There is no curve; grades will not be weighed",
                                                    "relevance":  "Students will use contextual thinking to analyze plays from the established and emerging Latina/o/x canon while integrating supplementary texts including reviews, critical analyses, essays, and theoretical studies. Plays will be examined using various modes of inquiry including geographic, linguistic, gender studies, exile, immigration status, and borderlands theory. Conceptual terms including latinidad, mestizaje, Nuyorican, ethnicity, Latinization, cubanismo, etc., will help us define the plays in relation with their sociological placement as \"living texts.\"",
                                                    "learning_resources":  "Semester-based text; other readings and texts will be provided on Canvas, be distributed in class, or result from student research",
                                                    "extra_time_commitment":  null
                                            }
}