{
        "code":  "82-304",
        "name":  "French \u0026 Francophone Sociolinguistics",
        "short_name":  "FRNCH FRANCO SCLGTS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(82-202 [] at least C) or (82-204 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course examines the French language in relation to the social and cultural lives of the people who use it across the Frenchspeaking world. To do so, students will explore the links between the French language of all francophones, its use, and the expression of national, cultural, community, and individual identities through the study of diverse texts and data sources, including policylegal documents, films, music, newscasts, digitized corpuses of spoken and written French, and computertechnologymediated communication. Through readings, discussions, handson activities, and project work, students will 1 develop content knowledge with an emphasis on language ideologies, policy, and planning language contact and multilingualism and language variation and change and 2 develop linguistic skills in French reading, writing, listening, and speaking with specific focus on advanced spoken and written expression. This course is repeatable with new topics.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of this course, students will be able to Examine how sociohistorical and contemporary contexts impact language use, multilingualism, variation, and change in relation to identity and ideologies. Evaluate how language ideologies and cultural concepts shape and are shaped by historical and current events, intercultural contacts, and community formation. Analyze the role of cultural norms and institutions in creating and perpetuating structural inequalities and discriminatory attitudes. Develop linguistic skills in French with specific focus on advanced spoken and written expression",
                                                    "key_topics":  "History of French language; language variation; language and identity; language ideologies",
                                                    "prerequisite_knowledge":  "82-202, placement test, or permission of the instructor. Ability to express oneself in French writing and speaking at the Advanced (Third-year) level, by placement test or previous coursework : Description, Comparison, Narration in present, past, and future tenses. Students should have a knowledge of French that is commensurate with taking an advanced French course. No particular content knowledge will serve as a prerequisite but some basic understanding of French culture and any additional knowledge base students bring to the course will be brought to bear.",
                                                    "assessment_structure":  "You will complete readings and homework assignments, participate in class discussions in French, and undertake several (3-4) original creative works or empirical projects that will be revised and compiled as a final course portfolio.",
                                                    "relevance":  "DC GenEd: Intercultural and Global Inquiry\n\nThis course is one of two required courses at the Advanced (third-year) level, necessary to fulfill the requirements of the major and minor in French and Francophone Studies, prior to taking fourth-year courses.",
                                                    "learning_resources":  "Readings and other materials will typically be posted in Canvas. Other tools (e.g., specific software or hardware) will be made available as appropriate/needed, depending on the version of the course (NB: course topics change each semester).",
                                                    "extra_time_commitment":  null
                                            }
}