{
        "code":  "82-372",
        "name":  "Advanced Japanese 2: An Exploration of Critical Global Topics",
        "short_name":  "ADV JPN 2 EXPL CRTC",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(82-272 [] at least C) or (82-371 [] at least C)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course continues to further improve the acquisition of advanced level communicative language proficiency by immersing students in authentic cultural explorations. The curriculum includes authentic reading texts, multimedia, interviews with native speakers, and viewing and summarizing video clips that depict current Japanese society and cultural trends. The course also provides an individualized learning environment throughout the term in improving students language skills and cultural proficiency. Students may pick a topic of personal interest for their term project thesis.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of this course, students will be able to1. understand Japans lifestylereligion and gender issues. 2. be able to discuss Japans lifestylereligion and gender issues to present ones thoughts and opinions about them using graphs and charts in speech and writing. 3. acquire skills to gather necessary information through reading newspapers, magazines, and articles on the web and viewing video clips. 4. examine how social and cultural contexts of Japan impact Japanese worldviews.5. evaluate how worldviews influence the interpretation of historical and contemporary events and the perception of other cultures.6. analyze the role of Japanese cultural and social norms and institutions in creating and perpetuating structural inequalities and discriminatory attitudes in Japan.",
                                                    "key_topics":  "Continued work in language, communication, pragmatic skill development in speaking, reading, writing, and listening, and cultural knowledge; Issues in Japanese society and culture, especially (1) lifestyle/religion and (2) gender.",
                                                    "prerequisite_knowledge":  "82-371, placement, or permission of instructor",
                                                    "assessment_structure":  "Class participation, bi-weekly reflection papers and other types of homework, quizzes (vocabulary, kanji [Chinese character], and grammar), two conversation sessions with a writing assistant, one conversation session with Japanese guests, two performance (small group discussion) tests, two unit tests, project (presentation and essay).",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Communicating\nDietrich GenEd after Fall 2021: Intercultural and Global Inquiry\n\nThis course is relevant to students who want to further develop from 82-371 their cultural and cross-cultural analysis skills and communicative ability. Students can achieve up to Advanced Low/Mid- level (ACTFL Proficiency Guidelines 2012). It provides more opportunities to create with the language in cultural and cross-cultural analysis. It contributes to such goals of the Department of Modern Languages as Communication and Collaboration, Critical Thinking and Problem Solving, Innovation and Creativity through Interdisciplinary, Cross-Cultural Skills, and Content and Cultural Knowledge.",
                                                    "learning_resources":  "textbooks, video clips, online resources, materials on Canvas provided by\ninstructors",
                                                    "extra_time_commitment":  null
                                            }
}