{
        "code":  "82-342",
        "name":  "Cultures of Spain",
        "short_name":  "CULTURES OF SPAIN",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(82-244 [] at least D) or (82-242 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [
                                    {
                                            "code":  "82-343",
                                            "id":  6322,
                                            "name":  "Cultures of Latin America",
                                            "units":  9.0
                                    },
                                    {
                                            "code":  "82-344",
                                            "id":  6323,
                                            "name":  "U.S. Latine Cultures",
                                            "units":  9.0
                                    },
                                    {
                                            "code":  "82-345",
                                            "id":  6324,
                                            "name":  "Using Spanish in Social Contexts",
                                            "units":  9.0
                                    }
                            ],
        "long_desc":  "This course is part of the postintermediate, 300level program that forms the introduction to the major or minor in Hispanic Studies. Students may begin with any one of the three courses at this level or they may be taken concurrently.  Spain Language and Culture focuses on the cultures of Spain, the autonomous regions and the creation of a national identity as a reaction to the multiple ethnicities that have inhabited the peninsula since ancient times. The course advances proficiency in grammatical accuracy, the ability to communicate ones ideas in Spanish, and cultural proficiency. The focus of inclass activities is on written and nonwritten sources such as history, literature, film, art, and elements of popular culture the building of reading and writing skills will be complemented by continued oral practice in the form of small and large group discussions and class presentations. Treatment of reading selections is designed to increase students general familiarity with a variety of genres, devices, and discourse types and to build a foundation for the departments more advanced courses in literature, history and culture. The course will be taught in Spanish.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "With adequate outofclass preparation and active inclass participation, students willadd to their knowledge of the cultures of Spaingain understanding of the major political, literary, and artistic movements in Spain throughout its historysubstantially increase their knowledge of vocabulary and idiomatic expressionsbuild their listening, speaking, reading, and writing skills in Spanishgain familiarity with a variety of literary genres and types of discoursebuild a foundation for more advanced classes in literature and cultureanalyze how your individual identities are shaped over time and inform your worldviews and perspectivesexamine the impact of historical and contemporary worldviews and perspectives on groups and subgroups.apply your knowledge of language and culture to interpret others worldviews in a variety of curricular and metacurricular contexts.navigate varied cultural contexts through effective and adaptive engagement and interaction.identify opportunities to advocate or take culturally appropriate action as a globally responsible citizen.",
                                                    "key_topics":  "the cultures of Spain - the autonomous regions, and the creation of a national identity important historical moments and issues that have shaped the development of Spain.\n¿ Ideological currents as well as key literary and artistic movements from medieval times to the present.",
                                                    "prerequisite_knowledge":  "82-242, placement, or permission of intructor",
                                                    "assessment_structure":  "Class participation, Homework involving making mental maps and preparing to be historical guides related to Ministry of Time television episodes, Group discussion notes on current topics related to the episodes, 4-6 Short Essays on themes from the course, Final Project on a topic of student interest related to the course (using a powerpoint presentation). All prepared in Spanish.",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Communicating\nDietrich GenEd after Fall 2021: Intercultural and Global Inquiry\n\nThe key topics included above are intertwined with issues that are related to human identity and cultural expression including power, gender, class, race, and religion. Students will examine the relationship between socio-political context and cultural production in Spain. However, this examination will be applicable to a variety of geographical and cultural contexts beyond the parameters of this course.",
                                                    "learning_resources":  "Students purchase access to television episodes for $4.99/month, with all other materials provided via Canvas or online.",
                                                    "extra_time_commitment":  "If there are opportunities in the Pittsburgh area for further learning."
                                            }
}