{
        "code":  "82-320",
        "name":  "Contemporary Society in Germany, Austria and Switzerland",
        "short_name":  "CNTPY SC GRM AST SWT",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "82-222 [] at least D"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course offers an introduction to contemporary German culture since 1989. We will include Switzerland and Austria in our discussions but our main focus will be on Germany. In the wake of reunification, constructions of German cultural identity have undergone radical changes. Through encounters with articles, literary texts, popular music, and film we will explore these transformations and examine German culture and both individual and collective identities after reunification. The class sessions will be organized around thematic modules national identities and stereotypes, German EastWest relations during and after reunification, political systems, multiculturalism and minorities, diversity, youth cultures, and, finally, a segment on leisure time and travel culture in Germanspeaking countries. The course will be conducted entirely in German and is designed to deepen your understanding and awareness of issues in contemporary German culture.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students should be able toincrease their vocabulary significantly through vocabulary tests and essays.improve their grammar skills through designated grammar lessons and through the application of grammar in their essays.practice their writing skills through essay writing.improve their oral skills through numerous presentations and class discussions.take part in class discussions with their fellow classmates to identify, describe, and analyze cultural identities, practices, products, and phenomena in Germany, Austria, and Switzerland after German reunification.demonstrate their crosscultural awareness through contrasting and comparing the different worldviews of German, Swiss, and Austrian social, political, and cultural phenomena to those in their home culture. critically engage with issues surrounding multiculturalism and minorities and their impact on national identities and stereotypes.",
                                                    "key_topics":  "Contemporary society in Germany, Austria, and Switzerland from 1989 to the present, including German reunification, the political and economic systems, multiculturalism and diversity, youth and leisure culture.",
                                                    "prerequisite_knowledge":  "82222, placement or permission of the instructor.",
                                                    "assessment_structure":  "Continuous homework assignments requiring reading, writing, listening exercises, grammar exercises, class participation, vocabulary quizzes, five essays, an oral presentation, and news reporting.",
                                                    "relevance":  "DC GenEd: Intercultural and Global Inquiry\n\nThis course is one of three required courses at the Advanced (Third-year) level, necessary to fulfill the requirements of the major and minor in German and German Studies.",
                                                    "learning_resources":  "Web pages, online dictionaries, online videos, electronic and hard copy texts, grammar handbook, and language assistant, all provided via Canvas or links to other sources.",
                                                    "extra_time_commitment":  null
                                            }
}