{
        "code":  "84-120",
        "name":  "Introduction to US Constitutional Law",
        "short_name":  "CONSTITUTIONAL LAW",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course provides an introduction to the United States Constitution and the principles of constitutional law. Using landmark Supreme Court cases that have shaped the development of constitutional law in the United States, students will gain familiarity with legal arguments and understand historical, political, social, and moral dimensions of the American constitutional structure. The course will explore the structure of the Constitution, the powers of the federal government, and the relationship between the federal government and the states. The course will also cover the Bill of Rights and the Fourteenth Amendment including Due Process and Equal Protection, including the protections afforded by these amendments and the ways in which they have been interpreted by the Supreme Court. Throughout the course, students will engage with key constitutional concepts, including federalism, separation of powers, and individual rights.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course students should be able to Demonstrate constitutional literacy about the structure of government concepts such as the separation of powers and federalism the nature and debates over judicial power and the content and meaning of constitutional rights and liberties afforded to individualsExplain core aspects of the U.S. Supreme Court, including judicial selection, basic processes of case docketing, and features of opinion writingRead, understand, and brief judicial opinions authored by the U.S. Supreme Court Recognize and apply different types of argumentation in a Constitutional Law context such as textualism, originalism, institutional competency arguments, etc.Assess the persuasiveness of an argument relative to the historical era and court composition.Identify and apply methods of constitutional interpretation, such as historical analysis, evolving constitutionalism, etc.Communicate major themes and doctrine arising in several areas of Constitutional LawBe informed consumers of news, legal developments, and future opinions.",
                                                    "key_topics":  "Constitutional History, Government Powers, Due Process Equal Protection",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Preparation for and participation in class discussions, 4 exams that correlate to the major units in the course, case briefs, a set of optional extra credit discussion questions",
                                                    "relevance":  "Disciplinary Perspectives: Humanities",
                                                    "learning_resources":  "All materials provided via Canvas",
                                                    "extra_time_commitment":  "None required, but following the news and attending speaker events will be recommended, with potential extra credit."
                                            }
}