{
        "code":  "84-275",
        "name":  "Comparative Politics",
        "short_name":  "COMPARATIVE POLITICS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is an introduction to the subfield of Political Science called Comparative Politics. In this subfield we use comparative methods to study and compare domestic politics across countries. In this course, we aim to learn about how political systems differ, discuss why they differ and explore the consequences of such variation. The course is divided into four sections. In the first part, we will examine the main theories and methods used to conduct research in the subfield, and discuss the development and consolidation of the modern state. In the second section, we will examine political regimes, including variation among democracies and nondemocracies. In the third unit, we will study some of the countries central political institutions. We will compare political systems presidentialism, semipresidentialism, and parliamentarism and examine legislatures, electoral systems, and political parties. In the final segment, we will scrutinize political mobilization and conflict. We will discuss interest groups, nationalism, social movements, protests, populism, clientelism, revolutions, civil wars, terrorism, and globalization.  The participation of students is central for the success of this course. You are encouraged to share your thoughts and doubts via Canvas, participate in smallgroup discussions each week, and participate in one group presentation that will demand you to apply the concepts and methods discussed in the course to other countries.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1. Restate central theories, concepts, and methods of Comparative Politics.2. Appraise how the scholarly literature has contributed to our understanding of domestic politics.3. Explain how some of the most important political institutions work and vary across countries.4. Recognize why people tend to participate in politics and engage in violent political behavior.5. Diagnose the consequences of political behavior and political institutions.6. Develop arguments supported by the literature to address a question in comparative politics.7. Work effectively in a diverse group.",
                                                    "key_topics":  "Comparative Politics, Comparative Methods, State Creation and Development, Welfare State, Varieties of Democracies, Democratic Breakdowns and Democratizations, Varieties of Autocracies, Political Regimes, Political Institutions, Parliamentarism, Presidentialism, Legislative Politics, Electoral Systems, Political Parties, Political Mobilization, Interest Groups, Nationalism, Social Movements, Protests, Populism, Clientelism, Revolutions, Civil Wars, Terrorism, Globalization.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "10% Attendance 12% Participation 10% Presentations 38% Quizzes 30% Exams",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Deciding\nDietrich GenEd after Fall 2021: Disciplinary Perspectives - Social Sciences\n\nThis course is an introduction to one of the main subfields in political science, called Comparative Politics. Comparativists use qualitative and quantitative methods to study and compare domestic politics across countries. In this course, we aim to learn about how political systems differ, discuss why they differ and explore the consequences of such variation. Domestic politics affect your everyday life; in this course we will start to unveil how.",
                                                    "learning_resources":  "Classroom Games, Group discussions, Group Presentations, and Documentaries",
                                                    "extra_time_commitment":  null
                                            }
}