{
        "code":  "84-293",
        "name":  "Geopolitical Challenges of a Changing Middle East III: Politics, Security, \u0026 Law",
        "short_name":  "GEOPL MDEAST III LAW",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This is one of three micro courses  under the umbrella of Geopolitical Challenges of a Changing Middle East Politics, Security, and Law, jointly taught by Dr. Geoffrey McGovern, Dr. Colin Clarke, and Dr. Ignacio Arana.  This course examines the historical roots and development of International Law what is it, where does it come from, how does it operate in theory and in practice  As the world draws evercloser in the movement of people, products, and ideas, the fundamental structures of selfgovernance, selfdetermination, and the design of decisionmaking institutions requires global citizens to reflect on the ways we identify, address, and hopefully resolve collectivelyshared problems amid an ecosystem of sovereign states.  The course is divided into two sections. The first looks to the historicallegal development of the law of nations.  It will draw upon legal curricula treaties, international agreements, domestic law, norms, etc. as the source material for how International Law has developed and in turn shaped the development of the current international arrangement.  The second will ask how the current arrangement of decisionmaking authority can meet the emerging needs of the globe how collective action problems can be resolved through the alignment or misalignment of sovereign powers and interests.  Some gametheoretic work will be introduced to supplement the historicallegal perspective from the first section.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}