{
        "code":  "84-226",
        "name":  "International Relations",
        "short_name":  "INTL RELATIONS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [
                                            {
                                                    "code":  "84-326",
                                                    "id":  6935,
                                                    "name":  "Theories of International Relations",
                                                    "units":  9.0
                                            }
                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course introduces students to the discipline of international relations IR and enables students to examine the causes of war and peace, the role of international institutions and nonstate actors in world politics, and the forces that shape international political economy. The course introduces key concepts in world politics like power and order, reviews the modern history of IR from colonialism to today, and surveys a broad range of IR theories and analytical tools that help explain global politics and aid in foreign policy analysis. Finally, students engage in contemporary policy debates about world politics  from the War in Ukraine to the rise of China to the future of globalization  and grapple with ethical issues related to foreign policy decisionmaking. Students who previously completed 84326 Theories of International Relations are not eligible to take this course.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course, students should be able toRead arguments about world politics thoroughly and thoughtfully analyze underlying assumptions, relevant actors, logic, policy implications.Critically examine the history of international relations and contemporary foreign policy strategy debates from different perspectives.Apply and synthesize theories and analytical tools in the discipline of IR to analyze issues of cause and effect in international politics.Marshall evidence in support of a causal argument in world politics or to advocate defend a foreign policy position related to a current contemporary problem in IR.Explain findings of IR research or importance of IR concepts to broader general or policy audiences.",
                                                    "key_topics":  "Political science, international relations, security studies, international political economy, war and peace, power.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "There will be a note-taking assignment, an in-class debate, two short essays (individual), one exam, and a final project in lieu of a final exam.",
                                                    "relevance":  "DC: Disciplinary Perspectives: Social Sciences\n\nRequired course for CMIST degrees.",
                                                    "learning_resources":  "There will be no textbook. All course readings and materials will be available on Canvas or otherwise freely available online.",
                                                    "extra_time_commitment":  null
                                            }
}