{
        "code":  "84-250",
        "name":  "Writing for Political Science and Policy",
        "short_name":  "WRITE POLISCI POLICY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Writing and briefing are essential skills in the policy discipline. This course will equip students with the tools necessary to enter professional policyrelated domains. We will use a workshop format that promotes classroom discussions, small group work and practical exercises simulating real world experiences. The workshop format is intended to emphasize communication, writing effectiveness and leadership, as well as to increase students comfort levels with both receiving, applying, discussing and delivering constructive feedback and criticism. It is also intended to make this class fun and engaging, creating a safe and welcoming environment for students to reflect on their own work, and their colleagues. During the course, students will write a policy memo, an oped, and a National Security Memo, as well as some smaller additional writing assignments as well as deliver multiple professionalstyle briefings for a variety of audiences. This is a writing intensive course, with a heavy emphasis on professional briefing and presenting. As such, students should expect to write and brief... a lot This workshopbased model allows students to incorporate and give feedback in real time. The intent is that students will develop the skills necessary to enter future professional environments and hit the ground running. Students will work within small groups and with the professor to identify a topic Area of Interest AOR that will be the basis for most of their course work allowing students to focus on an area in which they would like to develop subject matter expertise SME, as well as one they find interesting and stimulating.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By committing to the rigorous process of reading, writing, discussing, collaborating, editing and rewriting, students who complete this course will demonstrate their ability to 1 Generate policy questions that are complex and nuanced enough to allow for inquiry, discovery and analysis, not just summary and illustration 2 Write a policy memo, oped, National Security Memo, request for information, and executive updates clearly and concisely, tailoring their writing to the target audience 3 Deliver an introductorybrief, a current update brief, an elevator pitch, and a media briefingconveying complex information to a host of customers in various environments 4 Effectively employ the use of visuals to illustrate and bolster multifaceted data 5 Provide constructive verbal and written feedback to the written work of peers 6 Apply feedback receivedfrom professor and peers to improve work 7 Distinguish between substantive revision and surface editing practice both and rethink and reshape their writing based on their audience and purpose 8 Delineate uncertaintyboth in oral and written communication.",
                                                    "key_topics":  "Key topics include principles of rhetoric, evidence-based argumentation, assessment-based writing, concision, clarity and cohesion.",
                                                    "prerequisite_knowledge":  "No prior knowledge is required.",
                                                    "assessment_structure":  "Participation: 15%, Background paper 10%, Policy Memo and Brief 15% and 5% (20% total), Op-Ed 15%, Request for Information (RFI) 5%, National Security Memo (PDB) and Brief 15% and 5% (20% total), Executive Update 5%, Media Briefing 10%",
                                                    "relevance":  "This course is required for majors in the Institute for Politics and Strategy and facilitates success in writing in other Institute for Politics and Strategy (IPS) courses.",
                                                    "learning_resources":  "With the exception of two soft-back affordable books for purchase, all readings will be available on Canvas or otherwise free online. Students are also expected to acquire and learn Endnote citation management software.",
                                                    "extra_time_commitment":  null
                                            }
}