{
        "code":  "84-306",
        "name":  "Latin American Politics",
        "short_name":  "LATIN AMER POLITICS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The worlds most unequal region is an area of contrasts. Ethnically diverse, stable and tumultuous, young and old, urban and rural, learned and illiterate, prosperous and poor, independent yet dependent. The disparities that have characterized the region since colonial times have been a permanent source of instability and the cause of numerous political and economic experiments. Social scientists have found much material to study democratic innovations, revolutions, coups, civil wars, military dictatorships, impeachments, populism, clientelism, corruption, import substitution industrialization, neoliberalism, socialism, regime changes, social movements, welfare policies, regional integration, and diversified leadership. The overarching question to be explored in this course is what forces affect the emergence, development, collapse, reemergence, and consolidation of democracy. To understand the regions present, it is necessary to study path dependence and learn how the worldviews of dominant elites evolved over time. Thus, the course centers in three historical periods. First, we will briefly examine Latin American history from its conquest to the end of World War II 14921945. The aim is to uncover the demographic and geographical setting with its economic, social, and political evolution. The second part centers on most of the Cold War period 19471978 and its combination of political and economic experiments. The third part covers the last 47 years, from the wave of transitions to democracy to current challenges to democratic consolidation. We will also address how Latin America has integrated to globalization and how the relationship with the US and China has experienced fundamental changes since the 1990s.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "At the end of the course, students will be able to1. Identify the main current political problems and challenges of Latin America and understand them in its historical context.2. Explain which political factors impede a steadier regional development in terms of economic expansion, social peace, wealth distribution, civil liberties, and political rights.3. Identify some of the major issues that have guided research on Latin American politics during the last decades.4. Explain how the study of Latin American politics fits within the discipline of Political Science.5. Evaluate how the evolving worldviews of dominant elites have shaped the regions development and analyze how cultural norms and institutions help us understand Latin Americas current development stage.",
                                                    "key_topics":  "Civil wars, clientelism, colonial legacies, coups, debt crises, democratic breakdowns and democratizations, elites\u0027 worldviews and behavior, exchange-rate policies, export-led growth, foreign policy, fiscal policies, foreign investments, globalization, import substitution industrialization, income distribution, inflation, labor market, nationalism, neoliberalism, political institutions, political mobilization, political regimes, populism, poverty, presidentialism, revolutions, socialism, state development, trade, and United States.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "10% Attendance 15% Participation 10% Presentations 25% Final Exam 40% Two Short Papers",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Deciding\nDietrich GenEd after Fall 2021: Foundations - Intercultural and Global Inquiry\n\nSocial science research has used Latin America as a source to develop and test theories due to the numerous social, political, and economic changes documented over the last two centuries in the region. Therefore, this course provides tools for the analysis of key contemporary themes in Comparative Politics such as democratization and institution-building, and also offers insights to understand social, political, and economic processes in other countries. Furthermore, one out of six individuals living in the United States is of Latin American origin, and their background contributes to shaping United States\u0027 domestic and foreign politics.",
                                                    "learning_resources":  "One book about Latin American history, plus articles posted on Canvas, Canvas discussions, classroom games, group discussions, individual presentations, and documentaries.",
                                                    "extra_time_commitment":  null
                                            }
}