{
        "code":  "84-319",
        "name":  "Civil-Military Relations",
        "short_name":  "CIVIL-MILITARY REL",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Why do militaries people with guns ever obey civilians people without guns Can we have a military strong enough to protect civilians, yet not so strong as to ignore or subvert civilian authority What is the dividing line between civilian and military spheres of activity How much influence should civilians have on activities within the military sphere, and how much influence should the military have in the civilian sphere How does all of this affect a states ability to both protect itself and project power globallyExamining the theory and practice of civilmilitary relations in the U.S. and the world, this course explores issues related to civilian control of the military and military professionalism, including coups detat, military disobedience, the impact of an allvolunteer vs. conscripted force on both civilian and military decisions, publicprivate partnerships in the military sphere, the role of military privatization in civilmilitary relations, and the role of servicemembers in the political life of the community. Relying on the influential texts of Lasswell, Huntington, Feaver, and Finer, the first half of the course aims to elucidate the theory behind basic tensions between the military and civilians. The second half of the course focuses on how theory translates into practice, with a particular focus on case studies of civilmilitary relations in the U.S. democratic system.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will learn, critically assess and apply the theoretical underpinnings of civilmilitary relations in the United States, many of which are broadly applicable across other advanced democracies. In doing so, students will identify and interpret diverse data sources to enrich inquiry, developing analytical, research, collaborative, and presentation skills, and will be able to engage with debates regarding civilmilitary relations in a democratic setting in both a historical and present context.",
                                                    "key_topics":  "The course will cover the theory, history, and contemporary challenges of civil-military relations, with a particular focus on U.S. civil-military relations. The theoretical frameworks introduced in the course have broad applicability beyond the U.S. case to contemplate civil-military relations in other advanced democracies.",
                                                    "prerequisite_knowledge":  "None. Familiarity with U.S. government processes and American political history is helpful, but not required.",
                                                    "assessment_structure":  "Class discussion, 3-4 topic tests, one group presentation research proposal and then final oral presentation with slides",
                                                    "relevance":  "DC GenEd: Contextual Thinking\n\nUniversity students will be better prepared to comprehend headlines and engage with policy debates about civilian influence in military affairs and military influence on politics at home and abroad.",
                                                    "learning_resources":  "Most readings will be readily available online or posted on Canvas; 1-2 books will be required and recommended for purchase.",
                                                    "extra_time_commitment":  null
                                            }
}