{
        "code":  "84-326",
        "name":  "Theories of International Relations",
        "short_name":  "THEORIES INTL RELTNS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course introduces students to the discipline of international relations IR. In the first half of the course, students review the modern history of IR from colonialism to today and are introduced to core concepts such as the national interest, power, and international order. Students also survey a broad range of IR theories, including grand paradigms from realism to constructivism, mainstream midlevel theories that help explain global politics and aid in foreign policy analysis, as well as critical, feminist, and nonwestern IR theory. The second half of the course introduces students to the two major subfields of IR, namely security studies concerned with the causes of war and peace, the politics of alliances, etc. and international political economy concerned with the causes of protectionism and free trade, the politics of economic tools of statecraft such as foreign aid, sanctions, etc.. The course ends by considering contemporary challenges posed by armed nonstate actors, climate change, and various threats to the postWorld War II liberal international order. This course should help students to better understand the world we live in and equip students with tools for analyzing various international events and foreign policy challenges.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://www.cmu.edu/ips/courses/undergraduate-courses/84326-theories-of-international-relations.html",
        "custom_fields":  {
                                                    "goals":  "Understand, critique, compare, and synthesize theories of international relations Be familiar with key IR concepts such as anarchy, order, sovereignty, and power Apply midlevel international relations theories to specific historic or contemporary problems in world politics. Read arguments about world politics thoroughly and thoughtfully Assess the strengths and weaknesses of various approaches to the study of IR Analyze challenges facing the US and the world from different perspectives",
                                                    "key_topics":  "Political science, international relations, security studies, international political economy, theory, power.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "There will be reading quizzes (20%), two short papers (35%), and two in-class exams (45%).",
                                                    "relevance":  "Required course for IPS degrees.",
                                                    "learning_resources":  "There will be one textbook for purchase (~$50, less if used/rented). All other readings will be available on Canvas or otherwise free online.",
                                                    "extra_time_commitment":  null
                                            }
}