{
        "code":  "84-365",
        "name":  "The Politics of Fake News and Misinformation",
        "short_name":  "FAKE NEWS MISINFO",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In this course, we will examine the drivers and dynamics of misinformation, fake news, and related phenomena in social and political life. From wartime atrocity propaganda to climate denialism to false claims of election fraud, how can we characterize fake news and misinformation, and why do they often spread so widely What are the factors that explain why people accept or reject them, and what are their consequences for our political behavior Finally, how can they be successfully countered and combatted In this course, we will look at these and other questions, drawing on the fastgrowing body of research on the topic from a range of fields including psychology, communications, political science, and computer science.  In terms of the courses structure, we will first focus on defining and characterizing fake news and misinformation, and next we will examine their production why are they created, consumption why are they believed, and consequences what influence do they have. Then, we will analyze the threat of misinformation in several important contexts  including COVID19, climate change, and armed conflict  and finally we will consider research and analysis about how to best counter it. For the final assignment in the course, students will build on what they have learned throughout the semester to write an original research paper applying ideas and arguments from class to a case of fake news or misinformation that is of special interest to them.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Examine the key political and psychological theories surrounding misinformation and how to adapt and apply them to different contexts.Analyze what the literature tells us about why fake news and misinformation are created, why they spread, and how they should and should not be countered.Conduct rich case study analyses with primary and secondary sources on the beliefs of relevant communities.Describe the development and trajectory of misinformation over time in a variety of key domains.Develop tools to identify, resist, and challenge fake news and misinformation in their personal and professional lives.",
                                                    "key_topics":  "This course analyzes the threat of fake news and misinformation in social and political life. From conspiracy theories about COVID and climate change to misinformation about political violence and conflict, how can we characterize fake news and misinformation, and why does it often spread so widely? What are the factors that explain why individuals accept or reject it? And what are its consequences for our political behavior? In this course, we will explore these and other questions about fake news and misinformation, drawing on the fast-growing body of research on the topic.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Students will have regular reading quizzes throughout the semester to ensure they absorb the material, while building toward a mid-term proposal and ultimately a final research paper in which they do an in-depth analysis and application of theories from class to a case of fake news or misinformation that is of interest to them.",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Deciding\nDietrich GenEd after Fall 2021: Contextual Thinking\n\nFake news and misinformation is one of the defining issues of our times, and will affect students in a wide range of future careers, from health to climate to politics and beyond. This course will give students more tools to identify, resist, and challenge fake news and misinformation in their personal and professional lives.",
                                                    "learning_resources":  "The course will rely mostly on research articles on the dynamics of fake news and misinformation, supplemented by other types of written materials (book excerpts, journalism, policy reports) to give students a holistic understanding of the issue. All required resources will be posted on Canvas, though there are some optional and recommended texts that can be purchased.",
                                                    "extra_time_commitment":  "None. Extra credit can be earned by attending talks and events related to course issues."
                                            }
}