{
        "code":  "84-386",
        "name":  "The Privatization of Force",
        "short_name":  "PRIVITAZTN OF FORCE",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course considers different forms of privatized force and security over time and across various strategic contexts, from historical mercenarism up to modernday private military and security contractors. While going through the historical and modern material chronologically, the course considers the various issues that arise with each form of privatized force, including questions that arise regarding the states monopoly on violence, legal and humanitarian issues, and civilmilitary relations. These range from theoretical concerns regarding modern definitions of the state, to practical operationallevel concerns pertaining to field coordination issues between the military and private contractors in modern conflicts.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course students should be able to Identify the arguments and propositions of the leading theories pertaining to force privatization understand the evolution of the privatization of force throughout history distinguish among different explanations for the privatization of force throughout history, with reference to the readings understand the key issues and debates surrounding the privatization of force today assess the strength and weaknesses of various approaches to the study of force privatization and develop an analytical stance with regard to pertinent issues related to the privatization of force in todays world.",
                                                    "key_topics":  "This course considers different forms of privatized force and security over time and across various strategic contexts, from historical mercenarism up to modern-day private military and security contractors. While going through the historical and modern material chronologically, the course considers the various issues that arise with each form of privatized force, including questions that arise regarding the state\u0027s monopoly on violence, legal and humanitarian issues, and civil-military relations. These range from theoretical concerns regarding modern definitions of the state, to practical operational-level concerns pertaining to field coordination issues between the military and private contractors in modern conflicts.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "There will be extensive reading, short reading comprehension/opinion papers, a mid-term exam, and a research presentation.",
                                                    "relevance":  "This is an elective course that will enforce and enhance student knowledge of international relations theory and global strategic issues.",
                                                    "learning_resources":  "Students will be required to read extended portions of several key texts. The other course readings - both articles and book chapters - will be available on a Canvas site.",
                                                    "extra_time_commitment":  "In addition to time spent on weekly reading and occasional short writing assignments for class, students will need to plan to spend time performing self-directed research for the end-of-year research project."
                                            }
}