{
        "code":  "84-380",
        "name":  "US Grand Strategy",
        "short_name":  "US GRAND STRATEGY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This class examines different philosophies of US strategy toward other countries and how US strategies impact people in other times and places. By doing so, students are both exposed to different ideas about US foreign policy than they may have otherwise, along with how those ideas interact with diverse populations both inside the United States and around the world. In some instances, those strategic ideas work well in some places but not in others because of particular ethnic, historical, religious, or other background issues in that place. The class presents a series of four main proposed US grand strategies, many of which students will not have encountered before, depending on their background. We then cover how each of those grand strategies is promoted by different groups in the United States, how it interacts with the world, and how it is received by people in diverse sets of other countries. This encourages students to examine their preexisting assumptions about what US strategy should be, both by looking at it through the lens of different American groups and different regions of the world.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will emerge from this class better able to articulate what place the United States occupies in the world, explain past strategic outcomes, and make informed recommendations for paths forward in American grand strategy.",
                                                    "key_topics":  "U.S. Foreign Policy, U.S. Military Strategy, U.S. Economic Policy, Cold War, War on Terrorism, Democracy Promotion, Global Competition",
                                                    "prerequisite_knowledge":  "Basic knowledge of the U.S. government and international politics.",
                                                    "assessment_structure":  "Students will have consistent small assignments throughout the semester and one semester-long project with multiple graded components.",
                                                    "relevance":  "This course will provide students a better understanding of historical American grand strategy, tracing contemporary problems to their historical root causes, how American decision makers have previously dealt with the problem encountering the United States around the world, the constraints that policy makers work within, and the options currently available to policy makers in formulating a global strategy to deal with threats and opportunities for the United States.",
                                                    "learning_resources":  "Articles for class will be made available for students online. Disability Resource office for those requiring accommodation.",
                                                    "extra_time_commitment":  "None beyond the usual requirements to read the course material and work on their assignments outside of class."
                                            }
}