{
        "code":  "84-390",
        "name":  "Social Media, Technology, and Conflict",
        "short_name":  "SOCIALMEDIA CONFLICT",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will examine the role that social media and technology have had on conflict at multiple levels, both between and within nations. Interconnectedness has expanded dramatically and continues to expand, allowing the formerly disconnected individuals with shared political views, states and diaspora populations to be intimately connected. The Arab Spring uprisings were significantly influenced by the use of cell phones, social media, and textmessaging as organizing tools. Insurgent groups like the Islamic States harnessed the power of social media and emerging technologies, and now extremist groups in the US and Europe are using Twitter, YouTube, Telegram and other social media platforms to their advantage. Information war is a critical factor in Russias invasion of Ukraine,  as both sides work to supportexploit kinetic warfare. Social media is used both to recruit for and fund violent extremism, while the internet has become a channel for radicalizing individuals into violent ideologies. Loss of trust in media and institutions, and the proliferation of misdisinformation, conspiracy theories, and malign information operations over social media has introduced a new dimensions to conflict and relations between individuals, small groups, nonstate actors, and nationstates.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The goals for this course are to familiarize students with how emerging technologies, to include social media, is changing the nature of warfare and how both states and nonstate actors fight.",
                                                    "key_topics":  "social media, civil wars, emerging technologies, globalization, conflict, regulation, non-state actors, mis/disinformation",
                                                    "prerequisite_knowledge":  "No pre-requisite knowledge per se, but familiarity with various types/forms of social media platforms, how they work, etc. would be useful.",
                                                    "assessment_structure":  "Students will be assessed according to the following grading schema: class participation (25%); mid-term examination (25%); group presentation (25%); final paper (25%).",
                                                    "relevance":  "This course will explore contemporary case studies of conflict (civil war, insurgency, inter-state conflict) and how social media and emerging technologies impacted those conflicts.",
                                                    "learning_resources":  "The instructor will provide a multi-modal experience with books, journal articles, in-class videos, think tank reports, websites, blogs, etc.",
                                                    "extra_time_commitment":  "The instructor regularly uses Canvas to email out newspaper articles referencing current events related to the intersection of social media/technology/conflict for students to read (optional, not mandatory)."
                                            }
}