{
        "code":  "84-323",
        "name":  "War and Peace in the Contemporary Middle East",
        "short_name":  "WAR \u0026 PEACE MID-EAST",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course examines the drivers and dynamics of war and peace in the contemporary Middle East. It is structured around a series of key debates about different facets of conflict and violence in the region, such as the causes of rebellion, the reasons resistance groups use terrorism, and the factors that facilitate peace. We will delve into competing arguments about each of these issues, applying the ideas to cases around the region. We will also examine broader regional conflicts like the ArabIsraeli dispute and SunniShia confrontation.  We will use a mixture of research articles and books as well as more diverse materials such as war reporting, films, and memoirs in order to create a holistic understanding of these issues.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "In this course, students will 1 build knowledge of the drivers and dynamics of human conflict, with applications to some of the most salient conflicts in the world today, 2 gain a working social and political understanding of the modern Middle East, 3 integrate their theoretical knowledge of conflict with contextual knowledge of the Middle East to analyze specific conflicts around the region, and 4 identify and examine distinct narratives around some of the worlds most contentious conflicts, such as the IsraeliPalestinian dispute and the ShiaSunni confrontation, gaining cultural awareness needed to navigate a diverse world.",
                                                    "key_topics":  "As we explore different theoretical dimensions of conflict and apply them to cases around the region, students will also take many different perspectives, including those of beleaguered civilian populations (how do they survive?), leaders of resistance movements and campaigns (how do they effectively resist?), repressive dictators (how do they stay in power?), and so on, helping them interpret the world through new perspectives and lenses outside their own.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Students will have map and reading quizzes to ensure that they absorb the material throughout the course. In addition, they will participate in a week-long end-of-semester simulation experience in which they play different leaders attempting to resolve a regional crisis. They will complete a series of preparatory worksheets that build toward this simulation and participate actively in the experience.",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Deciding\nDietrich GenEd after Fall 2021: Foundations - Intercultural and Global Inquiry\n\nIn learning about contemporary conflict and the Middle East, this course will not only make students more informed citizens but also prepare those who are interested for potential careers in fields such as national security, conflict resolution, and foreign policy.\n\nIn addition, the course will also help build students\u0027 ability to understand diverse and competing worldviews, and use their own concrete personal experiences as a window into other political perspectives, more broadly.",
                                                    "learning_resources":  "The course will rely on a mixture of research articles and books as well as more diverse materials such as war reporting, films, and memoirs in order to give students a holistic understanding of these issues. Most resources are posted on Canvas, though there are some optional and recommended texts that can be purchased.",
                                                    "extra_time_commitment":  "None. Extra credit can be earned by attending talks and events related to course issues."
                                            }
}