{
        "code":  "84-352",
        "name":  "Representation and Voting Rights",
        "short_name":  "VOTING RIGHTS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "What does it mean to be represented Who is represented, who is not What is the nature of that representation In practice, does representation result in policy congruence In this course, we will explore the concept of representation, what it means in theory, and how it works in practice. We will investigate the theoretical underpinnings of representation from a democratic norms perspective, the legal and constitutional nature of U.S. institutions, and evaluate empirically how well represented the public is. The class will have a central theme of how race and racial attitudes affect representation. Voting rights, the Voting Rights Act, and subsequent court cases will be highlighted.  In the United States, legislative elections are held in singlemember districts, which require the drawing of district boundaries every decade. The course will culminate with a final project in which we will draw electoral maps that could act as alternatives or remedies to maps enacted this decade.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will learn to use concepts from law, political science, math, sociology, and computer science to understand the political world as it relates to voting and elections. They will be able to identify the strengths and weaknesses of different electoral systems with respect to representation and policy outcomes. They will be able to connect voting rights to groups experiences and opportunities. Students will explore what voting rights mean to different communities, how these differences help inform us about needed areas of improvement, and how institutional design affects incentive structures. This includes how institutions can create disadvantages for minority groups when decisions are made by majority rule. Given the differences in voting rules, students will be able to show how the choice of electoral system can overcome structural discrimination against minority groups.Students will learn about the US Census and decennial reapportionment. They will develop the necessary skills to design legally compliant political districting maps. They will explore how legislative district lines can differentially affect groups, potentially leading to reduced representation, especially for marginalized groups. Students will learn how to analyze maps using common data techniques. They will be exposed to advanced techniques from computer science and mathematics. Students will create a plan for reducing inequality in voting rights and a more equitable society.By the end of the course, students will be able to use methods from their own discipline to identify and improve on deficiencies in voting systems, and use methods from other disciplines can enhance approaches to solving problems of democracy.",
                                                    "key_topics":  "Electoral systems, right to vote, the Voting Rights Act, formal, substantive, descriptive, and symbolic representation, redistricting, gerrymandering, one person, one vote, policy congruence",
                                                    "prerequisite_knowledge":  "None required. This course will begin with the most basic understanding of democratic processes and attempt to \"build the puzzle\" of the complex systems that make up our representative democracy.",
                                                    "assessment_structure":  "In-class attendance and participation, discussion board posts, and a seminar paper or project will be the primary means of assessment. Students will also analyze redistricting plans and prepare two redistricting maps to show one plan that is fair and one that has racial / partisan bias.",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Deciding\nDietrich GenEd after Fall 2021: Equity and Justice\n\nRepresentation is fundamental to modern government. Understanding how governments respond to public opinion, electoral outcomes, and public sentiment more broadly is key to understanding how republics maintain credibility. Though this class will most squarely focus on the United States, other democratic institutional arrangements will be used for comparison. Recent anti-majoritarian outcomes in the United States have led scholars and the public generally to question the elite-mass electoral link. One particularly crucial aspect of this is in the manipulation of legislative districts, better known as Gerrymandering. We will spend several weeks on the provisions of the U.S. Constitution that require the redrawing of legislative districts every decade, including in 2021. Beyond simply learning about this process, we will draw districts using geographic information systems software. The work product produced in this course can be delivered to state and local governments as public input into the redistricting process.\n\nSuccess in this course has the potential to lead to summer internships. Multiple tracks will be offered for those more interested in the computer science, mathematics, legal, or geographic aspects of redistricting.",
                                                    "learning_resources":  "Several inexpensive course texts are required, and other materials are provided through Canvas.",
                                                    "extra_time_commitment":  null
                                            }
}