{
        "code":  "84-325",
        "name":  "Contemporary American Foreign Policy",
        "short_name":  "CONT AM FOREIGN POL",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course provides a survey of American foreign policy since World War I as a means of explaining why American foreign policy looks the way it does today. We will cover topics such as Americas perennial battles between isolationism and internationalism, the creation of the USled world order after 1945, the containment of communism, and antiterrorism after 911. We will cover enduring and global issues like climate change, nuclear nonproliferation, humanitarian intervention, and international economic policy, as well. Further, a main focus of the course is how foreign policy is made  the role each branch of government plays in foreign policy making, the impact of domestic politics and public opinion, and how other countries receive and react to American foreign policy. The course will use both history and data analysis to understand how foreign policy works, how it is made, and its effect both at home and abroad. A good grasp of the 20th century American and world history, and some familiarity with international relations theory are not requirements but will prove helpful. By the end of the semester, students should have acquired a broad understanding of the most important foreign policy events of the last century and have the tools to analyze foreign policy decisionmaking.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The main objective of this course is to offer an opportunity for students to understand the machinery and decisionmaking of American Foreign Policy in a global context how domestic politics affect foreign policy the role of institutions how all of these issues create and dictate foreign policy decisions and how different populations around the world have been impacted by American Foreign Policy. At the end of the course, students will be able to Understand how different facets of the American system of government combine to make foreign policy. Identify what decisions are feasible within the American system of government. Discuss the different traditions of American Foreign Policy from WWI that contextualize current debates on foreign policy issues. Have a firm grasp on specific American Foreign Policy issues, and how different cultural contexts in both the United States and abroad lead to varying interpretations of the right course of action for American Foreign Policy. Develop their own beliefs on the right course for American Foreign Policy on a range of issues, based on who is prioritized in each specific policy and what values drive policy choices.One of my main goals will be to facilitate class discussions in a 360 degree mannerbetween the instructor and the students, and between the students themselves. My goal is to get students to move beyond mere memorization, and to attain higherorder thinking skills, including the application of key concepts, definitions, and contexts, evaluating assigned readings in a critical manner, and offering educated opinions.",
                                                    "key_topics":  "United States Foreign Policy, Diplomacy, Interventions, Wars, Covert Action, International Relations, History, Foreign Policy Analysis, Politics",
                                                    "prerequisite_knowledge":  "No prerequisite knowledge, but some familiarity with contemporary global and American history and US political institutions, as well as some knowledge of International Relations theory, will be helpful.",
                                                    "assessment_structure":  "Students will participate in class discussions, in-class quizzes, reading responses, and a semester-long policy recommendation project with paper and presentation.",
                                                    "relevance":  "DC GenEd: Contextual Thinking\n\nThis course is particularly relevant for CMIST majors interested in pursuing a career in foreign policy or national politics, but should also be of interest to students who simply want to be informed consumers of news or more engaged citizens.",
                                                    "learning_resources":  "Books, articles, interactive web resources, and in-class games. All readings will be available for free on canvas.",
                                                    "extra_time_commitment":  null
                                            }
}