{
        "code":  "84-336",
        "name":  "Implementing Public Policy:  From Good Idea To Reality",
        "short_name":  "IMPLEM PUBLIC POLICY",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Good public policy doesnt just happen.  Rather, successful policy is the result of thorough research, careful drafting, and successful navigation within the government or nongovernment organization whose leadership may ultimately promulgate it.  The course begins with a brief review of government and organizational behavior in a bureaucracy, and the identification of a federal agencys policy system as a framework to which we will turn throughout the term.  Study then shifts to an overview of several legal concepts and research skills applicable to federal policy and regulations.  Though usually the province of law students and attorneys, such skills enable Students to know when policy may be crafted from scratch  or where, when, and how policy must conform to larger governing legal or regulatory structure.  Students then consider a particular public policy subcomponent, administrative law, which addresses the special circumstance of regulatory agencies and the statutory regimes that create and govern the federal policies created thereunder.  The course culminates with Students developing and staffing a notional policy, modeled on the federal agency policy system model studied throughout the term.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Understand and analyze an organizational structure in which policy is made and implemented.Understand and demonstrate the ability to think and write like a successful member of the organization in which policy is made.Understand and apply basic legal research skills critical to successful public policy development at the federal level.Distinguish policies that are discretionary in nature from those required by legal mandateComprehend the special case of federal public policies promulgated by regulatory agencies, which are part of the general category of administrative law.Recognize the importance of, and apply, precise language in policy drafting.Develop, notionally staff, and present a draft policy responsive to a current public policy issue.",
                                                    "key_topics":  "Political Science; U.S. Government; Law and Legal Research; Organizational Behavior; Policy",
                                                    "prerequisite_knowledge":  "Excellent writing and critical thinking skills. Basic understanding of, or desire to learn about, the U.S. Constitution and governmental functions thereunder. Civics/government class, or other coursework on the basic structure of the U.S. Government and political system will be helpful.",
                                                    "assessment_structure":  "Multiple small written memos, most using a structured format; One large writing project; critical review of others\u0027 written products; oral presentations; class participation.",
                                                    "relevance":  "This course may benefit a range of audiences: students considering government and related policy careers; future business leaders who must set standards for business practices, employee behavior, or operations within the confines of governmental regulations; prospective paralegals and attorneys; or anyone interested in exploring \"what the rules are\" and why.",
                                                    "learning_resources":  "Two softcover books (Student purchase); computer and on-line materials; laptop computer with Microsoft Office; Microsoft Word Track Changes",
                                                    "extra_time_commitment":  "Law School or Law Library Tour"
                                            }
}