{
        "code":  "84-322",
        "name":  "Nonviolent Conflict and Revolution",
        "short_name":  "NONVIOLENT CONFLICT",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "How can everyday people promote justice, equality, and democracy Throughout history, many have looked to armed struggle and revolutionary violence. But over the course of the last century, nonviolent people power movements from Gandhis salt march to the Arab Spring to Black Lives Matter  have been forces for social and political change. What are the causes, strategies, tactics, dynamics, and consequences of nonviolent conflict, and how do these differ from violent or armed conflict When and how do unarmed people power campaigns topple repressive authoritarian regimes This course addresses these questions, and, in the process, engages contending theories of power, revolution, and insurgency. The course introduces students to key concepts, theories, strategies, and historical patterns of nonviolent conflict. The class probes the success and failure of nonviolence by analyzing landmark unarmed revolutions.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The main objective of the course is to enable students to understand the theory, history, practice, trends, and challenges of civil resistance as a means of promoting justice. By the end of the course, students should be able toEngage with political science, peace science and sociology perspectives to explore origins, dynamics, and outcomes of nonviolent conflicts in historical context.Dissect the structures of power and pillars of support that uphold unjust regimes.Compare and contrast the strengths and weaknesses of violent and nonviolent tactics for promoting peace, justice, and democracy.Assess the prospects for the onset or outcome of nonviolent conflict in a specific country.",
                                                    "key_topics":  "The course will cover the history, practice, and theory of nonviolent conflict and revolution. Key topics include the strategy of civil resistance, security force defections, repression, and transnational social movements.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "There will be periodic reading quizzes, a series of country case study assignments culminating in a final paper, and a class presentation at the end of the semester.",
                                                    "relevance":  "Dietrich GenEd Prior to Fall 2021: Deciding\nDietrich GenEd After Fall 2021: Equity and Justice\n\nStudents will better comprehend how \"people power\" movements promote social and political change without recourse to violence.",
                                                    "learning_resources":  "With the exception of 1-2 (affordable) books for purchase, all readings will be available on Canvas or otherwise free online.",
                                                    "extra_time_commitment":  null
                                            }
}