{
        "code":  "84-362",
        "name":  "Diplomacy and Statecraft",
        "short_name":  "DIPLOMCY \u0026 STATECRFT",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Diplomacy and statecraft are the driving forces behind foreign policy and international politics. In the first part of the course, students are introduced to the concepts, theories, and history of diplomacy. Students survey examine key cases and statesmen and women in great power politics from the Congress of Vienna to the present. Finally, the class surveys contemporary diplomatic challenges related to international security, major power relations with Russia and China, human rights and democracy promotion, and nontraditional transnational threats human trafficking, global climate change. Both in the classroom and in writing, students are encouraged to think, act, and write like diplomats and to appreciate diplomacy as a vocation. Throughout the course, students build skills in foreign policy memo writing, participate in diplomatic roleplaying simulations, build cultural intelligence, and connect diplomatic trend lines with todays international headlines.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The main objective of the course is to enable students to understand the theory, history, practice, and challenges of diplomacy and statecraft. By the end of the course, students should be able toComprehend strategy and foreign policy decisionmaking in international politicsRecognize major stateswomen, key ideas, and milestones in modern diplomatic historyEmploy best practices and tactics of international negotiation and bargainingCultivate cultural intelligence in the practice and analysis of statecraft.Use history appropriately and judiciously to inform contemporary foreign policy debatesWrite a culturally and historically informed, persuasive, concise, and timely foreign policy memoGive an oral policy briefing presentation on a contemporary diplomatic challenge",
                                                    "key_topics":  "diplomacy and statecraft, international negotiations, foreign policy memo writing",
                                                    "prerequisite_knowledge":  "no prior knowledge required",
                                                    "assessment_structure":  "There will be reading quizzes, role-playing simulations, a series of foreign policy memo writing assignments, and a class presentation.",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Deciding\nDietrich GenEd after Fall 2021: Foundations - Intercultural and Global Inquiry\n\nUniversity students will be better prepared to comprehend international headlines and engage with policy debates on current foreign policy challenges.",
                                                    "learning_resources":  "With the potential exception of one (affordable non-text)book for purchase, all readings will be available on Canvas or otherwise free online.",
                                                    "extra_time_commitment":  null
                                            }
}