{
        "code":  "84-320",
        "name":  "Global Perspectives on International Affairs",
        "short_name":  "GLBL PERS INTL AFF",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "International Relations as a field of study is, ironically enough, not very international. Having originated in the United Kingdom and United States in the early 20th century, it still draws mostly from American and European experiences and philosophies, and focuses disproportionally on those countries and their concerns. This shapes the questions we ask and how we answer them. The result are blindspots and limitations that become ever more apparent as we try to make sense of an increasingly globalized world in which nonWestern societies play a more salient role. In this course, students will rethink international politics from the vantage points of GlobalSouth countries, and learn about how their historical experiences and philosophical traditions inform perspectives on contemporary international relations, shaping both national strategies and regional and global politics. We will discuss the role of culture, identity, and ideology in foreign policy, and explore dynamics of inequality, status, hierarchy, and authority in international politics. Students will read and discuss materials from scholars and policymakers hailing from Asia, Latin America, Africa, and the Middle East.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The overarching goal of this course is to help students become more attuned to different perspectives on international relations. At the end of the semester students should be able to Identify the underlying structure of arguments assumptions, logical coherence, etc. of scholarly and policy writings. Formulate their own arguments based on evidence qualitative or quantitative, logic, and theory. Defend and critique arguments in simulated debates. Conduct independent research and dig deeper into the historical and contemporary foreign policies of different countries. Analyze current issues in international relations from different perspectives.",
                                                    "key_topics":  "International Relations, Foreign Policy, History, Philosophy, Inequality, Hierarchy, Authority, Culture, Identity, Asia, Latin America, Africa, Middle East",
                                                    "prerequisite_knowledge":  "No prerequisites, but some familiarity with contemporary global history, as well as some knowledge of International Relations theory, will be helpful.",
                                                    "assessment_structure":  "Students will participate in class discussions and debates, take short quizzes, and write short research papers.",
                                                    "relevance":  "This course is particularly relevant for IRP majors interested in pursuing a career in foreign policy in the US or elsewhere, but should also be of interest to students who simply want to broaden their horizons and be more engaged global citizens.",
                                                    "learning_resources":  "Books, articles, blogs, twitter, newspapers, magazines, archives, movies.",
                                                    "extra_time_commitment":  null
                                            }
}