{
        "code":  "85-242",
        "name":  "Intro to Health Psychology: Methods of Inquiry",
        "short_name":  "HLTH PSYC MTH INQY",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is an introduction to the basic principles of health psychology, and the research methods that allow the field to investigate how psychological and social factors get under the skin to influence health and disease. Following the WHOs definition of health, we will discuss health as a state of physical, mental, and social wellbeing, and not just the absence of disease. This course will provide students with the conceptual and research basics to critically study the field of health psychology. An emphasis will be placed on understanding the type of research methods that are employed by health psychologists. Epidemiological concepts, longitudinal and experimental research designs, and health outcome measurements will be explored indepth. At the end of the course, students will have a further understanding of health psychologys biopsychosocial approach to health and will be able to describe the methods of inquiry that lead to meaningful discoveries in the field. This knowledge will also be applied to establishing skills in the reading and interpreting of research literature. In providing a better understanding of the field of health psychology and its methods of inquiry, students will be provided the knowledge and skills needed to fully engage with other health psychology courses that are more specialized in scope 85252 and 85258",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}