{
        "code":  "85-251",
        "name":  "Personality",
        "short_name":  "PERSONALITY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The primary purpose of personality psychology is to understand human uniquenesshow and why it is that one person differs from others, in terms of the ways that they thinks, feels, and acts. Students in the course will be exposed to several broad theoretical perspectives, each of which attempts to capture and understand the origins and consequences of individual distinctiveness from a slightly different vantage point. Included among these approaches are the dispositional or trait, psychoanalytic, learning, humanistic, and cognitive self regulation perspectives. This is a survey course and is intended to provide students with a broad background of theory and research in the area. Class meetings consist primarily of lecture, but there is some discussion too. Students will be given the opportunity to assess their own personalities during the course. A consistent theme throughout the course is the relationships between aspects of ones personality and physical health.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1. Describe how psychologists think about personality, measure it, and do research in thearea2. Describe and explain the major theories of personality and personality functioning3. Understand some of the origins of personality4. Evaluate evidence that links personality characteristics and functioning to physical healthe.g. mortality5. Apply theories of personality to inform a more complete understanding of human behavior6. Identify some of your personality characteristics and understand how they might impactyour experience the world",
                                                    "key_topics":  "Students in the course will be exposed to several broad theoretical perspectives, each of which attempts to capture and understand the origins and consequences of individual distinctiveness from a slightly different vantage point. Included among these approaches are the dispositional or trait, psychoanalytic, learning, humanistic, and cognitive self regulation perspectives.",
                                                    "prerequisite_knowledge":  "no prior knowledge needed",
                                                    "assessment_structure":  "There will be 4 noncumulative exams spaced throughout the semester. There will also be periodic quizzes. There will be no final exam.",
                                                    "relevance":  "The focus of this class is on individual differences among people. It is about understanding the unique set of characteristics that each of us possess that differentiates us from other people in terms of the manner in which we think, feel, and behave. The uniqueness we all feel forms a core aspect of our sense of identity. College is a time of transition, as people move from adolescence and living at home to adulthood and independence. Such transitional periods are important in that they often provoke a need to rethink who we are and what we are about. The content of this course might provide a useful framework to help you understand what it is that defines you as uniquely you, and thereby help with some of the personal mulling that might be going on at this point in your life.",
                                                    "learning_resources":  "There is a textbook. Class time is largely devoted to lectures and associated questions and answers. Students will have the option to gain extra credit by creating \"personality logs,\" in which they apply the principles discussed in the course to real world events and their own experiences.",
                                                    "extra_time_commitment":  "Based on FCE\u0027s, students spend an average of between 6 and 7 hours a week reading the text, studying for exams, and preparing their personality logs (if they so choose)."
                                            }
}