{
        "code":  "85-364",
        "name":  "Environmental Psychology",
        "short_name":  "ENV. PSY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "TBA",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1.Acquire a repertoire of facts, terminology, definitions, methods, and key concepts about the situations, behaviors, and outcomes environmental psychologists study 2.Recognize the twoway interaction between humans and the natural and built environments and appreciate the critical role of thoughts, feelings, and behaviors in creating environmental problems and solutions3.Analyze and critically evaluate ideas, arguments, and points of view using course material, especially research material 4.Apply course knowledge to environmental problems related to self and community through course projects which address challenges and opportunities for increasing proenvironmental behaviors5.Apply basic behavioral research methods to environmental issues6.Understand how cognitive processes, social, situational and motivational factors, motivation and individual differences play into environmental behaviors7.Critically understand the challenges and opportunities for increasing proenvironmental behaviors8.Evaluate the current literature in environmental psychology with a local and global lens",
                                                    "key_topics":  "-Cognitive Psychology related to Environmental Psychology: e.g. Decision making, Perception, Nudging, Attention, Attitudes, Behavior, Memory\n-Clinical Psychology related to Environmental Psychology: Climate Anxiety and emerging trends in this area\n- Neuroscience of Environmental Psychology: Do brains need nature? And related topics\n- Experiential Learning/Nature Matters/Green, blue and beige spaces and their influence on human well being",
                                                    "prerequisite_knowledge":  "Cognitive Psychology 85211 or Social psychology 85241\nExpected to be willing to engage in class activities outside of regular class-time for field\ntrips and group project work.",
                                                    "assessment_structure":  "TBD",
                                                    "relevance":  "Environmental issues, such as climate change, biodiversity loss, environmental degradation and the overconsumption of resources, are a few of the pressing problems facing our world and are topics that the field of environmental psychology addresses. Foremost, environmental psychology studies the relationship between human behavior and the environment, both urban and natural, and how on the one hand, environment impacts human behavior, and on the other hand, how humans influence the environment. Essentially, environmental psychology aims to improve human behavior for the good of the planet and our shared future.\nIn this course, we examine psychological mechanisms behind behaviors that are both pro-and contra-environmental and use insight from research to design and discuss interventions to increase pro-environmental behaviors. We will explore both individual factors (cognitive processes, motivation, behavior change, connection with nature) and social factors (cultural worldviews, group relationships, media messages, social movements), with a special consideration for the local context. We will also examine how individual and societal narratives form ideas about the environment, and explore our own ecosophy while engaging in critical self-reflection. Throughout the semester, students will apply the course content to real-life experiences (i.e. exploring natural and urban environments while working on assignments; engaging with community researchers and activists) and will work on research-informed (stewardship) projects at the levels of self and community.",
                                                    "learning_resources":  "Natural world, scientific articles, popular culture, books, case studies, websites, field trips and experiential learning",
                                                    "extra_time_commitment":  "Yes. This course will require students to make time outside of the regular class allotted time for field trips. This might be over lunch hours or on the weekends."
                                            }
}