{
        "code":  "85-342",
        "name":  "Social Influence",
        "short_name":  "SOCIAL INFLUENCE",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is designed to examine the complexities of social influence in both overt and hidden forms. We will explore classic research in the field of social influence and analyze the application of influence tactics to the decisions we make in everyday life. By examining relevant research we will analyze the mechanism by which various influence tactics work at both the individual level and the group level. We will also discuss the methods found to be effective in protecting individual from being the targets of unwanted pressures to comply with otherss requests and beliefs.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The primary goals of this course are 1 To understand the dynamics of conformity behaviors and how it can lead to both positive and negative behavior 2 To explore the mechanisms by which compliance techniques operate 3 Examine relevant theories and research in social influence and 4 Understand the complexities of obedience to authority.",
                                                    "key_topics":  "Conformity behavior, Obedience to authority, On-line influences, Compliance tactics",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Students will read empirical journal articles and lead class discussion based on these readings. Additional course requirements will involve weekly writing assignments and an in-depth analysis of a cult, highlighting the group\u0027s leader and the techniques these cults use to influence it followers.",
                                                    "relevance":  "This course will serve as an advanced course for the psychology major and minor. It can also be considered a general elective for those in other departments.",
                                                    "learning_resources":  "All readings (including empirical journal articles) will be posted on Canvas.",
                                                    "extra_time_commitment":  null
                                            }
}