{
        "code":  "85-360",
        "name":  "Origins of Intelligence",
        "short_name":  "ORGS OF INTELLIGENCE",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The nature and origins of human intelligence is a muchdebated topic. Questions about the evolution and development of intelligence in humans, how intelligence compares among animals, the basis of intelligence in the brain, how to create intelligence in machines, the role of genes and experience, and individual variability in intelligence are all areas of vigorous scientific inquiry. Popular folk views of intelligence that may be misguided or incorrect have shaped all levels of society from parenting to politics. There is no universally accepted definition of human intelligence but one conceptualization is the ability to remember, reason, plan, and solve novel problems. This course will explore scientific and popular views of the origins of intelligence. The approach will be to read popular science articles and books that deal with intelligence in humans, animals, and machines and locate the primary scientific work on which those claims are made in order to evaluate the rigor and validity of intelligence theories. The course assignments will primarily consist of oral and written critiques of theories and data on the science of intelligence.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "understand the diversity of cognitive abilities on earth, learn basic brain functions and organization, learn the many levels at which the brain and cognition can be shaped by evolutionary adaptation, phylogeny, experience, and development",
                                                    "key_topics":  "cognitive science, neuroscience, philosophy, education, brain development, animal cognition, evolution, artificial intelligence, society",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "slide presentations, written articles, discussion",
                                                    "relevance":  "the course is relevant to psychology majors because it teaches core concepts in human brain development and education at the intersection of science and society",
                                                    "learning_resources":  "science theory books, popular science books, primary research articles, podcasts, news articles",
                                                    "extra_time_commitment":  null
                                            }
}