{
        "code":  "85-414",
        "name":  "Cognition in the Age of AI",
        "short_name":  "COG IN THE AGE OF AI",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "((85-219 [] at least D) or (85-102 [] at least D) or (85-241 [] at least D) or (85-213 [] at least D) or (85-211 [] at least D) or (85-100 [] at least D) or (85-104 [] at least D) or (85-170 [] at least D) or (85-190 [] at least D) or (85-130 [] at least D) or (85-221 [] at least D) or (85-110 [] at least D)) and ((15-110 [] at least D) or (15-112 [] at least D))"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Advances in artificial intelligence and internetscale datasets have transformed our everyday lives. In this course, we will learn about ways that AI and large datasets are also transforming what we know about the human mind and brain. We will discuss recent research that uses tools like deep convolutional neural networks and large language models as model systems for investigating human cognition, and what we can learn by comparing model outputs against real human data. We will also examine the rise of big datasets in neuroscience and psychology research, and how these datasets are enabling powerful applications of machine learning to the study of human cognition. Compared to traditional approaches, these advances are making it possible to conduct more naturalistic psychology experiments, where tasks and stimuli more closely match the complexity of our realworld experiences. Throughout the course, we will consider how these tools are opening up progress on questions that have historically been challenging to study, such as how perception unfolds within complex natural environments, how we comprehend language, and how we learn about the world through experience. The course format will involve weekly readings and discussion.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  "AI, Data, research, neuroscience",
                                                    "prerequisite_knowledge":  "some programming language and general psych knowledge",
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}