{
        "code":  "88-150",
        "name":  "Managing Decisions",
        "short_name":  "MANAGING DECISIONS",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [
                                            {
                                                    "code":  "88-223",
                                                    "id":  6791,
                                                    "name":  "Decision Analysis",
                                                    "units":  12.0
                                            }
                                    ],
        "equiv":  [

                            ],
        "long_desc":  "We make decisions constantly, but making good decisions is hard. Future employers will pay handsomely for decisions that are well thought out, defendable, and understandable. How do we decide how to decide What is a good decision This course will introduce normative decisionmaking concepts, including how to formulate decision problems and techniques that account for uncertainty and time preference. Students will learn how to place a quantitative value on information. The course will introduce key decisionmaking concepts using applications from fields such as decision sciences, business and economics, and public policy. Although prior knowledge of Microsoft Excel spreadsheets is not required, prior familiarity with Excel and a general level of numeracy will be useful.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Identify how a decision problem is structured and its components Compare numerical values over time, both in the past and in the future, using common business valuation metrics such as NPV and IRR Calculate and use expected values to incorporate uncertainty into decision making Model decisions with decision trees and solve the decision trees to identify the optimal decisions and expected outcomes Determine how to use and value information to make good decisions Build spreadsheet models of business decision problems and use simulation techniques to understand the role of uncertainty in decision making Evaluate decisions made by others, including why even experts can fail to make good decisions Explain and model the role of cognitive and behavioral biases in judgment to illustrate how the use of heuristics can both help and hurt decision making. Communicate the results of a decision analysis to stakeholders.",
                                                    "key_topics":  "Introduction to general problem-solving skills to address real world problems utilizing normative decision-making techniques from business, economics, and psychology that teach students to frame and solve unstructured problems.",
                                                    "prerequisite_knowledge":  "No prior knowledge required",
                                                    "assessment_structure":  "There will be weekly homework assignments, one mid-term, and a final exam.",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Deciding\nDietrich GenEd after Fall 2021: Disciplinary Perspectives- Business",
                                                    "learning_resources":  "Students will be required to read material from an assigned textbook and online materials (available on Canvas). Use of Excel will also be required.",
                                                    "extra_time_commitment":  null
                                            }
}