{
        "code":  "88-130",
        "name":  "Behavioral Economics for Life",
        "short_name":  "BEHAV ECON 4 LIFE",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [
                                            {
                                                    "code":  "88-360",
                                                    "id":  5124,
                                                    "name":  "Behavioral Economics",
                                                    "units":  9.0
                                            },
                                            {
                                                    "code":  "88-302",
                                                    "id":  5415,
                                                    "name":  "Behavioral Decision Making",
                                                    "units":  9.0
                                            }
                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Are we humans or econs  Econs are analytical, make rational judgments and decisions, are deliberate and patient, and are able to perfectly implement their plans.  Humans, however, are influenced by emotions, have systematic biases in their judgment and decisionmaking, can be impulsive and lack selfcontrol, and often struggle implementing their plans.  College students and professors are humans and as such we sometimes procrastinate, eat poorly, dont get enough sleep, skip out on going to the gym, make money mistakes, feel lonely, misjudge others, inadvertently discriminate against others, engage in unnecessary conflict, and dont live up to our own ethical standards. This course teaches you the science of behavioral economicshow it developed and is evolving as a field and how it can help you to improve your life now during college and later in your professional life.  You will learn about evidencebased behavioral strategies and how they can help you to be happier, healthier and wealthier.  You will also have the opportunity to try some of these strategies yourself and reflect on whether to incorporate them into your daily routines.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The primary goals of this course are to enable students to1.\nIdentify the common challenges college students encounter in their daily lives that can impact their wellbeing, including issues related to physical, mental, and financial health.2.\nExplain the development of behavioral economics as a scientific discipline aimed at understanding the underlying causes of these problems.3.\nDescribe the key theories of human behavior in behavioral economics and how they explain decisionmaking processes.4.\nCritique the methods used by behavioral scientists to test and refine theories of human behavior through experimentation.5.\nArticulate the various interventions included in the behavioral economics toolkit and select a few to implement in their own lives to enhance wellbeing.6.\nIdentify the limitations of behavioral economics and understand the evidence base for when interventions are likely to be most effective in realworld applications.",
                                                    "key_topics":  "The course covers key topics in Behavioral Economics (BE), including the challenges faced by college students such as procrastination, poor eating habits, lack of sleep, financial mistakes, and more. It explores the development of BE as a science, theories of human behavior, and the role of behavioral experiments in refining these theories. Students will learn about the \"behavioral economics toolkit\" for improving life and the limitations and effectiveness of BE interventions.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Assessments include data collection assignments, a 101-day \"self-hack\" project with daily life practice and reflection, short writing assignments reflecting on course topics and personal experiences, quizzes to test understanding of key concepts, and participation in class discussions and activities.",
                                                    "relevance":  "Dietrich GenEd after Fall 2021: Foundations - Scientific Inquiry\n\nThis course fulfills the \"scientific thinking\" Dietrich general education requirement. It equips students with an understanding of behavioral economics and its application to real-world problems, particularly those encountered by college students. By learning about evidence-based strategies, students are empowered to make informed decisions that can enhance their well-being and professional success.",
                                                    "learning_resources":  "Learning resources for the course include textbook readings, academic articles and case studies, podcasts and videos related to BE topics, homework assignments with practical applications, and the online platform StickK for the self-hack project.",
                                                    "extra_time_commitment":  "Daily commitment of 10-20 minutes for the 101-day self-hack project, regular completion of homework assignments and preparation for quizzes, and participation in class discussions and activities."
                                            }
}