{
        "code":  "88-120",
        "name":  "Reason, Passion and Cognition",
        "short_name":  "REASN PASSN \u0026 COGNTN",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "How do we make decisions Reason, Passion, and Cognition will be an introduction to the psychology of preference, judgment, and choice. Why do people behave in ways that cannot be defended as rational  and how do these deviations inform us about the processes that the mind uses to make fastandfrugal decisions The course will focus on the ways that cognitive and emotional processes relate to decisions made in the laboratory and in everyday decision making and will be based on rigorous experimental research.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Throughout the course, the primary goals are to Learn about the academic field of judgment and decision making, explore the role of emotion and cognition in decisions, and examine the fields major theories and findings Become a consumer of research findings by learning how to critically examine behavioral science studies on a given topic Assess the quality of scientific theory and evidence by critically examining results of scientific studies and critiques Explain key concepts using substantive arguments from course materials that include the relevant scientific claims and counterclaims, providing reasoning and evidence to support your conclusions Learn and practice communication of scientific findings in poster format, combining written descriptions and visual aids, an individual verbal presentation, and a defense of your ideas Identify and understand methods for exploring questions posed in the academic field of judgment and decision making, particularly in isolating the role of emotion and cognition in decisions Develop your ability to synthesize across research findings and discuss their limitations.",
                                                    "key_topics":  "Introduction to psychology of preference, judgment and choice that informs everyday decision making",
                                                    "prerequisite_knowledge":  "No prior knowledge required",
                                                    "assessment_structure":  "Grades will be based on a combination of exams, weekly homework assignments, small in-class quizzes, collaborative group work, and a brief research requirement.",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Deciding\nDietrich GenEd after Fall 2021: Disciplinary Perspectives - Social Sciences\n\nThis course will help students acquire some practical skills for improving their own judgments and decisions.",
                                                    "learning_resources":  "Students will be required to read Kim\u0027s \"Judgment and Decision Making: In the Lab and the World\u0027\" along with additional course reading, which will be available for download on Canvas.",
                                                    "extra_time_commitment":  "Students will have the option to participate in two additional hours of selected research studies in the Center for Behavioral Decision Research (CBDR) or an alternate assignment summarizing published research articles for 1 extra credit percentage point. They will also have the opportunity to participate in a 1-hour Q\u0026A session about their poster session for an additional 1 extra credit percentage point. Students will work with a small group on their own time to create and execute a minor research project."
                                            }
}