{
        "code":  "88-252",
        "name":  "Causal Inference: from Data to Decisions",
        "short_name":  "CAUSAL INF: DATA DEC",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(36-202 [] at least D) or (85-309 [] at least D) or (70-208 [] at least D) or (36-309 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [
                                            {
                                                    "code":  "73-274",
                                                    "id":  5235,
                                                    "name":  "Econometrics I",
                                                    "units":  9.0
                                            }
                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Causal questions are pervasive in the social and behavioral sciences, and empirical researchers often use regression analysis as a tool for tackling such questions.  This course focuses on the scientific problem of analyzing causal hypotheses in realworld settings, not on the mathematical details of regression.  After clearly distinguishing prediction from causation, we discuss how to represent causal hypotheses and how to use regressions to analyze both predictive and causal hypotheses.     Using inclass data exercises throughout, we will examine how to move from an interesting but somewhat vague question about the world e.g., do police discriminate based on race and gender, do NFL athletes choke under high pressure, does parenthood improve happiness to a clear statistical model that, when estimated, meaningfully addresses the question asked.  The course emphasizes causal analysis as the main research goal and multivariate linear regression as the main statistical tool.  After mastering basic techniques, we will introduce students to more advanced econometric approaches such as panel regressions and instrumental variables to deal with trickier settings in which causal inference is more challenging e.g., do more guns lead to more violence.    In keeping with the handson philosophy of the course, a central focus of the semester will be a group research paperpresentation where students will have the opportunity to formulate and empirically test a research question of their choosing.  Students will learn how to find, clean, and analyze a new dataset, and then concisely communicate their findings in the form of a scientific paper and accompanying presentation.  The research project makes this course excellent preparation for any student who hopes to ultimately write an undergraduate thesis.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will learn how to find, clean, and analyze a new dataset, and then concisely communicate their findings in the form of a scientific paper and oral presentation. The research project makes this course excellent preparation for any student who hopes to ultimately write an undergraduate thesis.",
                                                    "key_topics":  "This course focuses on the scientific problem of analyzing causal hypotheses in real-world settings rather than the mathematical detail of the underlying methods. After clearly distinguishing prediction from causation, we discuss how to represent causal hypotheses and how to use regressions to analyze both predictive and causal hypotheses",
                                                    "prerequisite_knowledge":  "Must be familiar with basic statistical concepts",
                                                    "assessment_structure":  "There will be one mid-term exam, one final group project, three problem sets, four in-class lab assignments, as well as mandatory attendance and graded class participation",
                                                    "relevance":  "DC Gen Ed: Modeling-Other",
                                                    "learning_resources":  "The main program for data analysis is Stata. The 6-month student license may be purchased for $45.",
                                                    "extra_time_commitment":  null
                                            }
}