{
        "code":  "88-234",
        "name":  "Negotiation: International Focus",
        "short_name":  "NEGOTIATION: INTRNTL",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Most people think negotiation is all about strategies and tactics, that is what you do and say during a negotiation. However, negotiation is best understood by analyzing the contextual environment in which the negotiation takes place. This class focuses on negotiations that take place across international borders and examining how the features of the negotiation environment drive the negotiation process and ultimately the results. We will show how features such as the historical relationships between the parties, the constituents and political environment, the cultural norms, alternatives to a negotiated agreement, linkages to future negotiations with other countries, whether the negotiation takes place openly or behind closed doors, and the psychological process will influence the negotiating agents, process, and outcomes. Note that this framework can be applied to any negotiation situation to shed light on what transpired during a negotiation and how an agreement ultimately was or was not reached.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course, students will be able to Assess the important contextual features of the negotiation environment that influence how international negotiations unfold and how they are or are not resolved. Determine what negotiation strategies are best suited to particular negotiation situations, including how to manage the complexity associated with multiple parties, how to balance conflicting interests due to different cultural perspectives and history of the relationship, and how to best change the negotiation environment to encourage forces that drive the parties to agreement and remove barriers to agreement.",
                                                    "key_topics":  "Understanding how the context of the negotiation environment shapes international negotiation and conflict.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "There will be quizzes, preparation plans, an analysis of negotiation in the news, negotiation exercises, class participation, and an opportunity for extra credit.",
                                                    "relevance":  "Dietrich GenEd after Fall 2021: Foundations - Contextual Thinking",
                                                    "learning_resources":  "Students will be required to read \"Negotiation Genius\", \"Breakthrough International Negotiations,\" and parts of \"Stalling for Time\". Additional course readings and cases will be posted to Canvas.",
                                                    "extra_time_commitment":  null
                                            }
}