{
        "code":  "88-251",
        "name":  "Empirical Research Methods",
        "short_name":  "EMPIRICAL RSRCH MTHD",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(36-200 [] at least D) or (36-207 [] at least D) or (36-247 [] at least D) or (36-201 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course teaches students how to evaluate and conduct original research regarding human behavior, whether it be in economic, social, or political settings. The course gives students practical experience in many of the most commonly used research techniques, including surveys, experiments, and quasiexperimental analysis. Although the course focuses primarily on the relationship between formulating research questions and implementing the appropriate methods to answer them, students can expect regularly to apply the statistical techniques learned in the course prerequisites, including regression.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will be able to read research articles and evaluate their scientific merit, learn the basic components of designing surveys and experiments, and will learn how to write research reports and present the results",
                                                    "key_topics":  "This course is intended to make students a better consumer and producer of empirical research by becoming literate in empirical research design issues and the various threats to the validity of research conclusions",
                                                    "prerequisite_knowledge":  "Must be familiar with basic statistical concepts. This course is not appropriate for first-year students under any circumstance. If a first-year student registers, they will be manually removed from the course.",
                                                    "assessment_structure":  "There will be two exams, two team projects, various class exercises/quizzes as well as mandatory attendance",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Modeling-Other",
                                                    "learning_resources":  "Students will be required to read various material from textbooks, handouts and online materials (available on Canvas).",
                                                    "extra_time_commitment":  "No formal extra time commitments. However, extra credit will be awarded for participating in research experiences. See syllabi for details."
                                            }
}