{
        "code":  "88-221",
        "name":  "Markets, Democracy, and Public Policy",
        "short_name":  "MRKTS DEM \u0026 PUB POL",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "73-102 [] at least D"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In this course, you will learn a powerful set of concepts for analyzing i What markets are and the positive and negative effects they may have on individuals and society ii What democracy is, how markets and democracy may interact, and some ways in which democracy is vulnerable iii How public policy might soften some of the negative effects of markets and support democracy. You will learn theory via application to historical and current realworld examples. You will appreciate how theory illuminates the realworld examples.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of this course, students should 1 Know a small but powerful set of conceptual tools from economics and political economy to analyze a variety of pressing policy concerns.2 Have a substantive understanding of selected realworld policy challenges.3 Above all, students will be able to look at the world and see it analytically. They will appreciate what they see today in a broader historical context. This context will give them a sharper understanding of the present, and of what is expected in the near future.4 Analyze and apply perspectives of economists, historians, sociologists, anthropologists, political scientists, and ordinary people to explore the causes and consequences of politicaleconomic hardship and social unrest. 5 Evaluate the relative strengths and weaknesses of different political philosophies and the policy approaches they have pursued, including the effects of these different approaches on income inequality, economic security, and the effects of different policies on quality of life from cradle to grave.",
                                                    "key_topics":  "On markets: Under certain conditions, markets can guarantee \"efficiency\" (to be defined). However, markets may generate inequality, especially by class, race and gender. Furthermore, social and economic changes may reduce wellbeing and lead to social unrest. You will model structural changes and inequalities in the economy, appreciate the social disruption that these problems can cause, and consider public policies that may soften the effects of markets on society. (Note: In addition to structural change and inequality generated by markets, there is a third major justification for public policy, which is market failure. Market failure is covered in depth in standard public economics courses. See me if you are interested in learning more.)\n\nOn democracy: Under certain conditions, democracy delivers outcomes that a majority of voters prefer, and can even pull political candidates toward the political center. However, these conditions are difficult to satisfy. Moreover, when markets deliver widespread dissatisfaction, this may affect the strength of democracy.\n\nOn public policy: The social disruptions and inequalities caused by markets can be softened by policy. This, in turn, may potentially reduce social unrest and increase political support for democracy and markets. You will learn about several examples and choose one of interest to you to write about and present at the end of the semester.\n\nSome important analytical concepts: property rights, productivity growth, constrained optimization and demand curves, income and price elasticities of demand, market saturation, substitutability versus complementarity between humans and machines as inputs to production, Edgeworth box and the First and Second Fundamental Theorems of Welfare Economics, Polanyi\u0027s concept of \"embeddedness\" and the \"double movement\". Risk and insurance (health insurance, social insurance, job and skills insurance).",
                                                    "prerequisite_knowledge":  "73-014 or 73-102",
                                                    "assessment_structure":  "- Daily Writing / Discussion\n- Approximately 3 Policy Briefs \u0026 3 Related Tests",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Deciding\nDietrich GenEd after Fall 2021: Perspectives on Justice and Injustice",
                                                    "learning_resources":  "Students purchase a few inexpensive books, but everything else will be available through Canvas and the Internet.",
                                                    "extra_time_commitment":  "No formal extra time commitments. However, extra credit will be awarded for participating in research experiences. See syllabi for details."
                                            }
}