{
        "code":  "88-231",
        "name":  "Thinking in Person vs. Thinking Online",
        "short_name":  "THINKNG PERS V ONLIN",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Being online changes how we think.   Different media lead us to ask different questions, remember or forget different information, attend to different details, and interact with other people in different ways. These types of thinking arent inherently better or worse, but they may be better or worse for facilitating specific goals.  Too often, we use a particular mediumtechnology without considering how it will influence our thinking.   This can lead us to be less efficient or less effective at a task than we otherwise might be, or can qualitatively change the nature of our outcomes.   In this class, we will explore how the media we use affects the character of our thinking, so as to enable students to make mindful and deliberate choices about how to interact with media in ways that support the type of thinking desired and appropriate for their goals.  Moreover, we will examine how to optimize media for specific goals in important applied domains, such as education, medicine, policy, childrearing, and dating.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course, you should 1Understand how different technologies have different cognitive affordances.2Be able to choose the right mediatechnologies to support the type of thinking you want to do for a given task or goal.3For circumstances in which you cannot choose the mediatechnology that you will be using, be able to exploit strategies that draw upon the types of thinking that those mediatechnologies support. 4Be able to apply the notion of cognitive affordances to the creation of new mediatechnologies, and understand how one might design new technologies with cognitive affordances in mind.",
                                                    "key_topics":  "Understanding Media Affordances, Applications to Real World Domains, Determining Appropriate Media to Support the Type of Thinking that will Facilitate One\u0027s Goals",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "Exercises, Critical Reflections and Final Group Assignment",
                                                    "relevance":  "DC Gen Ed: Deciding",
                                                    "learning_resources":  "Content delivery in this course will be provided across multiple media. In addition to lectures and course discussion, these include (but are not limited to) readings, videos, audio, art, games, flowcharts, and discussion boards. Readings/videos/etc. will be posted on Canvas at least one week before they are due. You are expected to have completed the readings/watched the videos, etc. prior to class, and come to class prepared to discuss the content.",
                                                    "extra_time_commitment":  "No formal extra time commitments. However, extra credit will be awarded for participating in research experiences. See syllabi for details."
                                            }
}