{
        "code":  "88-255",
        "name":  "Strategic Decision Making",
        "short_name":  "STRATEGIC DECIS MAK",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "How do people navigate social interactions when their goals are in conflict  When should a person cooperate and when should a person pursue selfinterest in an ongoing social interaction  How can a business establish strategic partnerships that create value and at the same time battle with competitors to take advantage of the value they create  Strategic decision making requires a framework to think through the implications of cooperation and of competition.  This course gives you a systematic approach to understanding how people, firms, or countries interact with one another to achieve their own goals.  We focus on the practical application of theorybased strategic principles and on their behavioral validity whereas traditional game theory courses usually focus on formal modeling techniques. Readings will focus on reallife stories accompanied by a full analysis of the principles involved. The class will be organized as a seminar, centered around discussion, not lecture. Students will also be placed in the role of strategist in occasional simulations in class.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students should be able to explain how these strategic principles apply in real world situations.To apply strategic principles to make sense of real strategic decisions you encounter in your lives, you need to1. Identify principles of strategic decision making Recognize fundamental concepts Articulate principles describing how these concepts relate to each other2. Practice applying them in new contexts Recognize key features of a strategic decision Derive the implications of a strategic principle for a particular strategic decision Assess whether a prediction follows from particular strategic principles Explore the range of applicability of these principle3. Communicate your insights to an audience not already familiar with these concepts and principles",
                                                    "key_topics":  "This course will cover strategic decision making, cooperation, competition, and conflict. It will rely primarily on game theory, along with some negotiation theory, and social psychology.",
                                                    "prerequisite_knowledge":  "No prior knowledge required",
                                                    "assessment_structure":  "There will be one final exam, one memo project, quizzes, homeworks, and required participation in class.",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Deciding\nDietrich GenEd after Fall 2021: Disciplinary Perspectives - Social Sciences\n\nIn this course students will learn to apply behavioral strategic principles to make sense of strategic situations arising in business, politics, international relations, domestic policy, organizational management, and everyday life.",
                                                    "learning_resources":  "Students will be required to read various material from textbooks (Thinking Strategically, Co-Opetition, and Give and Take), handouts and online materials (available on Canvas).",
                                                    "extra_time_commitment":  null
                                            }
}