{
        "code":  "88-230",
        "name":  "Human Intelligence and Human Stupidity",
        "short_name":  "HUMAN INTELIG\u0026STUPID",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "By some standards, humans are an incredibly intelligent species. We have set foot on the moon, split the atom, and produced extraordinary works of art and literature including the complete works of Shakespeare, which, despite theoretical accounts to the contrary, no amount of monkeys on typewriters has ever been able to duplicate. And yet. we are also the species that has brought about the Darwin Awards, spent 125 million sending a probe to Mars which was unable to function because engineers failed to convert inches to centimeters, and produced cringeworthy works of art and literature including the 1964 movie Santa Claus Conquers the Martians which no amount of monkeys on typewriters would ever want to duplicate.. What is intelligence and how does it vary across individuals and over our lifespans What are we good at, and what are we bad at, and why Are there things that that make us dumber Are there things we can do to make ourselves smarter How should what we know about the range of human intellectual abilities guide policy, education, law, medicine, and business what implications does this have regarding the tasksjobs that humans should be doing and the tasksjobs that machines ought to do Using cutting edge research from psychology and decision science, this course will explore the strange contradiction that defines the human experience How are we simultaneously so smart and so dumb",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1To expose you to what is currently known about human intelligence and human stupidity. By the end of the class, you should be familiar with the academic literature and have a deeper understanding of what it means to be smart, the strengths and weaknesses of the human mind, how to measure and evaluate intelligence, various strategies for improving intelligence, and the implications of the aforementioned topics for you personally and for society as a whole. By knowing what it means to be smart, you will be in a better position to improve your intellect.\n2 To give you practice applying theoretical concepts. In this class, the theory involves how to get smarter, and the application is making yourself smarter and more effective, both individually and in groups.\n3 To train you to think critically. You will be assigned readings with information that is highly controversial, and in some cases almost certainly incorrect. In most cases there will also be readings that correct those errors, to the extent that the errors can be corrected theres not always a right answer.... But youd better be on your toes. Dont take anything at face value think it through. By the end of this course you should have the tools necessary to critically evaluate claims about human abilities and recognize pseudoscience when you come across it.\n4 To provide you with a forum for presenting and defending your positions, and for critically examining and discussing the positions of others. Being individually smart is all well and good, but if you cant effectively communicate then you cant take advantage of social and group intelligences. This class will give you the opportunity to practice and improve on working with others.",
                                                    "key_topics":  "Using cutting edge research from psychology and decision science, this course will explore the strange contradiction that defines the human experience: How are we simultaneously so smart and so dumb?",
                                                    "prerequisite_knowledge":  "No prior knowledge required",
                                                    "assessment_structure":  "There will be response papers and three major assignments (two individual and one group).",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Deciding\nDietrich GenEd after Fall 2021: Disciplinary Perspectives - Social Sciences\n\nThe goal of this class is to make you smarter. Unfortunately, no class can do that. The best we can do is to provide you with the tools and scaffolding to make yourself smarter.\n\nStudents will provided with the tools and scaffolding to think critically and defend their positions.",
                                                    "learning_resources":  "Students will be required to read various material from textbooks, handouts and online materials (available on Canvas)",
                                                    "extra_time_commitment":  null
                                            }
}