{
        "code":  "88-281",
        "name":  "Topics in Law: 1st Amendment",
        "short_name":  "TPCS LAW: 1ST AMEND",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In their firm desire to perfect the new Constitution, which defined and limited the powers and roles of their new government, the founding fathers insisted on explicit statements that would protect the rights of the new nations citizens.   Indeed, the protection of these essential rights in many ways drove and defined their successful rebellion from Britain.  This impulse resulted in ten amendments to the Constitution, which we have come to know as the Bill of Rights.   The very first and arguably considered at the time as the most essential of these was the First Amendment, which we sometimes call the free speech amendment to the Constitution.  This amendment guarantees every U.S. citizen five freedoms freedom of religion, speech, press, peaceable assembly, and the freedom to petition the government for redress of grievances.  This course examines the historical and philosophical roots of this key constitutional amendment, how it has been fleshed out and defined over time through case law, and the bases of some more recent critics of this amendments and current interpretations.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The goals of the course are to learn each of the clauses of the Amendment, to gain an understanding of how the Supreme Court of the United States functions, and to understand the often polarized views of how the First Amendment should be interpreted by the Courts.",
                                                    "key_topics":  "This course is designed to provide an introduction to the First Amendment to the United States Constitution.",
                                                    "prerequisite_knowledge":  "No prior knowledge required",
                                                    "assessment_structure":  "There will be written assignments, presentations, class discussion and participation as well as mandatory attendance.",
                                                    "relevance":  "DC Gen Ed: Reflecting",
                                                    "learning_resources":  "Cases will be assigned that must be accessed on Lexis, WestLaw, or the official site of the Supreme Court of the United States.",
                                                    "extra_time_commitment":  null
                                            }
}