{
        "code":  "88-220",
        "name":  "Policy Analysis I",
        "short_name":  "POLICY ANALYSIS I",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course provides an introduction to theories and methods for policy analysis. The main focus of the course is to develop an understanding of how theories from social science, such as economics, can help us understand policy issues such as allocation, regulation, and welfare. Throughout the course we analyze outcomes produced by private markets, by examining consumer choice, the supply and demand of factors and produced goods, and general and partial equilibrium. We also analyze the efficiency and welfare properties of such outcomes, paying special attention to the role of policy in influencing market outcomes. We consider how policy can address the efficiency and welfare shortcomings of markets that may result from informational asymmetries, industrial organization, moral hazard, transactions costs, and bounded rationality. Markets are compared in this light with organizational, governmental, and other modes of resource allocation. Grading will be based mainly on 3 exams. Homework assignments andor quizzes will comprise a smaller part of the grade.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}