{
        "code":  "88-223",
        "name":  "Decision Analysis",
        "short_name":  "DECISION ANALYSIS",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  "(36-201 [] at least D) or (36-207 [] at least D) or (36-211 [] at least D) or (70-207 [] at least D) or (36-200 [] at least D) or (36-225 [] at least D) or (36-247 [] at least D) or (36-217 [] at least D) or (36-200 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course offers practical guidance about how to make better decisions and teaches students how to use modeling to do decision analysis.  We analyze decisions involving uncertainty, risk, and time delay. In addition to methods of decision analysis, the course will also emphasize sensitivity analysis and communication of recommendations.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "This course will teach you how to make good decisions. Specifically, students should be able to Employ a systematic approach to analyzing decision problems Use Excel to model the relationship between choice alternatives and consequences Evaluate tradeoffs that may involve risk or time delay Deal with uncertainties by gathering information and assessing probabilities Use Excel to perform simulation in order to better forecast systemic uncertainties Take account of the sensitivity of their projections to their specific assumptions Communicate their decisions and the rationale for them.",
                                                    "key_topics":  "We analyze decisions involving uncertainty, risk, and time delay. In addition to methods of decision analysis, the course will also emphasize sensitivity analysis and communication of recommendations.",
                                                    "prerequisite_knowledge":  "At least a one-semester course in probability and statistics, familiarization with the Mac or PC, and a reasonable calculator.",
                                                    "assessment_structure":  "There will be nine problem sets, one midterm exam, one final exam and a final group project. Each group of 3-4 students will be responsible for finding a real decision problem that is meaningful and of appropriate scale. Each group will have to make a presentation and submit a written report.",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Modeling-Other\nDietrich GenEd after Fall 2021: Disciplinary Perspectives: Engineering",
                                                    "learning_resources":  "TAs will hold weekly office hours. Course materials will be available on Canvas. Required text: Smart Choices by Hammond, Keeney and Raiffa (any edition). Optional, but not required: Practical Management Science 4e by Winston and Albright. Some handouts will be used as well. This course will stress the use of spreadsheets across a variety of applications. Students will get practice using MS Excel in recitations.",
                                                    "extra_time_commitment":  "No formal extra time commitments. However, due to the nature of the course, time spent on the project outside of class time can be expected."
                                            }
}