{
        "code":  "88-300",
        "name":  "Programming and Data Analysis for Social Scientists",
        "short_name":  "PROG/DAT ANL SOC SCI",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(36-201 [] at least D) or (36-200 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [
                                            {
                                                    "code":  "36-350",
                                                    "id":  6319,
                                                    "name":  "Statistical Computing",
                                                    "units":  9.0
                                            }
                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course presents an introduction to computational thinking through practice with data analysis.  Students will develop extensive expertise using the statistical programming language R.  Designed primarily with social science majors in mind, students will use a variety of data structures to represent information and solve problems.  The course is conducted in a flipped classroom style, and places a heavy emphasis on handson programming  in every class, students will practice writing computer programs to conduct analysis and explore social science phenomena. Students will develop skills in all facets of the data analysis pipeline, from installing and loading packages to readingin files to data cleaning, munging, visualization and modeling. The course is primarily intended for students who have limited familiarity with coding, and assumes no previous exposure to R.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students think computationally about data structures to represent data at a variety of levels of analysisStudents use iteration to solve complex problemsStudents use computational simulation Monte Carlo Methods as a solution strategyStudents compose programs using the R language to conduct data cleaning, munging, visualization and modeling.Students recognize and correct common errors in R syntax that others have composed.Students interpret quantitative findings to make claims about social questions.Students use data analysis to diagnose patterns of disparate treatment and outcomes based on gender",
                                                    "key_topics":  "- Plot the \"shapes of stories\" that show progressions of novels\u0027 average sentiment scores\n- Confirm a voting paradox - wealthier individuals are more likely to vote for Republicans, but wealthier states are more likely to vote for democrats\n- Program an algorithm to compose text in the style of Jane Austen\n- Analyze word use in 100 books to confirm Zipf\u0027s law\n- Analyze trends in the General Social Survey\n- Use simulation to generate estimates of pi\n- Measure differences in gender representation in Wikipedia articles\n- Explore trends in the Texas housing market",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "88-300 is an unusual course in that it is conducted in the \"flipped classroom\" format. Students work to complete a new assignment in every class meeting, resulting in 24 submitted assignments in total, including an assignment on the first day of the course. In part because of this format, students who join the course late are at a distinct disadvantage and WILL NOT BE ADMITTED TO THE CLASS ONCE THE SEMESTER HAS BEGUN. Student grades additionally include points for attendance and engagement.",
                                                    "relevance":  "Dietrich GenEd Prior to Fall 2021: Modeling - Other\nDietrich GenEd After Fall 2021: Computational Thinking\n\nThis course provides a first introduction to the statistical programming language R, and is designed primarily with social science majors in mind.",
                                                    "learning_resources":  "Students will be required to read various material from publicly available textbooks, handouts and online materials (all linked on Canvas). Laptops are required for in class programming.",
                                                    "extra_time_commitment":  "None, but office hours will be held every day for one hour after each class meeting."
                                            }
}