{
        "code":  "88-312",
        "name":  "Decision Models and Games",
        "short_name":  "DECIS MODELS \u0026 GAMES",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  "(36-200 [] at least D) or (36-201 [] at least D) or (70-207 [] at least D)"
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Humans often make decisions in changing and uncertain situations. A car driver entering a new city must adjust decisions rapidly while moving along heavy traffic firefighter crews entering a burning building must maintain awareness of the development of fire citizens in a country must change their activities based on the evolution of a pandemic and the restrictions imposed. While challenging, humans are an adaptable species. We plan and readjust our plans to changing conditions we keep aware of potentially new courses of action and we manage our limited time, information, and attention to changing environments. How do humans make decisions in dynamic situations  This course will explore human decision making as a dynamic process resulting from human interactions with the environment. The course uses decision games to illustrate how humans learn and adapt to changing conditions of choice, and computational models to simulate decision processes and environmental dynamics. Decision Models and Games will provide 1 foundational perspectives for using models to represent the dynamics of environments and human decision processes 2 tools to build computational models of human decision making and of dynamic environments and 3 practical illustrations of how models and games can be used to understand and generate solutions to a wide range of decision problems, from simple choices to large scale consequential decisions.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of this semester students will be able to Critically analyze dynamic decision making situations to determine the role of experience, memory, and learning in making decisions in dynamic situations. Utilize games of dynamic decision making problems to analyze dynamic decision situations and be able to determine stakeholders, alternatives, internal and external factors that influence decisions. Learn to interpret cognitive models of decision making from simulations and computational tools. Be able to outline the development of cognitive processes involved in making decisions from experience. Learn to represent a dynamic system into a model using diagram tools Causal loop diagrams and Stock and Flow diagrams. Learn to build, test, and use models of dynamic systems to simulate, experiment, and learn about the systems dynamic behavior. Learn to interpret the dynamics and the outcomes of System Dynamics models, and to use these models to propose solutions to decision problems.",
                                                    "key_topics":  "Decision making in complex, dynamic environments. Psychology and Decisions from Experience. Cognitive Modeling. Models of the environment. Simulation Process.",
                                                    "prerequisite_knowledge":  "No previous experience with programing or computational models is needed.",
                                                    "assessment_structure":  "Four project assignments (60%), 15 points each; Two exams (24%), 12 points each; Quizzes (16%), 20 total quizzes.",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Modeling - Other\nDietrich GenEd after Fall 2021: Computational Thinking",
                                                    "learning_resources":  "Students will be required to read materials from textbooks, handouts and research articles, all provided for the student. They will also need to download and work on computer games and modeling software. All software is free for academic use.",
                                                    "extra_time_commitment":  null
                                            }
}