{
        "code":  "88-419",
        "name":  "Negotiation: International Focus",
        "short_name":  "NEGOTIATION: INTRNTL",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Negotiation is a process in which two or more parties undertake a process to resolve conflicting interests. Decision makers use negotiation in a variety of circumstances   to reach agreements among countries, among employers and employees, among firms, and among family and friends.   International section  The objective of this course is to understand the process of negotiations and how the structure of the negotiation environment affects the outcomes achieved. Students will learn to analyze the features of the negotiation environment, develop an understanding of effective negotiation strategies, and identify the barriers to reaching wise agreements.  This course will focus on negotiations in primarily international contexts.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course, students will be able to Describe and apply the basic strategies in negotiations Explain how different strategic choices and interpersonal skills drive relative success at the bargaining table Learn how to successfully prepare for a negotiation Identify the psychological processes underlying the judgment of negotiators and the biases that typically affect them Explore negotiations that contain elements of both cooperation and competition, learning how to identify potential sources of joint gains and create value Develop selfawareness and gain valuable experience from repeated negotiation exercises Critique and assess the strategies and mistakes that affect the outcomes of real life negotiations",
                                                    "key_topics":  "The course provides an introduction to strategic thinking and the basic concepts, tactics and cognitive aspects of negotiation. Considerable emphasis is placed on negotiation exercises and role-playing.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "There will be one negotiation video, two quizzes, two preparation plans, one analysis of negotiation in the news, negotiation exercises and an opportunity for extra credit.",
                                                    "relevance":  "DC Gen Ed: Communicating",
                                                    "learning_resources":  "Students will be required to read Deepak Malhotra and Max Bazerman\u0027s, \"Negotiation Genius: How to Overcome Obstacles and Achieve Brilliant Results at the Bargaining Table and Beyond\" along with additional course reading with will be available for download on Canvas.\n\nAdditionally, a course fee of approximately $36 will be charged to your Carnegie Mellon account to pay for the negotiation cases.",
                                                    "extra_time_commitment":  null
                                            }
}