{
        "code":  "88-418",
        "name":  "Negotiation: Strategies and Behavioral Insights",
        "short_name":  "NEGOTIATION",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Negotiation is a critical skill that is essential for success in todays world. Decisionmakers use negotiation to reach agreements with coworkers, bosses, clients, service providers, subordinates, firms, family, roommates, and friends. Regardless of ones career path, learning how to negotiate effectively is important. This course provides a systematic and insightful approach to negotiation  the art and science of securing agreements between interdependent parties. Through experiential exercises, students will learn to analyze the features of the negotiation environment, develop an understanding of effective negotiation strategies and tactics, and identify the behavioral barriers and psychological factors that may prevent decisionmakers from reaching wise agreements. The exercises, which feature negotiations in a variety of contexts including business negotiations, salary negotiations, interpersonal negotiations, and team negotiations, are designed to provide students with an opportunity to practice new strategies in a lowrisk environment, receive feedback, and apply new knowledge to subsequent exercises. Inclass discussions and lectures will complement the exercises, allowing students to explore and apply theoretical concepts to practical scenarios. This course is appropriate for students of any major who are interested in refining their negotiation skills.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will learn how to describe and apply the basic strategies in negotiations, explain how different strategic choices and interpersonal skills drive relative success at the bargaining table, develop selfawareness and gain valuable experience from repeated negotiation exercises.",
                                                    "key_topics":  "The course provides an introduction to strategic thinking and the basic concepts, tactics and cognitive aspects of negotiation. Considerable emphasis is placed on negotiation exercises and role-playing. The exercises serve as catalysts for the evaluation and discussion of different types of negotiation.",
                                                    "prerequisite_knowledge":  "This course is not appropriate for first-year students under any circumstance. If a first-year student registers, they will be manually removed from the course. Students from all majors are welcome to enroll.",
                                                    "assessment_structure":  "Weekly negotiation exercises (which count towards participation). There will be two quizzes. There will be two written assignments: the first smaller ones (700 words) to be conducted individually, and a larger (3 pgs) group one analyzing a popular negotiation.",
                                                    "relevance":  "Dietrich GenEd prior to Fall 2021: Communicating",
                                                    "learning_resources":  "Students will be required to read various material from textbooks, handouts and online materials (available on Canvas). A course fee of $35-40 will be charged to pay for negotiation cases.",
                                                    "extra_time_commitment":  "No formal extra time commitments. However, extra credit will be awarded for participating in research experiences. See syllabi for details."
                                            }
}