{
        "code":  "90-717",
        "name":  "Writing for Public Policy",
        "short_name":  "WRTNG PUBLIC POLICY",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Communication in written form is an essential element of being a public policy professional. Writing for consulting firms, government agencies, think tanks, advocacy groups, industry associations, and other contexts in the sphere of public policy differs from academic writing. Accordingly, this course challenges students to convey critical thinking by anticipating readers needs and the perspectives of stakeholders in the practice of shaping public policy. The writing skills integral to this process include developing essential and persuasive content, communicating complex ideas, organizing information, targeting diverse audiences with varying levels of expertise and roles, ensuring clarity, controlling tone, and designing a document for readability. Students analyze realworld documents relevant to careers in public policy, craft strategic quotes for news releases, and write policy onepagers as well as policy memos. Writing guidance and sample documents  specific to public policy  are provided during the course.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  "http://heinz.cmu.edu/academic-resources/course-results/course-details/index.aspx?cid=658",
        "custom_fields":  {
                                                    "goals":  "The overall goals for the course are for students to demonstrate the ability to write clear, concise, precise, structured communications targeting public policy leaders and constituents.",
                                                    "key_topics":  "¿Differentiate the format and style of professional writing from personal and academic writing\n\n¿Determine the purpose and scope of a message\n\n¿Distinguish between essential versus non-essential information\n\n¿Target writing to particular readers, rather than a generic audience\n\n¿Leverage writing as a tool to build and maintain professional relationships\n\n¿Adapt complex, data-heavy topics for non-expert audiences through the use of clear, specific, plain language\n\n¿Maintain a logical structure through calculated organizational methods,\n\n¿Format headings, lists, data, citations, and visuals with a focus on precision, consistency, readability, and accessibility\n\n¿Create efficiently phrased, actionable communications for use in a workplace\n\n¿Edit and proofread documents thoroughly prior to distribution",
                                                    "prerequisite_knowledge":  "Proficiency in the English language in necessary to be successful in this course.",
                                                    "assessment_structure":  "Students will be assessed based on the skills they demonstrate on written assignments.",
                                                    "relevance":  "Effective, professional written communication is requisite for students seeking careers in public policy.",
                                                    "learning_resources":  "Resources provided will include a required textbook, language exercises, sample documents, and news articles relevant to public policy organizations.",
                                                    "extra_time_commitment":  "Time commitment is typical for a 6 unit course"
                                            }
}