{
        "code":  "90-778",
        "name":  "Media and Public Policy Making",
        "short_name":  "MEDIA \u0026 PBLC PLCY MK",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will examine the influence of the media on public policy in the United  States. During the mini students will join the instructor in considering various  explanations of how the news and other activities of journalists affects the policymaking  process. This will involve exposure to the major themes of media influence in  American politics. We will also consider the role of the media in elections in public  policy debates and in public opinion formation.    Through lots of readings discussion and expert guest visitors we want to  understand how the media influences American politics and policy as well as why the  media behaves the way it does.    Working in teams students will complete a project during the mini that involves  drafting a imedia strategy analysisi for some organization promoting a major policy  issue of current importance.    Students will leave the course with a better understanding of the role of the media  in American public life with practical experience in the analysis of news with  knowledge of the laws that affect the media and with some sense of how to interact with  journalists and media when participating in policymaking.  a hrefhttpwww.heinz.cmu.eduacademicresourcescourseresultscoursedetailsindex.aspxcid99...Read Morea",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  "http://heinz.cmu.edu/academic-resources/course-results/course-details/index.aspx?cid=99",
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}