{
        "code":  "90-733",
        "name":  "Advocacy for Policy Change",
        "short_name":  "ADVOCACY POL CHANGE",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The ability to influence policy change is an essential skill for public policy and management leaders. Democratic societies rely on the engagement and contributions from knowledgeable and passionate citizens willing to evolve the current policy landscape to respond to everychanging needs of individuals and communities. To do this, individuals must understand the social context of advocacy, examine the levers of change, determine appropriate mechanisms of influence, and construct systems and strategies which advance complex policy agendas.Students will have an opportunity to consider the current landscape in their chosen policy domain, discuss the influence of global and domestic politics within this realm, and shape their views on how to embed advocacy practices into their future professional lives. This course will employ a future approach to aid students in constructing the necessary skillset and readily implementable professional strategies to advance policy agendas to improve their lives, work, economics, societies, and world around them.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Understand the basics of advocacy for policy change, including policy domains, key decisionmakers, levers of influence, casemaking tactics, and more. Utilize a futureframework to discuss contemporary influences on public policy in the U.S. and how advocacy may leverage and engage these influences to shift policy in a favorable direction. Create a sustainable advocacy strategy to influence public policies at the local, state, or federal level relevant to individual professional policy domains.",
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}