{
        "code":  "90-762",
        "name":  "Macroeconomics",
        "short_name":  "MACROECONOMICS",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The purpose of the course is to introduce the professional masters student to the major concepts of aggregate economic analysis, or macroeconomics. Topics include the measurement of national economic activity through aggregation and the national income and product accounts, the associated measurement of prices, labor market activity, the aggregate production function, the supply and demand for interest and noninterest bearing assets, and the conduct of national debt management and the banking sector.  Alternative theories of aggregate economic behavior are reviewed, and students will formulate, estimate statistically, and test alternative macroeconomic models.   A novel feature of this onesemester course is the integration of macroeconomic theory and policy, annual and quarterly macroeconomic data, and the estimation of simplified and more complex statistical models of annual and quarterly macroeconomic behavior.  Each student will be expected to implement the theory provided in lecture and the textbook through a series of empirical problem sets which involve the statistical estimation and interpretation of macroeconomic behavioral equations and underlying parameters for the aggregate consumption, investment, the demand for cash functions, and labor and aggregate production functions.  Data from The Economic Report of the President, the US Department of Commerces Bureau of Economic Analysis, the database available within FairModel, and the Federal Reserve Economic Data FRED of the St. Louis Federal Reserve Board will be placed on Blackboard in a series of Excel spreadsheets. The last problem set, which requires the estimation and simulation of the US, Indian and Chinese mainland economies under varying fiscal and monetary policy environments will use FairModel for the US portion.   Read more at httpswww.andrew.cmu.eduuserrs9f",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  "https://api.heinz.cmu.edu/courses_api/course_detail/90-762/",
        "custom_fields":  {
                                                    "goals":  "To understand the fallacy of compositionTo explain the fundamentals of aggregation, measurement of output, prices, labor market, and capital marketsTo enable each student to estimate and interpret major components of macroeconometric models dealing with aggregation consumption, savings, real investment, employment and unemployment, determination of price levels and international economic flowsTo enable each student to understand competing theories of aggregate economic behavior, and tradeoffs which occur in the design and implementation of macroeconomic policies which can affect aggregate demand, aggregate supply, the production and distribution of goods and services, levels of unemployment and the determination of interest rates",
                                                    "key_topics":  "Measurement and Structure of the National Economy\n\nProducity, Output and Employment\n\nConsumption, Saving, and Investment\n\nLong Run Economic Growth\n\nThe Asset Market, Money and Prices\n\nBusiness Cycles\n\nIS-LM-AS Framework\n\nClassical Business Cycles\n\nKeynesian Assumptions: Macroeconomics of Wage and Price Stability\n\nUnemployment and Inflation\n\nExchange Rates, Business Cycles and Macro Policy in the Open Economy\n\nGovernment Spending and Its Financing",
                                                    "prerequisite_knowledge":  "Alegebra I and II\n\nBasic Linear Regression Analysis (Note: Stata will be taught and used)n.",
                                                    "assessment_structure":  "Grades will depend on student performance on various end of chapter assignments arranged through Pearson MyLab.",
                                                    "relevance":  "With an understanding of how a mixed economy operates, and national policy tools available for stabilizing economic growth, prices, and the level of employment, the student will materially improve his/her marketability for a responsible position in the private or public secto",
                                                    "learning_resources":  "Textbook: Macroeconomics by Abel, Bernanke, and Croushore, 10th Edition, Pearson Publishing. \n\nPearson MyLab Interactive Learning Environment. \n\nFairModel of the US Economy",
                                                    "extra_time_commitment":  "This is a 12 unit, full semester course which meets MW and"
                                            }
}