{
        "code":  "90-810",
        "name":  "Social Movements and Social Change",
        "short_name":  "SOC MOVMNTS \u0026 CHANGE",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In this mini course, we will focus on the study of social movements whose mission is to achieve social, racial, gender and environmental justice both in the U.S. and in selected countries. Because social movements have been critical to strengthening democracy and adapting societies to new conditions, we focus on those movements whose goals are democracy, equity, and justice.  The course will start by analyzing the nature, organization and leadership dimensions of social movements, the role that social media plays in their success or failure, and the conditions under which social movements can build more egalitarian and just societies. Selected social movements will be analyzed either in the lectures or in the students presentations including the Civil Rights Movement, Black Lives Matter, Environmental Justice Movements both in the U.S. and in other countries, ProDemocracy Movements as well as Gender Equity Movements.  The course will be structured around class discussions, lectures, students presentation, and presentations by guest speakers.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  "https://api.heinz.cmu.edu/courses_api/course_detail/90-810",
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}