{
        "code":  "90-828",
        "name":  "Energy, Climate Change, and Economic Growth in the 21st Century",
        "short_name":  "ENERGY CLIM CHG ECON",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The scientific community has concluded that human industrial activities are causing global temperatures to increase.  Coping with the environmental economic and political consequences of this change is considered by many to be the preeminent public policy challenge of the 21st century.  If ever there were a topic that required an interdisciplinary approach this is it.  Drawing upon the strong tradition of rigorous interdisciplinary research and education at Carnegie Mellon and a broad range of expertise resident in its schools and departments this course is designed to introduce masters students and advanced undergraduates to the many different dimensions of the global warming problem.   In this course we will investigate the science of climate change the prospective economic impact of global warming the uncertainty involved in long-run climate forecasting and the technological alternatives available to us as we seek to mitigate the impact of human industrial activity on global warming.  The heart of this course will be an in-depth analysis of the policy options available to the United States and the global community.  We will investigate the economic costs of these options and the way political realities are likely to shape and constrain policy at the national and international levels.  This course will also introduce students to the range of courses and research activities underway at CMU for those who want to study this issue in greater depth.    Pre-requisites:  Introductory economics required at the level of 90-710 or equivalent.      Who should take this course:  Anyone who is interested in understanding the realities of ongoing global climate change its economic and social impact and the policy alternatives available to the human race at the beginning of the 21st century.  The\u003ca href=\u0027http://www.heinz.cmu.edu/academic-resources/course-results/course-details/index.aspx?cid=114\u0027\u003e...Read More\u003c/a\u003e",
        "student_sets":  [

                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}