{
        "code":  "90-847",
        "name":  "Combating Corruption in the Digital Age",
        "short_name":  "CMBAT CORRPT DGT AGE",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will address the implementation challenges facing international anticorruption agreements, notably the UN Convention against Corruption and the OECD AntiBribery Convention.  Getting signatory countries laws and regulations to be consonant with the provisions of these conventions is only the first stage of what is, in fact, a twostage implementation process. The second stage is the enforcement of anticorruption laws and regulations. This stage, which fosters deterrence and strengthens the rule of law vital to economic development, will be the focus of the course.  The course will examine cases of grand corruption across the world, including in Africa, Asia, Europe and Latin America. Among the countries to be covered will be the US, China, Russia, Brazil, India, South Africa, Philippines, Indonesia, Singapore, and others. The course will discuss different strategies and solutions that leaders in governments, nongovernment organisations and private sector can consider to improve, at a global level, the implementation of UNCAC and OECD antibribery convention. At the national level, the course will discuss and develop recommendations to enhance the enforcement of anticorruption laws in terms of effective detection, investigation, prosecution and sanctions against corruption, with due consideration to different country contexts.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  "https://api.heinz.cmu.edu/courses_api/course_detail/90-847",
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}