{
        "code":  "90-820",
        "name":  "Health Care Information Security",
        "short_name":  "HEALTH CARE INFO SEC",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Data breaches rose sharply in 2008 as the past year brought issues of data security and privacy closer to the legal and regulatory forefront than ever before. The nterprise threat landscape continues to evolve with the proliferation of a new generation of security threats targeting sensitive data and exposing organizations to the risk of losing revenue employee productivity customer relationships and market reputation. As healthcare providers continue to leverage technology to improve patient care and services the risk of a data breach grows greater. Such risks combined with a renewed focus on electronic medical records and corporate accountability require that prepared healthcare workforce members recognize the need for better IT security controls to govern private healthcare information. This course aims to explore current and emerging issues in healthcare security privacy and regulatory compliance. It will discuss the challenges of maintaining secure health information technology networks the current regulatory framework for health information  security including HIPPA and the tools that health care managers have at their disposal to be guardians of sensitive patient information.a hrefhttpwww.heinz.cmu.eduacademicresourcescourseresultscoursedetailsindex.aspxcid387...Read Morea",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}