{
        "code":  "95-568",
        "name":  "Data Management and Security",
        "short_name":  "DATA MNGT AND SECRTY",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Data plays a fundamental part in the functioning of the modern world. As custodians of this data, databases affect almost every aspect of our lives education, employment, entertainment, tax, medical, commercial, to name a few. In the broader picture of information security, database security is a critical facet.  In this course, we will study how to work with and protect a database. What are the assets of an organization  Traditionally one would consider people, equipment, intellectual property, infrastructure, land, and cash to be amongst the assets of an organization.  Over the past couple of decades, we have emerged into a data driven age with data becoming a pivotal asset. As the new cybercurrency, the successful operation of modern organizations relies on the effective use of data to drive sales and to enhance customer experience. Data collected and used by an organization can be broadly divided into two types i line of business or operational data and ii customer behavior or analytical data.  In the past, data management focused on line of business data.  For example, when a ride request is made to a ride sourcing company like Uber or Lyft, what data is needed to meet that request When a purchase is made in a grocery store what is the flow of data during that transaction  Line of business data is used to support the core business processes of the organization. Alternatively, based on the purchase patterns of a shopper or the volume or location of ride requests how can a grocery store or a ride sourcing company make their operation more effective The answer to these questions is based on customer behavior data.  Whatever type of data it may be, operational or analytical, some fundamental questions are the same. How do you gather, organize, curate, process, and protect data to help run the organization and extract actionable information to increase effectiveness",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Interpret an ER data model and implement it with SQLManipulate and extract information from a database using SQLUnderstand and detect data base threats along the dimensions of confidentiality, integrity, and availabilityUse database security measures such as authorization, access controls, views, and integrity rulesUnderstand the causes for and preventive measure for SQL injections",
                                                    "key_topics":  "Interpret an ER data model and implement it with SQL\nManipulate and extract information from a database using SQL\nUnderstand and detect data base threats along the dimensions of confidentiality, integrity, and availability\nUse database security measures such as authorization, access controls, views, and integrity rules\nUnderstand the causes for and preventive measure for SQL injections",
                                                    "prerequisite_knowledge":  "Programming",
                                                    "assessment_structure":  "Quizzes + Class participation\n\n15\n\nAssignments\n\n45\n\nExam 1\n\n20\n\nExam 2\n\n20",
                                                    "relevance":  "Foundations",
                                                    "learning_resources":  "Online",
                                                    "extra_time_commitment":  null
                                            }
}