{
        "code":  "95-565",
        "name":  "Introduction to Information Security",
        "short_name":  "INTRO TO INF SEC",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is intended to give students an introduction to a variety of information and cyber security topics.  As an introductory course, it will cover foundational technical concepts as well as managerial and policy topics.  The purpose of the course lectures, assignments, reading, inclass presentations, and examinations are to ensure students have sufficient technical awareness and managerial competence that will enable them to pursue advanced study in information security policy and management as they progress through their program.  There is no prerequisite for this course, however successful students will have fundamental knowledge of information and computer systems, and a general awareness of security issues in these systems.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Identify a foundation of information security best practices to ensure operational resilience within an organiztion.",
                                                    "key_topics":  "Information Security\n\nCybersecurity\n\nRisk / Risk Management\n\nLegal considerations for effective information security\n\nPrivacy considerations for effective information security\n\nIncident response",
                                                    "prerequisite_knowledge":  "Basic knowledge of information technology\n\nBasic knowledge of information security",
                                                    "assessment_structure":  "Homework Assignment(s)\n\nIncident Analysis; Threat Intelligence Report; Threat Briefing\n\nInformation Security Research Report\n\nFinal Examination",
                                                    "relevance":  "Effective implementation of information technology will enable organizations to efficiently achieve mission objectives. In addition to improving organization efficiency, the secure implementation of information technology will allow organizations be resilient when faced with threats that could potentially exploit vulnerabilities causing financial, operational, reputational, or health or safety impacts.",
                                                    "learning_resources":  "Text Book\n\nOnline Resources",
                                                    "extra_time_commitment":  "Required readings\n\nOut of class completion of assignment"
                                            }
}