{
        "code":  "95-752",
        "name":  "Introduction to Information Security Management",
        "short_name":  "INTRO INFO SEC MGT",
        "units":  12.0,
        "min_units":  12.0,
        "max_units":  12.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is intended to give students an introduction to a variety of information and cyber security topics.  As an introductory course, it will cover foundational technical concepts as well as managerial and policy topics.  The purpose of the course lectures, assignments, reading, inclass presentations, and examinations are to ensure students have sufficient technical awareness and managerial competence that will enable them to pursue advanced study in information security policy and management as they progress through their program.  There is no prerequisite for this course, however successful students will have fundamental knowledge of information and computer systems, and a general awareness of security issues in these systems.",
        "student_sets":  [
                                                {
                                                        "id":  895,
                                                        "name":  "graduate"
                                                }
                                        ],
        "website":  "https://api.heinz.cmu.edu/courses_api/course_detail/95-752/",
        "custom_fields":  {
                                                    "goals":  "Teach students the foundational concepts needed to build an effective information security risk management program, ensuring confidentially, integrity, and availability are maintained as threats attempt to exploit vulnerabilities in information technology practices, policies, procedures, and systems.",
                                                    "key_topics":  "Information Security / Cyber Security\n\nRisk Management\n\nLegal and Privacy Aspects of Information Security\n\nProgram (Software Security)\n\nOperating System Security\n\nWeb / Application Security\n\nDatabase Security\n\nNetwork Security\n\nCryptography\n\nCloud Computing / Security\n\nIncident Management",
                                                    "prerequisite_knowledge":  "Basic knowledge of information technology and security concepts.",
                                                    "assessment_structure":  "Homework assignments (3)\n\nMid-term examination\n\nFinal examination\n\nInformation security research report\n\nThreat intelligence report and senior executive briefing\n\nExtra Credit Opportunities",
                                                    "relevance":  "The concepts of Confidentiality, Integrity, and Availability (CIA Triad) are essential to any organization that utilizes information technology assets to develop, deliver, and protect critical assets (information, technology, people, and facilities) to realize mission achievement in the 21st century. The knowledge of prevention, deterrence, detection, and response capabilities is essential as organizations develop an information security risk management process to respond to threats attempting to exploit vulnerabilities, potentially leading to an unwanted outcome that impacts (financial, operational, health/safety) an organization. This course provides the foundation for an effective information security risk management program.",
                                                    "learning_resources":  "Required text books\n\nOnline resources",
                                                    "extra_time_commitment":  "Required reading assignments: approximately 1 - 5 hours per week\n\nHomework assignments (3): approximately 2 - 5 hours for each assignment\n\nMid-term examination and final examination: varies depending on the student\n\nInformation security research report: 10 - 20 hours through the final 11 weeks of the semester.\n\nThreat intelligence report and senior executive briefing: approximately 2 - 5 hours"
                                            }
}