{
        "code":  "98-001",
        "name":  "Student Taught Courses (StuCo): How to Start a Successful Home Business",
        "short_name":  "STUCO HOME BUSINESS",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will allow students to know the fundamentals of homesmall businesses. What a good home business idea How to start it How to run it, finance it, and grow it and most importantly how to make your home small business contribute to your society.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course, students should have a good understanding of the key concept involved in the Security and Privacy of Blockchain Technologies such as the history and fundamentals of Blockchain Technologies, the importance of high security of decentralized systems built on blockchain, the importance of privacy in the Web3 ecosystem and the ways of achieving and maintaining them in the long term. Students, at the end of the course, will also know how to create their own crypto wallets, write smart contracts, deploy new cryptocurrencies, and mint new NFTs NonFungibleTokens.",
                                                    "key_topics":  "Achieving and maintaining security and privacy of decentralized applications, various blockchain architectures, Cryptography, Cryptocurrencies, Mining, Staking, Smart Contracts, Decentralized Finance, Non-Fungible-Tokens, Metaverses, Decentralized Autonomous Organizations and Central Bank Digital Currencies.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Students will be assessed via attendance, assignments, quizzes and exams.",
                                                    "relevance":  "Nearly all modern software and networked systems are, or will be, exposed to attackers who attempt to subvert the system\u0027s intended goals and of course, blockchain technologies is no exception. When successful, such attacks can have devastating consequences for individuals, companies, and society in general. We have seen multiple instances of successful attacks on decentralized applications built on Blockchain, some of which have wiped out billions of dollars of cryptocurrencies in just a matter of hours. It has happened to Bitcoin, Ethereum, Cardano, and more recently Terra and is almost guaranteed to happen again to the old or new blockchains. As more and more money flows into the crypto ecosystem, the incentive for bad guys to attack the system goes us, hence the importance of having the fundamental knowledge of how to protect yourself from such attacks becomes more profound. This course will help students understand the threats they might face while interacting with decentralized applications on the blockchain, as well as the tools they can use to effectively defend themselves.",
                                                    "learning_resources":  "Students will have access to course web pages for information, Canvas for submissions and grade reports and Discord channel for communication.",
                                                    "extra_time_commitment":  "30 hours outside of class work over the whole semester"
                                            }
}