{
        "code":  "98-054",
        "name":  "Student Taught Courses (StuCo): Methods and Metaphors",
        "short_name":  "STUCO: DESIGN M\u0026M",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "One widely accepted definition of creativity is the ability to draw and rationalize connections. The goal of this class is to learn and practice creativity in the context of design, and expand possibilities for the practice. We will evaluate a wide range of subjectsentities from the concept of language to genus of trees that are both metaphors of design, as well as methods for designing. For the sake of beauty, intrigue, or simply just humor, we will make links between the weird and random to inform a more creative design practice as both a verb and noun. This StuCo is discussion and project based. There are no prerequisites.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will learn to research, propose, manage, iterate, and present a design project in a bottom up approach.",
                                                    "key_topics":  "Design thinking, creativity, speculative design, anti-anthropogenic design.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "A midterm and final project (outlined in syllabus and other parts of this application).",
                                                    "relevance":  "Design thinking is applicable to a range, if not all, jobs. Design is also a very generalist field, and any naturally curious person would probably be happy to be/learn generally.",
                                                    "learning_resources":  "Scanned readings, tutorials on prototyping tools can be offered upon request in a form of office hours.",
                                                    "extra_time_commitment":  "Weekly, around at most 1 hour of work outside class. The midterm and final will likely require up to 6 hours of work (although it would depend on the student)."
                                            }
}