{
        "code":  "98-081",
        "name":  "Student Taught Courses (StuCo): Historical European Martial Arts",
        "short_name":  "STUCO: HEMA",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Are you interested in swordplay Historical European Martial Arts will introduce you to the history of European swordsmanship and give you handson practice in the art of historical fencing. From this course, you will learn the fundamental techniques of various weapons from the European tradition and delve into the historical manuals written by masters of old.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "http://www.cmu.edu/stuco/",
        "custom_fields":  {
                                                    "goals":  "Students will be able to perform basic actions used in historical styles of fencing using various weapons. They will also learn to interpret manuals written by fencing masters from history to further their skills after the course.",
                                                    "key_topics":  "Historical swordplay techniques using longsword, arming sword \u0026 buckler, and rapier.",
                                                    "prerequisite_knowledge":  "No prior knowledge is needed. Students must be prepared to complete weekly assigned readings and participate in hands-on exercises in class.",
                                                    "assessment_structure":  "There will be two midterms and a final exam. Each exam will cover information on the weapon set most recently covered in class. Each week, readings from historical source material will be assigned, and a short virtual quiz will need to be completed prior to class. Extra credit is possible to obtain through participation in optional technique assessments following each exam. These optional assessments will test students\u0027 ability to perform the actions covered during hands-on portions of the course.",
                                                    "relevance":  "Historical European styles of martial arts are often wrongly presented in contemporary media. Many commonplace misconceptions exist because of Hollywood representations of these weapons, which we hope to dispel. Students will learn how these weapons were actually used, while increasing their physical fitness and ability to think tactically on the fly.",
                                                    "learning_resources":  "There are many open source reading materials on the topics we will cover. We will provide links to applicable sources, as well as create supplemental videos for each topic.",
                                                    "extra_time_commitment":  "Homework assigned weekly."
                                            }
}