{
        "code":  "98-049",
        "name":  "Student Taught Courses (StuCo): Introduction to Variant Sudoku",
        "short_name":  "STUCO: VAR SUDOKU",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Students will learn how to solve difficult variant sudoku puzzles as this course considers the fundamental skills, tactics and strategy.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will improve their logical thinking skills and gain an appreciation for neat logical arguments. Students will learn how to solve difficult variant sudoku puzzles, like those that appear in Cracking the Cryptic. Students will learn how to construct their own logic puzzles aka pencil puzzles. Students will develop an aesthetic sense for logic puzzles.",
                                                    "key_topics":  "- Classical sudoku: Intermediate techniques such as X Wings, swordfishes, etc. will be developed. Ideas such as the Phistomefel ring where equivalent sets of digits are constructed will be covered too.\n- Killer sudoku: Use \"\"the secret\"\" (rows/cols/boxes sum to 45), use arithmetic as well as geometric ideas for killer cages.\n- Arrow sudoku: See above.\n- Anti-Knight/Anti-King\n- Coloring: Sometimes we may deduce that two squares must contain the same digit without knowing what that digit is. We will learn how to productively use this idea to solve sudoku puzzles.\n- Renban/Thermos: Ideas of ordering, \"\"this set of digits must contain at least/exactly/at most this many of the digit X\"\", and geometric ideas like roping will be introduced.\n- Chaos Construction: Students will solve sudoku puzzles where the regions must be deduced. Geometric ideas will be developed. Students will be taught to ask simple questions such as \"\"where must this region grow?\"\" and take these ideas to their limits.\n- German Whispers, Entropic Lines, Modular Lines, Even/Odd Lines: Questions of \"\"polarity\"\" will be covered. How many \"\"low digits\"\" (1234) are in this region/row/column? Where must they be? Coloring is relevant here too.",
                                                    "prerequisite_knowledge":  "Basic experience with classic sudoku is suggested but certainly not required.",
                                                    "assessment_structure":  "In the midterm and final, students will create their own logic puzzles to be assessed.",
                                                    "relevance":  "Students who enjoy or are interested in logic puzzles will develop their ability to both solve and construct them.",
                                                    "learning_resources":  "Slideshows with relevant techniques will be shared with the class. Handouts containing lists of sudoku puzzles will be sent.",
                                                    "extra_time_commitment":  "Solving sudokus for homeowork\nConstructing puzzles for the midterm/final"
                                            }
}