{
        "code":  "98-044",
        "name":  "Student Taught Courses (StuCo): Introduction to Flag Design",
        "short_name":  "STUCO:FLAGS",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will cover the design, history, and culture of flags. We will consider the purpose and meaning of flags the characteristics that differentiate flags from other pieces of visual design historical and modern design practices, including flag patterns, devices, emblems, and color symbolism flag terminology and the relevance of flags to cultures around the world. Throughout the course, students will have the opportunity to practice their knowledge by creating flags of their own and receiving feedback from each other. No prior knowledge is required.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of this course, students should be able to look at a flag and identify its design, features, and symbolism.Students should be able to understand how flags convey messages and ideas, and how the unique design requirements of a flag necessitate an important set of flag design rules.Students should be able to understand and identify the key terminology of flag design.Students should be able to describe the history and purpose of flags, and the relationships between families of national flags.Students should be able to design new and interesting flags to represent a region, a culture, or an identity, following the general principles of flag design.",
                                                    "key_topics":  "This course will cover the design, history, and culture of flags. We will consider the purpose and meaning of flags; the characteristics that differentiate flags from other pieces of visual design; historical and modern design practices, including flag patterns, devices, emblems, and color symbolism; flag terminology; and the relevance of flags to cultures around the world.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "-Weekly assignments will consist of a sketch or drawing of a flag based on a prompt given in lecture, accompanied by a short description. These will be individual assignments; they will be turned in on Canvas before the start of the next lecture session.\n-The midterm assignment will be a special weekly assignment completed by groups of two or three (instead of individually). Unlike the weekly assignments, which are graded on completeness and effort, they will be graded on design and artistic merit.\n-Two or three times in a semester, you will give a short (two-minute) presentation about the flag that you have designed for that week\u0027s assignment. Your classmates will then give you comments and feedback on your design. Please make sure to attend class when you are scheduled to present.\n-The final exam will be a short Canvas quiz on the basics of flag design and terminology covered during the semester.\"",
                                                    "relevance":  "Flags are all around us. They inform culture, patriotism, and pride in a variety of identities. They have the power to convey information, signal allegiance, and inspire awe. By taking this course, you will be able to understand why flags arose, what makes flags meaningful and distinct, and most importantly, how to design flags of your own.",
                                                    "learning_resources":  "-Designing flags of your own will be a major component of this course. Any method of creating an image of a flag is acceptable - markers and pens, a drawing app on a tablet, Microsoft Paint, or professional software like Inscape or Adobe Illustrator. One or two lecture sessions will be devoted to introducing these tools. If you need help in finding materials or software, please contact the instructor.",
                                                    "extra_time_commitment":  "Students will have one homework assignment per week, consisting of designing a flag based on a prompt provided in class. This should take less than an hour per week."
                                            }
}