{
        "code":  "98-033",
        "name":  "Student Taught Courses (StuCo): Sampling in Hip-Hop Music",
        "short_name":  "STUCO: HIPHOP SAMPLE",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course takes a deep dive into what sampling is, and how it has made an impact on hip hop and the larger world of music. Whether or not you realize it, sampling surrounds us and defines the music that we listen to. Students will gain appreciation for this often overlooked and occasionally controversial form of music production. Throughout the course, students will interact with different types of sampling, conduct their own analysis, and play games to learn about the history and power of sampling.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will gain an ear for sampling in the music industry, and will understand the power of sampling in the history of hiphop and its role in the industry presently. Students will also gain greater appreciation for the skills of legendary music producers and the art they create. They will also be able to critically analyze music with samples and offer their opinion on production styles",
                                                    "key_topics":  "History of sampling, public reception to sampling, how sampling works, and how producers can use these techniques to create unique music",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Students will be primarily graded on their participation in class discussion and additional participation points will come from games played in class as well as a midterm workshop for creating samples. The final part of students\u0027 grades will come from a short individual presentation during the semester.",
                                                    "relevance":  "Sampling is ever-present in the current world of music and students will be able to identify samples and how they contribute to artistic development. Chances are that everyone in the class has heard many songs that use sampling techniques in the final product, so students have encountered this whether or not they realize it.",
                                                    "learning_resources":  "Students will listen to different music that uses samples and can learn from there, as well as a few websites that go over samples and sampling.",
                                                    "extra_time_commitment":  "Listening to music with samples, watching movies/videos, and working on short presentation."
                                            }
}