{
        "code":  "98-000",
        "name":  "Student Taught Courses (StuCo): Teaching Practicum",
        "short_name":  "STUCO: TCHNG PRACTM",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "All current StuCo instructors are enrolled in this course to receive credit for teaching their individual StuCo courses. StuCo instructors are required to attend periodic meetings focused on course design and instructional strategies conducted by Dr. Hallinen or StuCo organizational meetings conducted by the StuCo Executive Committee in order to receive credit for this course. Please refer any StuCorelated issues regarding registration, application deadlines, coinstructors, room assignments, absences, noshows, etc. to Kristin Lavery, StuCo Course Administrator, Cyert Hall A64A, 4122686819. Dr. Judith Hallinen serves as Advisor for StuCo.   Please Note Kristin Lavery, StuCo Course Administrator must first be added as a proxy to a StuCo instructors course before admission to 98000 will be granted. See StuCo website Teacher Information for more info.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "StuCo instructors willbecome aware of important dates for completion of various tasks throughout the semester, understand expectations and policies for course instructors that are set by the university and by the StuCo bylawsconsider and improve the instructional strategies that are incorporated into their course to maximize student involvement and retention of material, with a focus on the potentially shifting teaching environment during the fall 2021 semesterbecome acquainted with resources at Carnegie Mellon that are available to instructors if they have questions about adjusting teaching strategies or implementing other activities to enhance student learning in their course.",
                                                    "key_topics":  "Student College (StuCo) requirements, teaching, course design",
                                                    "prerequisite_knowledge":  "Students must be recognized by the registrar as an instructor of a 98-xxx (StuCo) course. The course roster is determined by a process conducted each semester by the StuCo Executive Committee (see https://www.cmu.edu/stuco/)",
                                                    "assessment_structure":  "This is a pass / fail course. The final grade will be based on:\n1)\tattending and participating in the beginning of semester meeting [mandatory];\n2)\tsuccessful teaching of the assigned StuCo course on the day/time that is scheduled;\n3)\tsubmitting mid-term and final grades on time, as instructed by StuCo course administrator Kristin Lavery;\n4)\tresponding to any and all inquiries made about the StuCo course.",
                                                    "relevance":  "The course provides resources and individualized consultation opportunities to StuCo instructors who would like to improve their teaching practices and/or explore new educational strategies in the classroom. Other important information about teaching a StuCo course is also shared through this class.",
                                                    "learning_resources":  "A variety of resources that are available at Carnegie Mellon and through web-based education-focused organizations are shared. In addition, the 98-000 instructor is available for consultation at any time during the semester, by request.",
                                                    "extra_time_commitment":  "This course includes a beginning-of-semester meeting and the requirement to teach the assigned StuCo course throughout the semester. StuCo instructors must plan weekly, teach their class, respond to student inquiries, and seek help when it is needed."
                                            }
}