{
        "code":  "98-046",
        "name":  "Student Taught Courses (StuCo): Introduction to Stardew Valley Strategy",
        "short_name":  "STUCO: INTRO STARDEW",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Students will work with a team of four to advance through a year of Stardew Valley gameplay. Gameplay progression wil be structured week by week to be accompanied by lessons on gameplay mechanics, early and late game strategy, as well as general guidance. Students will advance through around 2 weeks of ingame time per real time week, as well as be asked to create a strategy plan, which they will present to the class twice throughout the semester. At the end of the semester, teams will be awarded based on different aspects of gameplay as well as additional wild card achievements. The goal of the class is to introduce new players to the world of Stardew Valley, and help distill the vast amount of possible strategy and mechanics into digestible bits of information to optimize enjoyment for the student  for the duration of the class, and beyond.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Learn core gameplay mechanics for Stardew ValleyLearn basic and advanced strategy for the gameWork with a team to play through a year of the gameGain strategies to continue gameplay on solo game filesGain strategies to continue gameplay beyond year oneLearn resource management skillsLearn team building skills",
                                                    "key_topics":  "Stardew Valley Strategy and Gameplay Mechanics Resource Management",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Early Game Strategy Document\nMid Semester Strategy Document and Progress Writeup\nMidterm Presentation\nFinal Presentation and Farm Tour\nHomework will be submitting proof of game advancement\nAttendance and Participation",
                                                    "relevance":  "Stardew Valley is a critically acclaimed and collaboration based game that gets more enjoyable when strategies are known. This course will teach students resource management strategies and team building skills to help them be successful both in-game and with real life skills.",
                                                    "learning_resources":  "Stardew Valley wiki: https://stardewvalleywiki.com/Stardew_Valley_Wiki",
                                                    "extra_time_commitment":  "~2 Hours outside of class to play through the designated in game days with teams"
                                            }
}