{
        "code":  "98-099",
        "name":  "Student Taught Courses (StuCo): Problem Solving through Solving Problems",
        "short_name":  "STUCO: PSSP",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Do you want to gain strong problemsolving skills Increase your confidence when approaching problems Learn cool strategies and ideas Or even shove pigeons into holes Then this course is for you Step inside the wonderful world of problem solving, where we will tackle enthralling problems, such as How do ants behave when walking toward their neighbor How many grandpas can there be if each student shares one How many guards do we need to make a bank impenetrable And the most challenging question of all, how can math be fun Along the way, we will even become skillful enough to tackle some very challenging problems, from competitions such as the IMO and Putnam",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "cmu.edu/stuco",
        "custom_fields":  {
                                                    "goals":  "The goals of this course are to teach students problem solving confidence, so that they wont be scared to jump into a problem, even if it looks challenging, and also to expand their problem solving toolkit, so when they approach a new problem they have more options on how to approach it.",
                                                    "key_topics":  "Both problem solving strategies (such as symmetry, pigeonhole, invariants), and mathematical concepts applied in unique ways (complex numbers, calculus, etc)",
                                                    "prerequisite_knowledge":  "Familiarity with 21-127/128 or 15-151 will be very useful, but not required.\"",
                                                    "assessment_structure":  "There are bi weekly homework assignments where students work through problems on their own time. Additionally, there is a midterm which consists of a short writing assignment, and a final exam.",
                                                    "relevance":  "The course targets STEM majors, specifically CS/Math, and is relevant for numerous reasons. These skills can be applied to job technical interviews, especially quant firms. Also, for students planning to take the Putnam, we believe this StuCo can greatly benefit them.",
                                                    "learning_resources":  "Students will have access to all the books used in the structuring of the course. Additionally, each class will have a corresponding handout given to the students.",
                                                    "extra_time_commitment":  "Yes, the bi weekly problem sets."
                                            }
}