{
        "code":  "98-034",
        "name":  "Student Taught Courses (StuCo): Minesweeper Done Right",
        "short_name":  "STUCO: MINESWEEPER",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The classic video game, minesweeper, is more intricate even though it might deem simple. This course starts from the basic steps of minesweeper gameplay such as rules and patterns. Then in the earlier portion of the course we will focus on improving speed, and the skills in doing so. Then we go deeper into topics such as efficiency and high difficulty, and how they relate to each other along with speed. At the end of the semester, we will have a mini championship game to top it off. Players at any level are welcome, and everyone will learn something, if not a lot.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Learn various skills involving the different areas of minesweeper.Find what play style suits each student the most.Know how to improve specific skills.",
                                                    "key_topics":  "Patterns, speed, 3bv, efficiency skills, high difficulty skills, estimating probabilities, zini, solvers, synthesizing skills",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Six home works, one take take home midterm, and one final championship.",
                                                    "relevance":  "Most of us have at least saw the game of minesweeper. However, very few of us have deep understanding of the different areas of the game. The students who knows minesweeper, but haven\u0027t look deeply through it, will be interested in learning the intricacies of minesweeper.",
                                                    "learning_resources":  "Various guides in written form or videos.",
                                                    "extra_time_commitment":  "Students have to spend extra time on homeworks and the midterm. Optimally students will play on their own, but it is not required."
                                            }
}