{
        "code":  "98-002",
        "name":  "Student Taught Courses (StuCo): Mastering Connect 4",
        "short_name":  "STUCO: MAST CONNECT4",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This is a course on strategy in Connect 4. It is intended so that even someone who has never heard of Connect 4 can master the game. The main goal is for students to see a given position of Connect 4 and be able to quickly determine the best course of action for the player to move. Experiencing the mastery of a game will help students improve their strategic thinking, which will assist almost all students in their professional careers. The course is lecturebased, and no prerequisites or additional materials are required to take the course. Assignments include weekly homework, a midterm, and a final exam.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The main goal is for students to see a given position of Connect 4 and be able to quickly determine the best course of action for the player to move. Students will have mastered the game and be able to defeat any opponent not in the class.",
                                                    "key_topics":  "- Recognize and calculate forced wins\n- Understand and apply \"Connection Theory\"\n- Understand the strongest opening moves\n- Recognize patterns that reveal the evaluations of common positions\n- Create long-term winning plans near the start of the game",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "There will be homework, a take-home midterm, and a take-home final.",
                                                    "relevance":  "Experiencing the mastery of a game will help students improve their strategic thinking, which will assist almost all students in their professional careers.",
                                                    "learning_resources":  "Lecture slides and homework which cover many positions. The Connect 4 Solver (a website) is capable of explaining any position as well.",
                                                    "extra_time_commitment":  "Homework is to be completed. Students are also expected to play games of Connect 4 outside of class, whether with their friends, robots, or practice partners."
                                            }
}