{
        "code":  "98-041",
        "name":  "Student Taught Courses (StuCo): Sustainable Living",
        "short_name":  "STUCO SUSTAINABLE",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course provides a chance for you to understand the importance of sustainability and to apply different ways of sustainability. You will undergo the concepts of sustainable living under the core themes of FEE EcoCampus. Sustainability focuses not only on human impact on climate change, waste management as well as equity. In addition, you will have opportunities to showcase your understanding of sustainability through various media. This course does not have any prerequisites and is open to all majors and years.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The overall goal is to educate and encourage you to practice more active forms of sustainable living and be more aware that sustainable living applies to different areas, such as carbon footprint, recycling, and food equity.",
                                                    "key_topics":  "Environmental issues; Climate change; Waste management; Equity and equality; Sustainability",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Lectures, exit tickets, projects, and reports.",
                                                    "relevance":  "As there is a growing issue of environmental problems, such as climate change, food wastage, and resource scarcity, the need for environmental awareness is apparent. This course is designed to give students a room to understand and engage in sustainable living practices.",
                                                    "learning_resources":  "FEE EcoCampus Handbook, websites, experimental learning, research articles",
                                                    "extra_time_commitment":  "2 hours out of class"
                                            }
}