{
        "code":  "98-017",
        "name":  "Student Taught Courses (StuCo): Brawl Stars Academy",
        "short_name":  "STUCO: BRAWL STARS",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Students will gain comprehensive knowledge and develop their skills in the popular mobile game Brawl Stars. They will learn valuable team work skills and communication strategies for complex scenarios that may mimic professional issues encountered in the workforce. Students will be evaluated on their course attendance and growth as a Brawl Stars player through games against course staff. By the end of the course, students will have learned effective team communication and meta comp building, as well as have refined their mechanical skill. Ultimately, the goal of the class is to reduce the number of bots in the CMU brawl stars community and engage more of the student body in the art of Brawl Stars.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "After completing the class, students will become deeply familiar with the mechanics and basic strategy of Brawl Stars, both becoming better players and strengthening their accounts.",
                                                    "key_topics":  "Mastering Game Mechanics:\n-demonstrate a comprehensive understanding of Brawl Stars game mechanics, including character abilities, map dynamics, power-ups, and game modes.\n-analyze and strategize based on different in-game scenarios, showcasing a high level of proficiency in controlling and maneuvering their chosen brawlers.\n\nEffective Team Communication and Collaboration:\n-develop strong communication skills, demonstrating the ability to effectively coordinate strategies and tactics with their team members.\n-showcase collaborative gameplay by engaging in successful team-based matches, emphasizing the importance of teamwork; adapting strategies based on the composition of their team and the opposing team.\n\nStrategic Decision-Making:\n-exhibit strategic thinking by making informed decisions during gameplay, such as selecting appropriate brawlers for specific maps and game modes.\n-analyze opponents\u0027 strategies and adapt their own gameplay, showcasing the ability to think critically and make strategic decisions in real-time.\n\nGame Analysis and Optimization:\n-demonstrate the ability to analyze their own gameplay and identify areas for improvement.\n-optimize in-game performance by implementing effective practice routines, refining their skills, and adapting strategies based on personal strengths and weaknesses.\n\nLeadership and Team Coordination:\n-develop leadership skills by taking on different roles within a team, such as shot-calling or strategic planning.\n-coordinate with teammates to execute advanced strategies, demonstrating effective leadership and communication in high-pressure situations.\n\nContinuous Learning and Adaptability:\n-demonstrate a commitment to continuous learning by staying updated on game updates, balance changes, and evolving meta strategies.\n-showcase adaptability by adjusting their gameplay based on the evolving nature of the game, demonstrating a proactive approach to learning and improvement.",
                                                    "prerequisite_knowledge":  "No prerequisites are required to take this course other than a mobile phone supporting the game.",
                                                    "assessment_structure":  "The final course grade will be calculated using the following categories:\n\nParticipation/Attendance - 60%\nHomework - 10%\nMidterm - 10%\nFinal Exam - 10%\n\nParticipation/Attendance: Self explanatory.\n\nHomework: The homework will consist of small quizzes that recap things learned in the previous class. There will also be some assignments where students must complete some in game goal and provide proof of this goal being completed.\n\nFinal Exam: The final exam will be a series of battles against the professors and students where they will be graded based on their performance. Winning battles isn\u0027t required to pass the final exam.",
                                                    "relevance":  "Brawl Stars is a game with hundreds of millions of downloads, a strong esports scene with valuable prize pools, and fundamentally strong design which could inspire innovation in the mobile game sphere. Many students already play and wish to get better at Brawl Stars, while others have played and at some point quit or want to get started. This course can serve as a chance for them to play and build a community around the game.",
                                                    "learning_resources":  "Students will have access to class slideshows, the free game itself, and an optional class-wide in-game \"club\" to help speed up their progression.",
                                                    "extra_time_commitment":  "Students will be instructed to unlock new game modes as homework between each class, which will amount to about half an hour of playing over the week. There will also be brief homework forms to gather information on which brawlers and modes students are interested in getting presentations on."
                                            }
}