{
        "code":  "98-038",
        "name":  "Student Taught Courses (StuCo): Anime From Astro Boy to Your Name",
        "short_name":  "STUCO: ASTRO BOY",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Anime is a limited animation style which originates from post World War II Japan, developed alongside Japanese Consumer Media into an artistic movement, and can be considered one of modern Japans major cultural exports. Through this course, we will be exploring the history of the development of Anime and Contemporary Japan, as well as examining how these came to affect Anime and Anime Culture in the present day. This course is open to anyone with interest in Japanese Media History and Culture and does not require prior knowledge on the subject.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "To gain a deeper appreciation and understand of Anime, Anime Industry, Japanese Culture, and how Anime reflects Japanese Culture and History.",
                                                    "key_topics":  "Anime History, Anime Trends, Japanese Culture, Anime related Media",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "There will be weekly homework and 1 final presentation",
                                                    "relevance":  "Provides chance for anime fans to bond together and to become more informed audiences.",
                                                    "learning_resources":  "I would be providing relevant links to website and providing students with Anime slides from class.",
                                                    "extra_time_commitment":  "Homework and Final Presentation"
                                            }
}