{
        "code":  "98-007",
        "name":  "Student Taught Courses (StuCo): Arranging for Modern A Cappella",
        "short_name":  "STUCO: AMAC",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Are you excited to dive into the world of modern pop a cappella From breaking down arrangements and competitive sets from legendary groups and composers to music from CMUs own groups, students will explore what makes songs and arrangements exceptional. Students will practice transcribing vocal solos, learn to use music software, and understand the differences between transcription and arrangement. Essential components like groove, basslines, vocal percussion, harmony, and voice leading will be covered in depth. They will also explore vowels, consonants, blending, and dynamics to enhance their arrangements.With ample work time dedicated to their own arrangements, students will apply what theyve learned and bring their creative visions to life. Take your love for a cappella to the next levelWhile no prerequisite knowledge is strictly required, it is highly suggested that prospective students have some experience with group singing or ensemble music e.g. choir, jazz ensemble, orchestra, etc.. Basic music theory is a plus additional work will be required of students outside of instruction time in the first few weeks to catch up if not familiar with the standards of western musical notation and ear training. Students must have access to a computer.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Develop understanding of modern a cappella, significant progress on an original arrangement of a music piece",
                                                    "key_topics":  "Song Selection and Arrangement Planning - Identifying great songs for a cappella and learning how to structure a successful arrangement.\nHarmony, Voice Leading, and Groove - Mastering chord progressions, vocal techniques, basslines, and vocal percussion for a polished arrangement.\nAdvanced Concepts and Evaluation - Exploring deeper musical ideas and critically evaluating arrangements to create impactful and refined pieces.",
                                                    "prerequisite_knowledge":  "While no prerequisite knowledge is strictly required, it is highly suggested that prospective students have some experience with group singing or ensemble music (e.g. choir, jazz ensemble, orchestra, etc.). Basic music theory is a plus; additional work will be required of students outside of instruction time in the first few weeks to \u0027catch up\u0027 if not familiar with the standards of western musical notation and ear training. Students must have access to a computer.",
                                                    "assessment_structure":  "Students are expected to attend class and engage with the creative process. For full credit, students also must submit an arrangement that demonstrates the student\u0027s musical growth. Weekly out-of-class assignments will be provided to assist the students\u0027 growth, but are not required to earn a passing grade. While no strict grading system will be undertaken (all assignments are completion-based), the instructor will work with students to create an accountability framework to keep students engaged.",
                                                    "relevance":  "Modern a cappella music is a vibrant and evolving genre that has captivated audiences worldwide. With the popularity of a cappella groups and media such as Pentatonix and Pitch Perfect, a cappella is an ever-present part of the musical traditions of college campuses.\nThis course will enable students to develop their arranging skills, understand the intricacies of vocal harmony, and explore the creative process behind a cappella performances. Whether students are aspiring musicians, arrangers, or simply fans of a cappella, this course provides an opportunity to deepen their appreciation and contribute to the ever-expanding world of modern a cappella music.",
                                                    "learning_resources":  "Materials such as recommended readings (textbooks and articles), videos, and music scores for students to develop their skill set will be provided.",
                                                    "extra_time_commitment":  "Various assigned readings and videos on a cappella that are relevant to the upcoming week\u0027s topic. Depending on the student\u0027s chosen grading contract, weekly assignments to provide additional context and learning opportunities. Optional additional commitment to work on the student\u0027s arrangement."
                                            }
}