{
        "code":  "98-019",
        "name":  "Student Taught Courses (StuCo): Every Day Carry \u0026 Community",
        "short_name":  "STUCO: EDC-COMMUNITY",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course aims to explore the items and training individuals can carry with them to build their communities and improve resilience. From radios and first aid to HDMI cords and bystander intervention, well discuss how to better care for those around us at personal, local, and regional levels.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will have a welldefined and scoped every day carry pen firstaid kit umbrella, emergency preparedness plan local evacuation routes, local protocols, civic engagement bystander intervention training, and stronger sense of social responsibility tempered by the diversity and interests of their peers in what they bring to show the class for assignments.",
                                                    "key_topics":  "Community Organization, Emergency Preparedness, Self-Sufficiency, Every Day Carry",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Students will be primarily tasked with regular presentations of their progress in developing their EDC. To eliminate any factor of cost, it will not be required for students to actually purchase equipment or materials with photos being acceptable, but a physical \u0027show-and-tell\u0027 format is encouraged. Instructor will provide sets as a placeholder or for students to practice with.\n\nStudents will additionally be graded on completion of certifications like FEMA\u0027s emergency preparedness. Opportunities for CPR and ham radio training will be communicated. However, if not available will not be graded.\n\nStudents will finally be graded on practical skills demonstrations. For example, during the session on digital device management, students will be tasked with displaying basic IT competency - identifying and using HDMI cords, creating and activating a bootable USB for a seemingly non-functional laptop. These demos will be relatively short based on class enrollment. Demonstrations are intended to improve personal resiliency and expand each student\u0027s capability as an organizer of events in their community. Office hours will be available for students unable to practice these skills on their own.",
                                                    "relevance":  "All students are part of communities, whether it\u0027s their college campus, hometown, or larger society. Learning about community organization, mutual aid, and personal responsibility empowers students to actively participate in their future. This course will build lifelong skills and instill a sense of social responsibility students can carry with them.",
                                                    "learning_resources":  "Federal Emergency Management Agency (FEMA), GitHub documentation (various), Office Hours, regional communities - Public Safety, BikePGH",
                                                    "extra_time_commitment":  "Yes! Students will be expected to share and develop their Every Day Carry (EDC); acquire and practice new skills briefed on during the course.\n\nFor example, after the session describing the use of naloxone in reversing opioid overdoses, students will have the opportunity to request free materials to carry from a local nonprofit. The opportunity to bring or be provided items like paracord and demonstrate an ability to tie knots (or an alternative like zip ties for accessibility)\n\nStudents will also be presented with training opportunities from regional groups like the Red Cross for CPR training, and the ARRL for ham radio communications for scenarios where cellular connections may be impacted.\n\nWith the nature of skills-based sessions, demonstrations are preferred over direct homework deliverables (besides practice). However, if class enrollment proves to be an obstacle to smoothly have both demos and lecture, students may be asked to take videos and submit ahead of time.\n\nStudents will be expected to write a report and/or design slides describing their list(s) of every day carry items throughout the semester, including identifying uses and opportunities for improvement. Ideally students are encouraged to contribute back to the class in an anthropological fashion, with students having a secondary benefit of learning about their peers in the CMU community through the objects they carry."
                                            }
}