{
        "code":  "98-028",
        "name":  "Student Taught Courses (StuCo): Arab Women Through the Lens of Film and Theater",
        "short_name":  "ARAB WMN THRU FILM",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The positioning of Arab women in Arab societies including gender roles, power,expectations, etc. has changed over time as Arab societies underwent political andsociocultural changes. One medium where we can see these changes is film. In thiscourse, we examine Arab films from different periods in time, specifically prioritizing theportrayal of Arab women in them, and what this portrayal reflects about the society,culture, and politics of the time.Our classes will discuss selected films that allow us to understand the positioning of Arabwomen in a certain society and time period, and our discussions will be informed byreadings on relevant theoryhistory that allow us to have a productive analysis. Thiscourse is thus relevant to students interested in both film studies and social structures,especially using film as a tool to understand social implications about Arab women in Arabsocieties. In this discussionbased class, students will have the opportunity to practice filmanalysis in class, and will build skills to eventually present an original studentled filmanalysis to the class.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}