{
        "code":  "98-026",
        "name":  "Student Taught Courses (StuCo): Genshin Impact: Team Building",
        "short_name":  "STUCO: GENSHIN TEAMS",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Students will learn  how to optimize Genshin Impact team builds and team fighting strategies. Understanding the different types of elemental reactions and best team builds for each character will help students with strategic thinking and leadership skills, both critical components to students pursuing their professional careers in any field.   Students will experience lectures analyzing different Genshin team builds and techniques in battling against certain bosses in the game. Students will also have a portion of class time to independently practice their own skills and ask questions about their build.   Students must have a proficient knowledge in Genshin Impact and a minimum Adventure Rank of 16. A diverse number of characters are recommended to test out different team builds but it is not required.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "After this course, students will be able to build their own Genshin teams and display their knowledge in the different roles characters can play in a team.",
                                                    "key_topics":  "Genshin Impact Team compositions, elemental reactions, Genshin\u0027s cultural influences, and calculating percentages for strengthening characters.",
                                                    "prerequisite_knowledge":  "Students must have some experience with the game Genshin Impact.",
                                                    "assessment_structure":  "Students will be assessed with Google Form assignments and individual showcases of their team builds.",
                                                    "relevance":  "This course is relevant as some students are interested in playing games, such as Genshin Impact, and they may be interested in learning how to make their Genshin teams stronger.",
                                                    "learning_resources":  "Students will have access to Youtube videos that display certain Genshin teams and a spread sheet for building individual characters.",
                                                    "extra_time_commitment":  "If students are unable to finish their assignment in class, they will have to finish it as homework"
                                            }
}