{
        "code":  "98-067",
        "name":  "Student Taught Courses (StuCo): We Are Not Alone-Supporting Peer\u0027s Mental Health",
        "short_name":  "STUCO: PEER M HEALTH",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This class invites students into Carnegie Mellons Wellness Lab space, where they will learn how to better support themselves and their peers through mental health struggles. Students will learn skills and tools for supporting themselves and others and accrue a breadth of knowledge on the resources and options for selfcare and treatment both on and offcampus through guest lectures, thoughtprovoking readings, and inclusive and open class discussions. Disclaimer This course will cover potentially triggering topics of mental illness, depression, trauma, and suicide. If this material is triggering in any way, accommodations will be made.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1. Critically reflect on the challenges of mental health in a university setting2. Understand that peoples diverse identities and background affect their mental health in different ways3. Apply tools to navigate your own mental health or emotional struggles4. Identify situations in which a peer may be struggling5. Apply tools to navigate conversations with others who are experiencing mental health or emotional struggles6. Use active listening skills when engaging with others7. List and explain key oncampus and offcampus resources for a variety of mental and situational struggles8. Refer struggling peers to relevant tools and resources",
                                                    "key_topics":  "Mental Health, Peer Support, Self Care, \u0026 Campus Resources. -- This class will provide students an opportunity to develop their skills as peer mental health supporters. These skills can then be applied to everyday life, enabling them to identify potentially struggling peers and step-in to help as appropriate.",
                                                    "prerequisite_knowledge":  "None!",
                                                    "assessment_structure":  "Class Project, Mid-Semester Checkpoint for project, Homework readings",
                                                    "relevance":  "Students will learn skills to take care of themselves and their peers specifically at Carnegie Mellon that will be invaluable for them to thrive during their time here. These skills can be taken with them to help in the future.",
                                                    "learning_resources":  "Lists of available relevant reading, videos, and artistic projects posted for each week of class.",
                                                    "extra_time_commitment":  "Each week students should come prepared having read or engaged with some kind of source/media on the topic. Additionally, they should prepare about a half page of bulleted notes, takeaways, and sharing points, which they will upload prior to class. They will be requested to share what they think is important for others to know about what the source they viewed. Students can miss 1 week of homework with no penalty."
                                            }
}