{
        "code":  "98-075",
        "name":  "Student Taught Courses (StuCo): Buddhism and Chinese Culture",
        "short_name":  "STUCO: BUDDHISM",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "What do you know about Chinese culture Have you wondered what does Zen mean in Buddhism and how it becomes part of the English vocabulary Are you confused about the differences between Tibetan Buddhism and Chinese Buddhism Do you want to know the historic origins of the conflicts between Dalai Lama and Chinese government Are you surprised by the diversity and exuberance of Buddhist art Do you know some Chinese festivals and rituals were influenced by Buddhism Do you want to be able to introduce some history, characteristics and origins of some Chinese cultural phenomena when you go to China If you are interested in any questions above or just want to know about Buddhism or Chinese culture in general, then this is the course for you. Buddhism hugely impacted the Chinese culture. This course will examine a variety of Chinese cultural elements. We will cover topics such as famous tourist mountains, Buddhist art, Zen and its meanings, Tibetan Buddhism, Shaolin martial art, and tea culture. We will link of some the recent trends and events so that we can make connections to the modern world we are living with. This is not a religion course, the focus is the cultural part, although some Buddhist teachings will be covered to have better understanding of the history. Chinese is not a requirement for this course, but this course will strengthen your grasp of Chinese.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}