{
        "code":  "98-069",
        "name":  "Student Taught Courses (StuCo): Production for Popular Music",
        "short_name":  "STUCO: MUSIC PROD",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This introductory course focuses on the technical process of producing popular and electronic music. Students will learn the ins and outs of a Digital Audio Workstation known as DAW, and how to create instruments and audio tracks to compose and mix their own music. They will also be introduced to many key concepts such as MIDI, sound synthesis  manipulation and audio effects  processing to help them in their creative process.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Use a variety of electronic MIDI instruments.Record live instrumentalists or vocalists directly into their DAW.Automate parameters in a track.Use generative tools and effects to automate parameters within a track.Understand the basics of popular music mixing and mastering stages and skills.Use a variety of audio processing effects such as Compression, EQ, Reverb, Delay, and Distortion.Provide constructive feedback to fellow classmates work.",
                                                    "key_topics":  "Usage of a Digital Audio Workplace and many of it\u0027s capabilities, (MIDI, recording audio, automations/animations, generative tools, mixing, mastering, audio effects, etc.)\nLearning how to provide effective creative feedback to others music.",
                                                    "prerequisite_knowledge":  "This course does not have any prerequisites or co-requisites.The students are not required to have any previous music experience.",
                                                    "assessment_structure":  "Participation - 25%\nStudy 1 - 5%\nPiece 1 - 20%\nStudy 2 - 5%\nPiece 2 - 20%\nFinal Piece - 25%\n\nParticipation: Students are expected not just to show up to class, but engage with the content. Asking questions, providing commentary on how they approached certain methods of utilizing instruments and recording. During critique classes, other students are expected to give creative feedback that is both constructive and meaningful.\nStudy 1: Demonstration that students understand how to use MIDI instruments.\nProject 1: Demonstrates students know all the electronic instruments they have been introduced to so far.\nStudy 2: Demonstration that students understand the introductory mixing process with selected instrument.\nProject 2: Demonstrates students understand the mixing and mastering process they have learned.\nFinal Piece: Demonstrates the students understanding of the entire course\u0027s content, and applies their knowledge to the style they want to produce.",
                                                    "relevance":  "CMU offers many high level courses for Popular and Electronic Music, but have the assumption attending already have experience using a DAW. This course will allow more students to learn those topics and pursue further music endeavors CMU offers.",
                                                    "learning_resources":  "Canvas page with all class presentations, case studies from the instructors, optional seminars with invited experts on specific topics.",
                                                    "extra_time_commitment":  "Homework is distributed through studies and projects. The projects function as quizzes and tests to demonstrate the students learning, but also provide a beginner portfolio for the student."
                                            }
}