{
        "code":  "98-025",
        "name":  "Student Taught Courses (StuCo): Introduction to Roguelike Games",
        "short_name":  "STUCO: ROGUELIKES",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Students will learn to play roguelike games and will be taught skills applicable across these games and about popular games in the archetype. The focus will be on games that are free and widely available, rather than those that are paid. Students will be exposed to over 50 different types of games. The goal is to make students adeptly play and possibly beat different roguelikes, both as a way to have fun and to train students strategic thinking abilities.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will have been exposed to a variety of games, and will hopefully have found at least one game that they greatly enjoy. Along with that, students will have a general understanding of the history of roguelike games, and extensive knowledge of the tactics and strategies that can be used to beat them.",
                                                    "key_topics":  "The tactics and strategies needed to win roguelike games, and introductions to the most prominent / interesting roguelike games.",
                                                    "prerequisite_knowledge":  "No prerequisite knowledge is necessary. Familiarity with games of any sort, especially tactical games like chess, is a plus.",
                                                    "assessment_structure":  "Attendance will be assessed by presenting a morgue file (a record of how a game went, available by default in all roguelike games that we will play) at the end of every class, to show their highest runs. The midterm and final will be based on attendance and engagement, and students will be asked to play through a seeded run of the game (where all players have the same map and enemies).",
                                                    "relevance":  "We hope that the course will help students to learn more about a hobby they enjoy, and to provide them with a fun and engaging activity that they can use to relax.",
                                                    "learning_resources":  "Students will have access to slides presented in class, some helpful spreadsheets, and a variety of useful websites that we have curated.",
                                                    "extra_time_commitment":  "Students will have homework in the form of assigned readings and playing games. The readings will cover the design and strategy of roguelike games, as well as many of the games themselves. Students will be expected to try out the new games shown each week for homework as well. The commitments outside of class should never take more than 1-1.5 hours each week."
                                            }
}