{
        "code":  "98-095",
        "name":  "Student Taught Courses (StuCo): Introduction to Plants vs Zombies",
        "short_name":  "STUCO: PLANTSVZOMBIE",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The zombies are coming... and there is only one way to stop them Learn how to protect your brains against ravenous zombies by growing an army of specialized plants on your lawn. In this course you will learn the ins and outs of Plants vs Zombies, and master creating the perfect lawn defense. Learn how to adapt your strategy to different levels discover the abilities, drawbacks, and personalities of each plant and zombie. Whether you are a beginner or a seasoned player, you will be able to learn something new In addition to regular gameplay, this course will cover Plants vs Zombies mini games. This course only covers the original Plants vs Zombies game and will not cover the sequels.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "cmu.edu/stuco",
        "custom_fields":  {
                                                    "goals":  "After completing this course, students will be able to fully complete Adventure mode with an understanding of the abilities of every plant and zombie.",
                                                    "key_topics":  "Students will learn the mechanics of Plants vs Zombies, including the abilities of each plant and zombie, as well as various strategies for lawn defense. In addition to playing Adventure mode, the course will also cover various available game modes such as Survival and Puzzle mode.",
                                                    "prerequisite_knowledge":  "Students do not need any prerequisite knowledge!",
                                                    "assessment_structure":  "There will be weekly homework, a midterm project, and a final project.",
                                                    "relevance":  "Plants vs Zombies is a strategy game, where players must manage their resources wisely and choose the right plants to use to successfully defend against the zombies. By taking this course, students will learn to problem solve, deal with high pressure scenarios, and learn to be creative when coming up with new strategies.",
                                                    "learning_resources":  "The online Plants vs Zombies wiki is a very helpful resource!",
                                                    "extra_time_commitment":  "There will be weekly homework assignments, usually involving playing the game."
                                            }
}