{
        "code":  "98-012",
        "name":  "Student Taught Courses (StuCo): Fun with Robots",
        "short_name":  "STUCO: FUN WTH ROBTS",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course teaches students the basics of programming, sensors, motors, and control using a Romi robot. Students will also build a basic breadboard circuit and use real sensor data to navigate. The course lecture format will include instructional slides and teaching at the beginning of each lecture, followed by a brief lecture on how what we do in class connects to realworld robotics. This is followed by supervised programming time, where the instructors will answer questions and advise students working on labs. There is a 10 lab fee. If your financial situation makes this fee an obstacle to your participation in the class, please talk to the instructors.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "http://www.cmu.edu/stuco/",
        "custom_fields":  {
                                                    "goals":  "Our goal in teaching this course is to teach students about the main aspects of robotics, programming, circuitry, actuation, and control. Connect lessons and lectures to realworld robotics. Upon completion of this course, the student will be able to Formulate an Arduino program that controls the robot in response to inputs when given a simple task. Construct a circuit to connect a resistive sensor to a robot and explain why a sensor circuit allows the robot to read a sensor. Utilize existing parts to create an assembly that completes a given task. Explain the purpose of each aspect of a PID control and write a basic PID control algorithm so the robot can complete a task effectively and efficiently. Describe different areas of robotics and how they are used to create functional robots.",
                                                    "key_topics":  "Arduino programming, robots, robotics hardware, computer programming, circuitry, actuation, control algorithms",
                                                    "prerequisite_knowledge":  "No programming, engineering, or robotics experience is needed to take this course; we teach everyone the basics of Arduino programming. However, there will be additional projects for students who have experience in programming or robotics and want to learn more.",
                                                    "assessment_structure":  "Labs will be graded pass/fail based on completion of all the task requirements. Completed labs are accepted on a rolling basis with the final due date being the last day of the course; however, lectures follow a schedule of roughly three to four weeks between each lab.\nThe passing criteria are as follows:\n- Participation in every assigned lab.\n- Successfully complete (pass) three of four main labs or two main labs and one optional lab.\n- Attend all class sessions (except for excused absences and a maximum of two unexcused absences). Students will fail the class if they miss more than two classes.",
                                                    "relevance":  "Fun with Robots is designed to introduce any student, regardless of their technical background, to the fundamentals of robotics and programming in low-stress and engaging environments.\nBy hosting this class as a StuCo, students from multiple disciplines can fit into their schedule without the pressure of significant academic rigor. The interdisciplinary nature of our course is also reflected in its instructors, all of whom come from different majors and interests.",
                                                    "learning_resources":  "At the beginning of each class, an instructor will lead a short lecture to provide the background in robotics and programming that the class will need to complete the upcoming lab.\nSlides with links to external resources will be published on Canvas after each lecture.\nAt least 3 of 4 instructors will be available for every class to answer student questions and help debug programs as needed.",
                                                    "extra_time_commitment":  "Since each lab is very hands-on and often requires assistance to complete, especially for those without a technical background, we intentionally structure our course to have a longer runtime, multiple instructors, and assignments that minimize time commitments outside of class. This ensures that students can receive help in real time as they need it, as opposed to struggling alone outside of lecture time.\n\nWe will do our very best to avoid assigning any work that must be done outside of class, and history shows that students are capable of finishing everything within the two hours per week. We expect everyone to attend class on time and actively participate. If a student is not able to attend a class, we ask that they inform us prior to lecture."
                                            }
}