{
        "code":  "98-043",
        "name":  "Student Taught Courses (StuCo): Chess Tactics and Strategy",
        "short_name":  "STUCO: CHESS",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Chess is a strategy game that teaches many different useful skills. Themes such as problem solving and pattern recognition prominent in chess can be applied in many areas of life, such as academics. This course will cover vital principles of chess such as tactics, piece development, center control, common pawn structures, and more. The course will look at elementary endgame positions and themes like king activity and the value of passed pawns. We will look at famous games such as the Opera Game to illustrate various chess concepts. Finally, we will of course need to put our learning into practice, and so we will have time towards the end of each class to play games of chess. This course is suitable for students who know the basic rules of chess and are interested in improving their game.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Strengthen valuable skills like pattern recognition and problem solving. Be able to recognize and name tactics like forks, skewers, pins, discovered attackschecks, and double attackschecks. Know opening themes and be able to play moves based on opening and middlegame priorities. Be able to recognize some common pawn structures and know themes surrounding these structures. Recognize some famous and significant chess players of the past and present. Be able to read algebraic chess notation. Become a stronger chess player.",
                                                    "key_topics":  "Tactics, Piece Activity, King Safety, Pawn Structures, Attacking the Castled and Un-castled King, Endgame Play, and Major and Minor Piece Checkmating Procedures.",
                                                    "prerequisite_knowledge":  "This course is suitable for students who know the basic rules of chess and are interested in improving their game.",
                                                    "assessment_structure":  "Homework nearly weekly as well as a midterm structured as a team competition, and a final structured as an individual competition.",
                                                    "relevance":  "This course is relevant for all students as it teaches useful skills such as creative thinking, problem solving, and pattern recognition. Improving one\u0027s skills is beneficial as chess is such a mainstream game now with its recent surge in popularity.",
                                                    "learning_resources":  "The studies or compilations of positions used for the lecture (with move annotations) will be available for students after each lecture. There may also be links provided for certain historical games or elite tournaments being played at the time.",
                                                    "extra_time_commitment":  "Homework"
                                            }
}