{
        "code":  "98-078",
        "name":  "Student Taught Courses (StuCo): Who is Hatsune Miku? An Introduction to Vocaloid",
        "short_name":  "STUCO: VOCALOID",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "A character. An instrument. An icon. A meme. To the uninitiated, Vocaloid can be a confusing subject. This class will introduce you to the music, history, and culture of vocal synths commonly referred to as Vocaloid in Japan. A bulk of the course is a survey of artists, producers, and works involving Vocaloid. Assignments will involve listening to Vocaloid songs and discussing their place and impact on the greater Vocaloid community. We will mainly focus on works using Yamahas voice synthesizing program, Vocaloid, and other paid software such as CeVIO, though the technical aspects of the class will be taught using UTAU, a free program with similar capabilities. No prior knowledge of music production is required.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will have a good understanding of what Vocaloid music is, what are the general attitudes fans of this niche have, and how vocal synth programs are used. Students should be able to name a few popular Vocaloid producers and recognize the differences between different vocal synth programs by the end of this course.",
                                                    "key_topics":  "This course will cover Vocaloid music, its impact on society and larger music spheres, the culture of Vocaloid fandom, and the technology involved in Vocaloid and similar synth programs.",
                                                    "prerequisite_knowledge":  "No prior knowledge",
                                                    "assessment_structure":  "Students will have weekly assignments, a midterm paper, and a final project (essay or song).",
                                                    "relevance":  "This course will introduce students to a niche of music they may not have known before, and broaden their understanding of how technology, music, and culture influence each other.",
                                                    "learning_resources":  "Students will have access to the lecture slides, video tutorials on the UTAU program, and additional readings and links to songs.",
                                                    "extra_time_commitment":  "Yes. Weekly assignments should take anywhere from 10-30 minutes and students are expected to make an obvious effort towards the final project deliverable."
                                            }
}