{
        "code":  "98-039",
        "name":  "Student Taught Courses (StuCo): Introduction to GO",
        "short_name":  "STUCO: GO GAME",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In this course, students will embark on a journey to explore the ancient and intellectually stimulating game of Go also called Weiqi or Baduk. Students will enhance their skills in critical thinking, planning, adaptability, concentration, spatial awareness, and the art of decisionmaking in the face of complex tradeoffs. This course aims to equip students with the fundamental knowledge and skills to appreciate, play, and strategize in the world of Go. The instructional method for this course is primarily lecture, demonstration, and practice, with a blend of presentations, exercises, reviews, and handson gameplay.   No monetary fee is required for this course. Students will not need to buy textbooks, software, or physical stonesboards.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "At the completion of the course students will be wellequipped to engage in Go games confidently, gaining a strong understanding of the basic rules of Go, tactical maneuvers such as nets, and opening and endgame strategies. Students will gain handson experience with Go games during and after class, honing their skills through practical gameplay. Formally, it is estimated that students would be able to progress from 30 kyu to 20 kyu through this course from beginner to casual player. Students will also refine other transferable skills such as critical thinking, planning, adaptability, concentration, spatial awareness, and strategical decisionmaking.",
                                                    "key_topics":  "This course will cover the following key subject topics:\n1. The basic rules of Go, including stone placement, game objectives, how territory is calculated, and the concept of liberties.\n2. The concept of Life and Death in Go, such as recognizing whether a group is living or dead, understanding classic formations, engaging in capturing races, and identifying eye spaces.\n3. Practical battle tactics such as ladders, double Atari, nets, snapbacks etc.\n4. Opening and endgame strategies, including 3-4 and 4-4 corner openings, overall board opening patterns, and the concept of sente in endgame tactics.\n5. Hands-on practice with Go, learning how to analyze and review gameplay so that students not only learn how to play Go, but how to continue polishing their skills in Go on their own after the class is over.",
                                                    "prerequisite_knowledge":  "No prerequisite or prior knowledge is assumed for this course. Beginners and newcomers to Go are welcomed, and the course content is designed to discover the world of Go from square one.",
                                                    "assessment_structure":  "Students will be assessed based on participation and surveys (10%), multiple-choice quizzes (15%, with the lowest dropped), practice games (25%, with the lowest dropped), a Midterm (20%, involving a multiple-choice exam), and a Final (30%, involving an in-class practice game).\nIn general, students will be assessed on how to play Go, rather than the specific usage of jargon and terminologies. For practice games, students will be judged on their strategic choices, thought processes, and overall engagement with the game, rather than if they won the game.",
                                                    "relevance":  "Through this course, students will be able to gain transferable skills such as critical thinking, planning, adaptability, concentration, spatial awareness, and strategical decision-making, all useful skills in a variety of disciplinary areas.\nIn particular, the computational and analytical skills gained from playing Go (such as estimating territory, calculating liberties) will help students in quantitative fields of study such as mathematics, engineering, and computer science. Moreover, learning to adapt to changing circumstances due to the dynamic and fast-paced nature of Go can prepare students to adapt to unfamiliar scenarios and perspectives while understanding complex social issues and cultural contexts. Go also requires significant patience, attention, and concentration to play the game well, which is important when reading and analyzing texts, participating in discussions, conducting interviews, debugging code, and more.",
                                                    "learning_resources":  "Lecture slides, video tutorials, and homework solutions will be posted regularly. Students will also be able to use https://online-go.com/play to play games with computers or other players, create custom games with other students, create demo boards to freely experiment with, do optional exercises, learn joseki patterns, and review matches played by professional Go players. Instructions for how to use this technology will be taught to the student on the first day of class. In addition, while there is no required textbook for this class, the instructor will provide guidance to students to access optional resources such as interactive Go tutorials, video series, and books such as \"Lessons in the Fundamentals of Go\".",
                                                    "extra_time_commitment":  "Students will need to complete 5 multiple quizzes during the first 5 weeks of the course, which composes 15% of their final grade (the lowest quiz is dropped). In addition, students will need to play 6 practice games outside of class, which composes 25% of their final grade (the lowest graded game is also dropped)."
                                            }
}