{
        "code":  "98-010",
        "name":  "Student Taught Courses (StuCo): Intro to Submission Grappling",
        "short_name":  "STUCO: GRAPPLING",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course provides a comprehensive introduction to Brazilian JiuJitsu BJJ, focusing on practical selfdefense techniques and strategies. Through weekly lessons, students will grasp fundamental principles, such as leverage, technique, and timing, to effectively defend themselves, particularly against larger opponents. While prior martial arts experience is not required, a background in wrestling, judo, or other grappling disciplines can enhance understanding.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Participants will be able to survive, control, and submit opponents in a physical environment.",
                                                    "key_topics":  "Weekly sessions will guide students through various techniques, with ample opportunities for hands-on practice and refinement. In addition to instructor-led lessons, students will engage in live sparring sessions, where they can apply learned techniques in dynamic, real-world scenarios. Assigned homework will reinforce concepts covered in class and facilitate ongoing skill development.",
                                                    "prerequisite_knowledge":  "Prior knowledge isn\u0027t needed but can be helpful.",
                                                    "assessment_structure":  "Assignments, participation, and technique assessments.",
                                                    "relevance":  "Brazilian jiu-jitsu is the most vital for martial arts as most conflicts end on the ground. It serves as an amazing workout while teaching how to control an opponent in a defense scenario.",
                                                    "learning_resources":  "Students will have access to videos and video instructionals.",
                                                    "extra_time_commitment":  "Homework and videos."
                                            }
}