{
        "code":  "98-016",
        "name":  "Student Taught Courses (StuCo): Genshin Impact - Theorycrafting 101",
        "short_name":  "STUCO: GNSHN THEORY",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The purpose of this class is to deepen students understanding of Genshin Impacts game mechanics with emphasis on numbersbased theorycrafting, the Iceberg of game mechanics, and some lore. Students will develop the skills necessary to construct optimized teams, create their own rotations, and clear spiral abyss with ease. We emphasize ease of access, so this class will mostly discuss optimal FreeToPlay team options. However, instructors will briefly go over constellation mechanics.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "After successful completion of this course, students will have the ability to demonstrate...Team building skills under certain specific scenarios.Knowledge of lesser known game mechanics, such as reverse and forward bloom. An understanding of artifact RNG, mechanics, and optimization.Deep understanding of the Keqing mains elemental gauge unit system AND demonstrate its practical applications. Having a deep understanding of the theorycrafting iceberg.Having a decent understanding of the lore of Teyvat.An understanding of trap banners.",
                                                    "key_topics":  "The course will cover the following:\n-Properties of elemental reactions.\n-Building effective teams.\n-How do Gauge units work?\n-How do artifacts work and how do we take advantage of them?\n-What banners are good to pull on and why?\n-Interesting deep lore that isn\u0027t explored directly in the main quests.",
                                                    "prerequisite_knowledge":  "Students should have a basic grasp of what Genshin Impact is as a game. The minimum knowledge required is to simply memorize the names of the seven \"elements\". Students DO NOT need to come in with an understanding of the elemental reaction system.\nStudents should also have a basic understanding of the game\u0027s story.",
                                                    "assessment_structure":  "This course is a pass or no credit course. Assignments may be completed in a variety of ways. Should students have access to the minimum resources, they may be asked to submit videos of certain rotations. For example, instructors may ask students to submit a 15 second rotation demonstration of the \"International team\". If students cannot submit videos for any reason, they have the option to submit a short write-up analysis of the current team/ rotation being discussed. Students may also be asked to submit short writings about lore and lore related theory.\nAll assignments will be submitted through canvas unless otherwise stated.\n\nAny assignments submitted up to 1 week late will receive a maximum of 75% credit and an additional 15% is removed for each day it is late after that. Assignments submitted over two weeks past the due date will receive no credit.\n\nStudents may submit a request for an extension or to make up work up to 24 hours before the due date. Students simply need to provide a reasonable excuse and instructors will be very understanding.\n\nAssigned work other than the final will be graded on effort and completion.\n\nAs a midterm exam, students will be asked to demonstrate their favorite team for the class.\n\nThe final exam will consist of a multiple-choice portion in which students will demonstrate knowledge of game mechanics, and a free response portion in which students will craft a team to deal with a theoretical abyss chamber.\n\nAttendance and participation: 50%\nAssignments: 30%\nMid-Term: 5%\nFinal Exam (don\u0027t worry too much about this): 15%\n\nA final grade of 70% or above is required to pass the course.",
                                                    "relevance":  "Many Carnegie Mellon Students play Genshin Impact. Through conducting an informal survey there are many people who are enthusiastic about the popular worldwide game. Many people in CMU related discord servers have also expressed interest in both Genshin Impact, and a attending STUCO course.",
                                                    "learning_resources":  "Instructors recommend that students reference the Keqing Mains Theorycrafting library, as well as the YouTube channels of \"Zyox\" and \"Zajef\".\nInstructors will make a google doc of important links available to the class.",
                                                    "extra_time_commitment":  "Students will receive about 10-30 minutes of homework per week. Homework can include readings, video submissions, and short writings."
                                            }
}