{
        "code":  "98-057",
        "name":  "Student Taught Courses (StuCo): Intro to Polytopes",
        "short_name":  "STUCO PERENNIAL PHIL",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This multifaceted course introduces students to polytopes, which are the ndimensional generalizations of polygons and polyhedra. Topics include the history of the field such as the work of Coxeter, Grnbaum, and Schlfli their combinatorial structure as abstract polytopes classes of polytopes e.g. regulars, uniforms, and nobles operations on polytopes including truncations, products, and conjugations connections to group theory, such as Coxeter groups and the monodromy group connections to topology via simplicial complexes more recent developments, e.g. generalizations to hypertopes and the polytope rendering software Miratope. Additionally, students will have the opportunity to join the Polytope Discord, some of whose members are conducting research in the field. The course will reference Abstract Regular Polytopes McMullen, Schulte and Geometric Regular Polytopes McMullen. The major assignments are an individual writeup on a polytope of the students choice and a group presentation on an active area of polytope research.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Define the various notions of polytope that appear in mathematics and explain the pros and cons of eachUnderstand operations on polytopes and how they arise from other mathematical structures such as groupsBe able to recognize when polytopes may be applicable in future studiesLearn to use Miratope to manipulate and render polytopesBecome introduced to the Polytope Discord community",
                                                    "key_topics":  "This is a broad course that will study polytopes from many perspectives, including combinatorics, group theory, topology, and history. Methods of constructing polytopes will be given particular focus, so that students can recognize when the material might be applicable later.",
                                                    "prerequisite_knowledge":  "No prior knowledge beyond Concepts (15-151/21-128) is required, although linear algebra and group theory are helpful.",
                                                    "assessment_structure":  "Students will be assessed on the midterm individual writing assignment and the final group presentation.",
                                                    "relevance":  "Students who are pursuing math may encounter polytopes in their later studies, as they appear in multiple areas, such as higher category theory. Students who are not pursuing math should nonetheless be able to appreciate the beauty of 3- and higher-dimensional shapes.",
                                                    "learning_resources":  "The Polytope Wiki and Abstract Regular Polytopes are available online (the latter through CMU\u0027s libraries), Miratope may be downloaded from Github, and the Polytope Discord may be used for research.",
                                                    "extra_time_commitment":  "Working on the midterm and final are the largest extra time commitments, although students may be expected to set up resources like Miratope outside of class."
                                            }
}