{
        "code":  "98-052",
        "name":  "Student Taught Courses (StuCo): Occupation in Palestine \u0026 Sahara- Media Analysis",
        "short_name":  "STUCO: PAL SAH MEDIA",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This class is a deep dive into contemporary political narratives and propaganda and the media used to deliver and strengthen these narratives in public discourse. We will focus on IsraelPalestine and MoroccoWestern Sahara as key topics, and we will investigate how dominant actors shape media narratives in order to justify brutality. We will look at everything including newspaper headlines social media memes, government statements, political speeches, and announcements from Carnegie Mellon and the administration itself.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The course will develop students knowledge on the topics, show how narratives operate and are crafted in discourse, and show the role of media in amplifying violence and dehumanization. Students will understand these factors and be able to describe and explain them to others.",
                                                    "key_topics":  "The political occupations by/in the countries/regions of Israel/Palestine and Morocco/Western Sahara.",
                                                    "prerequisite_knowledge":  "Basic knowledge of the Israel\u0027s occupation of Palestine is recommended.",
                                                    "assessment_structure":  "We will have a midterm and a final exam; each of these will consist of the class analyzing a select work and discussing it together. Students will be graded on their participation and engagement.",
                                                    "relevance":  "Many students are interested in current events and what is happening around the world -- especially the injustices being committed with blatant American involvement and support. It is a subject that is in fact relevant to every American citizen, since it is our government which supports and even carries out such things.",
                                                    "learning_resources":  "There will be a canvas page with class resources, including journal articles, human rights reports, and opinion pieces.",
                                                    "extra_time_commitment":  "Weekly readings assigned by the instructor to strengthen students\u0027 understanding. These are mostly just a single article that touches on the same ideas we discuss in class but from another angle."
                                            }
}