{
        "code":  "98-072",
        "name":  "Student Taught Courses (StuCo): Introduction to Singlish",
        "short_name":  "STUCO: INTR SINGLISH",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "If you have spent enough time on CMUs campus, chances are, youd have had a possibly fleeting encounter with speakers using a variant of English you couldnt quite put your finger on. Whether its that teaching assistant employing a rather unique use of can as a standalone reply or someone presenting with quasiBritish pronunciations minus the slang. You might, as any reasonable individual would, wonder and even hazard a guess as to where they might hail from. And if you were to guess Singapore or one of its neighboring countries based on the above, youd likely be right. So, how can one start slinging colloquial Singapore English Singlish particles without making a Singaporean cringe What is the history behind this linguistic phenomenon  wait before that, is it a dialect, idiolect, pidgin, or creole Or something else Do Singaporeans really sound like how they are portrayed in Crazy Rich Asians Short answer to that last one NO If you find yourself asking these questions, or would like any or all of them answered, this course is the Singlish primer you are looking for. In this course, students are introduced to Singlish, the colloquial form of English spoken in Singapore not to be confused with Standard Singapore English. Students will be exposed to some concepts in linguistic analysis for the purpose of crossreferencing with English and other languages from which Singlish derives loanwords. Students will also learn a brief history of Singlish and better understand the cultural milieu it emerged from. Emphasis will be placed on attaining a level of Singlish proficiency that allows for meaningful and practical conversations. All in, students will gain a deeper understanding of the vocabulary, grammar, and cultural significance of Singlish in Singaporean society.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will be exposed to some concepts in linguistic analysis for the purpose of crossreferencing with English and other Englishderived creoles. Students will also learn a brief history of Singlish and better understand the cultural milieu it emerged from. They will also attain a level of Singlish proficiency that allows for meaningful and practical conversations.",
                                                    "key_topics":  "Singapore colloquial English, Singapore history, Singapore culture, Linguistics",
                                                    "prerequisite_knowledge":  "Basic English proficiency",
                                                    "assessment_structure":  "Attendance/participation - 50%\nHomework - 20%\nMidterm (Oral Presentation) - 10%\nFinal presentation - 20%",
                                                    "relevance":  "It is multi-disciplinary and spans linguistics, history, and appreciation for another culture.",
                                                    "learning_resources":  "An Essential Guide to Singlish by Miel Prudencio Ma (PDF Book)\nIn Defense of Singlish: A Cultural Interpretation of Singapore English by Wesley Lee (PDF Journal)\nhttps://www.sg101.gov.sg/social-national-identity/case-studies/singlish/",
                                                    "extra_time_commitment":  "Students will be assigned readings and optional practice for the Midterm Oral Examination. They will also be assigned a Final Presentation Project (to be done in groups)."
                                            }
}