{
        "code":  "98-022",
        "name":  "Student Taught Courses (StuCo): Dorm-Room Dishes \u0026 Easy Recipes",
        "short_name":  "STUCO: DORM MEALS",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Tired of scrolling through reels of delicious food on Instagram while your empty fridge glares you down Join our StuCo, DormRoom Dishes and Easy Recipes, and invigorate your passion for cooking Through our weekly sessions, we hope to show you that cooking can be a fun, simple, sociable, and healthy hobby that you can carry with you into the future. Never even used a pan before No worries, well teach you everything from scratch, as there are no prerequisites Already mastered the art of sauting, grilling, slicing, and dicing Come show us what youve got   Please note that there is a 2030 course fee that can be paid after the drop deadline.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Gain appreciation for cooking and how simple and fun it can be Encourage students to move into the kitchen more, even if theyre still in school Foster a community of students that enjoy food and cooking Set students up for success in the future when they graduate and have to possibly cook for themselves or their families Encourage collaboration in the kitchen and demonstrate how cooking can be an enjoyable hobby to share Have fun",
                                                    "key_topics":  "Cooking, meal-prepping, food, recipes",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Participation (the largest component of your grade! = 60%): Students are expected to attend each class for an introductory lecture and cooking exercise, and will be graded on their effort/enthusiasm (not the quality of their final dish). Students are allowed 2 absences per semester (excluding the final exam). Each class is worth about 4% of their final grade. Students will also be allowed to make-up a maximum of 2 absences if they would like by making a recipe from a cookbook of their choice asynchronously and sharing their reflections with the class.\n\nRecipe Book (20%): Each class, we will preface what we\u0027ll be making and provide students a note-taking template (like a recipe card). Students should fill out this card every lecture and turn it in before the next class. This will culminate in students having their own mini cookbooks by the end of the semester!\n\nMidterm (10%): Students will either (1) cook a recipe with someone and submit a reflection on the experience of working with someone in the kitchen or (2) find a book about food science and write a report about what they learned. We (as a class) may decide to share these as a presentation day!\n\nFinal (10%): Students will be given a list of ingredients one week in advance and challenged to design a dish (inspired by the cooking show, Chopped). They must attend class to create their dish (makeups will only be granted on a case-by-case basis).",
                                                    "relevance":  "Very relevant! We\u0027re hoping to teach students life-long skills since cooking is a healthy, fun hobby. Nourishment, nutrition, and health are important for students, and we hope to assist them with topics like this.",
                                                    "learning_resources":  "There are several cookbooks available via libraries for fun reading! Most of our content will be sourced from the internet and all of the content should be accessible to students easily. We will provide any slides presentations as necessary.",
                                                    "extra_time_commitment":  "Recipe Book (20% of students\u0027 grades): Each class, we will preface what we\u0027ll be making and provide students a note-taking template (like a recipe card). Students should fill out this card every lecture and turn it in before the next class (if they do not finish in-class). This will culminate in students having their own mini cookbooks by the end of the semester!\n\nMidterm (10%): Students will either (1) cook a recipe with someone and submit a reflection on the experience of working with someone in the kitchen or (2) find a book about food science and write a report about what they learned. We (as a class) may decide to share these as a presentation day! This assignment is asynchronous."
                                            }
}