{
        "code":  "98-008",
        "name":  "Student Taught Courses (StuCo): Intro to Rust Lang",
        "short_name":  "STUCO: RUSTLANG",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is an introduction to the Rust programming language, a memorysafe systems programming language. We will cover a range of topics, from the Rust borrow checker to parallelism and the unsafe keyword. Outside of class, there will be basic programming exercises, and during the second half of the semester there will be a small studentdefined project. This course is taught in Rust, and you are not expected to have any prior exposure to Rust. However, this course assumes knowledge of topics covered by 15122. Knowledge of functional programming idioms taught in 15150, as well as knowledge of systems programming taught in 15213 is a bonus, but not strictly required.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students in this course will be able to read, write, and reason about Rust code which includes Core Rust syntax such as struct, enum, impl blocks, pattern matching, polymorphism, and traits Common Rust types Use of the borrow checker through ownership and move semantics Advanced Rust features such as iterators, lifetimes, closures, and smart pointers and Advanced Rust patterns such as parallelism, concurrency, macros, and unsafe.",
                                                    "key_topics":  "Week 1: Introduction\nWeek 2: Ownership\nWeek 3: Structs \u0026 Enums\nWeek 4: Standard Collections and Generics\nWeek 5: Error handling and Traits\nWeek 6: Cargo, Modules, Traits, and Testing\nWeek 7: Lifetimes\nWeek 8: Iterators, Closures, and Advanced Functional Topics\nWeek 9: Smart Pointers and Trait Objects\nWeek 10: Parallelism\nWeek 11: Concurrency\nWeek 12: Macros\nWeek 13: Unsafe",
                                                    "prerequisite_knowledge":  "15-122",
                                                    "assessment_structure":  "50% Participation and 50% Programming Assignments.",
                                                    "relevance":  "Rust is a new programming language gaining a lot of usage in the industry, backed by a great deal of excitement around campus and the programming community. Interest in learning Rust and participating in new career opportunities is very high, and this course will be very beneficial to students.",
                                                    "learning_resources":  "Course website, Lecture slides, and other open-source Rust learning material",
                                                    "extra_time_commitment":  "Programming homework assignments"
                                            }
}