{
        "code":  "98-018",
        "name":  "Student Taught Courses (StuCo): Learn Something New Every Week",
        "short_name":  "STUCO: LEARNING NEW",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Have you ever wanted to make a StuCo but did not have a semesters worth of content to teachIn this class, every student will get the fantastic opportunity to teach a subject while learning many more. Every week, 13 students will give lectures on a topic of their choosing. The best topics are ones where nobody in the class knows anything beforehand but everybody in the room is a world expert afterward. Through this experience, one will be able to learn about topics they might have never run into before. Dually, students will hone their teaching skills and ability to engage a classroom with a mystery topic. Throughout the class, we will have lectures focused on teaching, education, and presentation styles plus improvstyle games for the interested where students will practice teaching material in a more unprepared setting, suitable to the education of the real world.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course, students will hopefully get the chance to teach something very cool to an audience. In this journey, they will get the chance to refine their idea in a way that other students can interpret. Moreover, students will be better at designing presentations in an array of realworld circumstances.",
                                                    "key_topics":  "Designing engaging lectures, presenting clearly and effectively.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Students will present once to the class on a topic of their choice. They can also participate in entertaining teaching games.",
                                                    "relevance":  "This course is relevant to anybody interested in teaching and presenting.",
                                                    "learning_resources":  "The instructor is available for help in and out of the classroom.",
                                                    "extra_time_commitment":  null
                                            }
}