{
        "code":  "98-020",
        "name":  "Student Taught Courses (StuCo): Deconstructing the Barbie Cinematic Universe",
        "short_name":  "STUCO: BARBIE",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The Barbie animated movie franchise has shaped a generation who grew up with retellings of classic fairytales and inspirations of female empowerment. Dubbed by fans as the Barbie Cinematic Universe BCU, the animated movie franchise began in 2001 and now has over 40 films and various web series. The BCU has recently resurfaced in popularity with the resurgence of early 2000s nostalgia and Greta Gerwigs 2023billiondollar box office hit, Barbie. Throughout this course, we will dive into the history of Barbie, dissect the evolution of BCU films, and shed light on problematic themes and elements throughout the franchise. Specific topics to discuss include, but are not limited to queer allegories, antisemitism, and the Barbie Cinematic Universe theory. This course will be highly discussion based, so it is important that all students are engaged and actively participating in classroom conversations. No prerequisite knowledge is required, only enthusiasm and excitement for Barbie",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of this course, students will be able to analyze complex theming, recognize problematic stereotypes, and engage in productive conversations about media.",
                                                    "key_topics":  "Creation of the \"Barbie\" doll, American Feminism, Classical Music and Ballet, Classic Fairy Tales, LGBTQ+ stories, Racism and Anti-Semitism",
                                                    "prerequisite_knowledge":  "No prior knowledge is necessary, only enthusiasm and excitement for Barbie!",
                                                    "assessment_structure":  "In class discussion participation, attendance, midterm short responses, final project presentation or paper.",
                                                    "relevance":  "Barbie has had a recent surge in popularity with the release of Gerwig\u0027s \"Barbie\" (2023) -- this course is designed for students who would like to relive the nostalgia of animated Barbie movies and deep dive into the culture, complex theming, and messaging that may have been missed before.",
                                                    "learning_resources":  "Selected Barbie movies will be viewed in class and additional resources, such as articles and YouTube videos, will be uploaded to Canvas when relevant.",
                                                    "extra_time_commitment":  "There will be minimal time commitments outside of class because there are no regular homework assignments. The only extra time commitments will be completing the midterm response questions and the final presentation or paper."
                                            }
}