{
        "code":  "98-172",
        "name":  "Student Taught Courses(StuCo): Introduction to Command-line Tools",
        "short_name":  "STUCO: COMMAND LINE",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Many courses at CMU teach theory and have assignments based around coding, however, not many courses specifically teach about the auxiliary tools used by developers. This course will introduce and teach how to use those tools, drastically speeding up the development process. This course will teach the basics of git, how it works under the hood, and advanced usages, such as restoring commit data that you thought was gone forever. Introduction to chaining commands together, how to set up a personalized developer experience in the terminal, general text and data processing using tools like grep andor awk, complemented with RegEx and many other invaluable commandline tools. It will also introduce and encourage proficiency with tools such as vim or at least vim motions, tmux, reverse searching command history, andor other navigation tricks.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "A student should be able to fluently navigate git, use tmux to manage ongoing tasks, process through a large number of files and large amounts of text.",
                                                    "key_topics":  "git, vim, docs, dotfiles, tmux, regex, grep, awk, network requests, parallel, nohup, bash scripting, environment variables",
                                                    "prerequisite_knowledge":  "A student should at least be slightly familiar with a Linux terminal and how to navigate it.",
                                                    "assessment_structure":  "There will be homework about most class lectures, a cumulative midterm and final task, as well as in class activities.",
                                                    "relevance":  "This course is designed to allow students to significantly increase use of important command-line tools, which become more beneficial and necessary during later college classes, internships, personal work, and future employment opportunities.",
                                                    "learning_resources":  "Students will have online resources, such as tutorials, explanation videos, lectures notes hosted on the course website, and instructor office hours by request.",
                                                    "extra_time_commitment":  "There will be homework tied to most lectures, as well as a midterm and final exam/task, which will be taken outside of class time."
                                            }
}