{
        "code":  "98-122",
        "name":  "Student Taught Course (StuCo): Blackjack Techniques",
        "short_name":  "STUCO:BLACKJACK",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Blackjack is one of the most popular and profitable table games so far, contributing around a quarter of a typical casinos revenue. Unlike other casino games, such as Roulette, which are purely luckbased and are a net loss for the player, Blackjack can be beaten with card counting. This is because, unlike in Roulette, each card draw in Blackjack is not an independent event. Later card draws can be predicted with results from earlier draws in the same game, which makes some room for maneuvering of probabilities to the players advantage. This course is for people who are interested in learning more about the rules  tricks of Blackjack and learning how to beat it. NO EXPERIENCE REQUIRED. We will learn the rules of the game, memorize the basic mathematical strategy, and master the card counting skills necessary to beat the game. Each week, after some theory, we will do training drills to help everyone get better at muscle skills. It just takes practice.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Proficiency inBlackjack rulesBasic strategyHiLo counting",
                                                    "key_topics":  "-\tWeek 1: What is blackjack\n-\tWeek 2: Myths and fun facts\n-\tWeek 3: Basic Strategy\n-\tWeek 4: Other casino games\n-\tWeek 5: Blackjack variants\n-\tWeek 6: Betting systems\n-\tWeek 7: Midterm exam\n-\tWeek 8: Fall break, no classes\n-\tWeek 9: Hi-Lo counting\n-\tWeek 10: Team playing\n-\tWeek 11: Bankroll management\n-\tWeek 12: What happens in a casino\n-\tWeek 13: Thanksgiving break, no classes\n-\tWeek 14: Alternative techniques\n-\tWeek 15: Final exam\n\"",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "There will be a midterm and a final.",
                                                    "relevance":  "This course is for people who are interested in learning more about the rules \u0026 tricks of Blackjack and learning how to beat it.",
                                                    "learning_resources":  "There will be recommended texts and YouTube videos.",
                                                    "extra_time_commitment":  "There will be recommended readings and blackjack practice."
                                            }
}