{
        "code":  "98-187",
        "name":  "Student Taught Courses (StuCo): Call of Duty: Zombies WAW-BO3",
        "short_name":  "STUCO: COD ZOMB WAW",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Call of Duty Zombies is a spinoff game of the Call of Duty series licensed by Activision based on the widely popular Nazi Zombies mode of Call of Duty World at War released back in 2008 and developed by Treyarch. Originally, the game mode was just an experimental test featuring roundbased survival gameplay. Due to its first success, other maps were created for the game, and years later the zombies mode was featured in subsequent sequels, Call of Duty Black Ops 1, 2, 3, 4, Advanced Warfare, Infinite Warfare, WWII, and the most recent release this past year, Call of Duty Black Ops Cold War.  This course will feature gameplay, controls, perks, characters, maps, weapons, story, trivia, and much more A quick note that due to the increasing amount of content over the years, in addition to the spinoff zombies mode developed by SledgeHammer Games and Infinity Ward and due to their low reception, this course will only be able to study and focus on Call of Duty World at War and Black Ops 1, 2, and 3 due to the limited timeframe of the semester schedule.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Learn to play Call of Duty Zombies and understand the game mechanics and how the controls operate.Shown the history behind the games conception, and the behind the scenes conflicts and successes associated with the developers.Learn some of the innovations that made this game stand out from other games in the genre and how it has left a lasting impact on the entertainment industry streaming, competitive gaming, voice actors, popculture, speedrunning, etc.Understand the characters, their motivation, backstory, purpose, and relationships with one another. Learn the intricate and detailed storyline as well as some of the references to historical events.Be able to identify the maps that belong to each respective game, what they did innovatively, their theme, etc.Be able to identify the weapons, perks, buildables, and traps in each map.",
                                                    "key_topics":  "Learn to play Call of Duty: Zombies and understand the game mechanics and history behind the franchise.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "The final course grade will be calculated using the following categories:\nAttendance: 40%\nMidterm: 20%\nFinal: 20%\nHomework: 20%\n\nStudents will be assigned the following final grades, based on calculations coming from the course assessment section.\nP: 60-100%\nR (F): 0-59%",
                                                    "relevance":  "This course is designed for anyone interested in Call of Duty: Zombies and is a fun getaway from the stressful life at CMU.",
                                                    "learning_resources":  "Wikipedia\nCanvas\nYoutube\nGame (if owned)",
                                                    "extra_time_commitment":  "Students will be given a weekly google forms poll covering/reviewing the concepts discussed from last week\u0027s class. Additionally, students will be offered canvas resources for the purpose of helping them with their homework in case they do not remember much from last class.\n\nWeekly homework which will take approximately 2 hours per week. Completion of which is essential to this course."
                                            }
}