{
        "code":  "98-156",
        "name":  "Student Taught Course: Contemporary and Marginalized Poetics Workshop",
        "short_name":  "STUCO: CONTEMPTRY",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The world of contemporary poetry is a vast and scintillating space. Where many collegiate poetry courses focus on historical poetics, this course aims to introduce students to the newest, most exciting poetry that shapes our current cultural landscapes.   The democratic, accessible nature of short written work makes it a universal vehicle for expressing a broad spectrum of experiences and touching on myriad identities. The course will have a particular focus on marginalized poets, as well as intersectionality, by drawing on works from a diversity of ethnicities, classes, sexualities, genders, nationalities, and so on. Thus, students will learn how to engage with the creative work of many and varied people and pay respect to their stories, a vital skill in all walks of life.   Through weekly readings 34 poems, articles, podcasts, or videos per week, students will gain increased fluency in interpretation of contemporary poetry. They will learn to analyze works and then incorporate observed techniques into their own poems. They will write a poem each week, ultimately developing a cohesive body of creative work.   As this is a discussionbased course, participation is central and mandatory. No formal prerequisites or prior knowledge necessary all that is needed is a desire to learn about emerging poets and techniques, as well as an eagerness to develop and improve upon ones poetry practice.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Identify then describe several cultural movements and the implications in contemporary poetry. Write poetry that utilizes poetic devices and techniques. Revise work based on critical feedback. Create comparisons across poems. Develop familiarity with publishing avenues and options.",
                                                    "key_topics":  "The course will cover pivotal topics in contemporary poetry: ars poetica, slam poetry, gender and feminism, queer love stories, comparative writing, immigration and refugee poetry, diaspora poetics, Asian American poetics, softness and vulnerability, publication logistics, and workshopping.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Students will be assessed through a combination of homework: preparedness by completed required readings/viewings and weekly poem submissions, class discussion, a midterm essay, and a final portfolio.",
                                                    "relevance":  "This course tackles poetry at the margins and at its most pioneering, featuring work by practicing and acclaimed writers/performers. Undergraduate students with an interest in reading and writing poetry will have a flexible and welcoming space to explore their craft and broaden their horizons.",
                                                    "learning_resources":  "Students will have unlimited free access to all course materials, including instructive essays, poems, and videos. Instructors are also available to set up one-on-one help sessions.",
                                                    "extra_time_commitment":  "Students will typically be assigned 2-3 hours of extra work, including poems, essays, videos, and/or podcasts to read, watch, or listen to before class. Must write poems for the ability to workshop them in the next class."
                                            }
}