{
        "code":  "98-158",
        "name":  "Student Taught Courses (StuCo): Big Diseases, Bigger Treatments",
        "short_name":  "STUCO: BIG DISEASES",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Heart disease, cancer, stroke, diabetes, and other major diseases are the leading causes of death in the United Statestheres a 50 chance youll die from one of these diseases. But most people dont know how these diseases arise and what they can do about them. More importantly, few people know how current treatment options work, and how exciting new treatment options under development may fundamentally change the way we address these severe diseases.This course is taught in a chooseyourownadventure format lectures have a defined start point but most of the content depends on what questions are asked and by majority vote. Well learn about these diseases and the exciting new treatment modalities that promise to serve as powerful weapons in the fight against them. Along the way, well learn about drug development, the big pharmaceutical companies, clinical trials, a little machine learning, the FDA, and whats holding us back from designing better treatments.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "After taking this course, students will be able to Explain to a general audience the mechanisms and pathophysiology of major diseases, including heart disease, cancer, stroke, Alzheimers, diabetes, etc. Explain to a general audience the basic principles underlying common treatment methods, such as drugs, proteins, CART cell therapy, etc. Be able to critically read about and understand advances in designing new therapeutics for the major diseases.",
                                                    "key_topics":  "Heart disease and stroke, cancer, dementia, Alzheimer\u0027s, diabetes, chronic kidney and liver diseases, small-molecule drugs, proteins, peptides, antibodies, gene therapy, cell therapy, radiotherapy, new therapeutic modalities, synthetic biology, big pharma, biomedical research, FDA and regulatory, NIH/NSF, drug discovery startups, the drug development process, CAR-T cell therapy, clinical trials, CRISPR, the healthcare industry",
                                                    "prerequisite_knowledge":  "No prerequisite knowledge is required; this course is meant for a general audience.",
                                                    "assessment_structure":  "Students will be assessed by participation, optional homework assignments, and a short midterm and final project.",
                                                    "relevance":  "This course is relevant to students by providing a glance of the common diseases and treatments in the United States and many other countries. It also introduces exciting new treatment modalities that may greatly help in our fight against these diseases. The course also discusses the healthcare industry, which is directly relevant to students.",
                                                    "learning_resources":  "There are no required textbooks or other resources for this StuCo, but any helpful reading or watching materials will be posted to the course Canvas page.",
                                                    "extra_time_commitment":  "There will be a short midterm and final project, as well as optional homework assignments throughout the semester."
                                            }
}