{
        "code":  "98-186",
        "name":  "Student Taught Courses (StuCo): Roller Coasters: Background and Design",
        "short_name":  "STUCO: RLR CS HS DES",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Students will learn the fundamentals of how roller coasters are designed, roller coaster and manufacturer identification, basic physics used in roller coaster design, as well as the history of roller coasters. Lecture slides will go over the history of different roller coaster innovations and design philosophies, as well as real world examples and applications. During the course, students will take a class trip to Kennywood 25 fee to gain further insight into theme park management and roller coaster maintenance.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Learning the principles necessary to become a successful internlevel worker in the amusement industry, and gain a deeper understanding of how roller coasters work.",
                                                    "key_topics":  "History of roller coasters, roller coaster design considerations, and roller coaster operations.",
                                                    "prerequisite_knowledge":  "Basic kinematics and familiarity with free body diagrams can be useful, but not required.",
                                                    "assessment_structure":  "1 at-home assignment, 1 in-class midterm, and 1 in-class group project.",
                                                    "relevance":  "Many students seek jobs in the amusement industry without a solid foundation of the history or design principles behind it. This class aims to provide those things, especially to future amusement industry workers. This class also aims to introduce members of the general public to the intricacies of roller coasters in order to gain a deeper appreciation and understanding of them.",
                                                    "learning_resources":  "Course website, links to informational sites, case studies in class, presentations and videos on roller coaster history and design.",
                                                    "extra_time_commitment":  "One homework assignment. One field trip to Kennywood during the semester on a weekend (tentative)."
                                            }
}