{
        "code":  "98-177",
        "name":  "Student Taught Courses (StuCo): Building Personal Websites",
        "short_name":  "STUCO: BPM",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In todays digital age, having a personal website makes it substantially easier to share information about yourself to employers and colleagues. In this course, students will learn the principles of web development in order to build their own personal website. Topics include basic HTML components, static elements, dynamically functioning elements, interactive graphics, loading content from text files, optimizing screen sizes  runtimes, and crossbrowser support. The course will be taught in HTML, CSS, and JavaScript JQuery. Students will be building their own website over the course of the semester, with the final project requiring students to submit a personal resume website that they can then keep when finishing the course. There is no cost associated with the course. Students must provide their own hardware.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will leave the course with a website of their own and experience to start up their own frontend website at any time.",
                                                    "key_topics":  "HTML components, static elements, dynamically functioning elements, interactive graphics, JSON parsing, optimizing screen sizes \u0026 run-times, cross-browser support.",
                                                    "prerequisite_knowledge":  "Students should have a basic understanding of programming languages (functions, variables, conditional statements, loops).",
                                                    "assessment_structure":  "Students will submit progress made on their website weekly, where students will be showcasing their finished websites by the end of the course.",
                                                    "relevance":  "Students will learn how to build their own personal websites that they can use to list resume content or portfolio work, all from scratch.",
                                                    "learning_resources":  "Material for the course (languages, scripts, text-editors, browsers) are all available online for free.",
                                                    "extra_time_commitment":  "Students are responsible for taking the time to further develop their website outside of class based on the content learned from the most previous lectures."
                                            }
}