{
        "code":  "98-195",
        "name":  "Student Taught Courses (StuCo): Introduction to Divination",
        "short_name":  "STUCO: DIVINATION",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "We will introduce basic ideas of IChing 15 of the class and focus on the application of prediction use Liu Yao specifically, about 35 of the class. To provide a better understanding of the practices across the globe. We also teach basic Tarot card meanings and reading strategies, both Visconti and Waite, along with its culture again 15 class time. People are encouraged to buy their own tarot cards, and IChing readings require 3 quarter coins. Buying physical book of IChing is recommended but not required.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "At the conclusion of the course students should be able to have a basic understanding of different tarot card meanings, and also be able to carry out a Liu Yao reading on their own.",
                                                    "key_topics":  "I-Ching culture and practice.\nTarot culture and spreads.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Midterm will be presentations of one\u0027s interpretation of their favorite I-Ching/Tarot idea. Final will be a contest of prediction through a guessing game. One is allowed to choose their own technique on predicting the correct answer.",
                                                    "relevance":  "The interest in predicting the future or at least to understand the basics of I-Ching and Tarot cultures.",
                                                    "learning_resources":  "Powerpoints will be provided. If student cannot afford/does not own tarot cards, cards can also be provided.",
                                                    "extra_time_commitment":  "Around 10 minutes each week, one should carry out a reading and explain the different parts in the spread that are specifically related to that week\u0027s content. Details will be provided on Canvas."
                                            }
}