{
        "code":  "98-163",
        "name":  "Student Taught Courses (StuCo): Introduction to Tetris",
        "short_name":  "STUCO: INTRO TETRIS",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course provides a comprehensive introduction to single player and multiplayer modern Tetris. Though the classic NES Tetris scene is arguably more well known, modern versions of Tetris are diverse and have healthy competitive scenes in their own right. Students will learn basic concepts applicable to both styles of Tetris like stacking, down stacking, and piece preview usage, as well as aspects unique to modern Tetris like Tspins, combo setups and online multiplayer. [No fees required",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will be able play both single and multiplayer Tetris. They will learn many practical skills, from the fundamentals of stacking to more advanced theories for multiplayer. Students will also be able to meet friends and play with each other",
                                                    "key_topics":  "Basic Tetris skills\na) stacking: piece placement and decision making, and minimizing \"piece dependency\"\nb) downstacking: clearing a \"messy\" board and decreasing the height of your stack\nc) piece preview usage: placing your pieces with your next piece in mind\n\nModern Tetris strategies\na) T-spins: Seeing, setting up, and performing T-spins\nb) Combo setups: building and performing combo setups\nc) Online multiplayer: decision making strategies, up stack vs down stack judgement, T-spin and combo setup judgement",
                                                    "prerequisite_knowledge":  "No prerequisite knowledge required!",
                                                    "assessment_structure":  "Participation: This is the most important part of the StuCo (You can\u0027t play with others and apply what you\u0027re learning if you don\u0027t show up!)\n\nAssignments: Students will be assigned tasks that relate to the material covered each week. For example, if the material was on stacking, then students might be asked to play one round of 40-line sprint.\n\nMidterm \"\"Exam\"\": Coaching session: Students will submit replays of single or multi-player games they\u0027ve played, and other students will provide feedback and points of improvement based on what they\u0027ve learned and any mistakes they see.\n\nFinal \"\"Exam\"\": Students will play double-elimination 1v1 tetr.io tournament. This allows students to have fun while applying the concepts they\u0027ve learned. This will be graded on participation/completion.",
                                                    "relevance":  "It\u0027s a very recognizable game that has a lot more to it than just stacking blocks for tetrises. Students will be able to pick up a new hobby that involves both your traditional gaming skills (speed, stamina, precision) and your brain while also hopefully making friends along the way.",
                                                    "learning_resources":  "We will provide lots of websites that are used for practicing Tetris stacking, recognizing patterns and opening setups, and more.",
                                                    "extra_time_commitment":  "Students will complete homework assignments, which should take under an hour."
                                            }
}