{
        "code":  "98-148",
        "name":  "Student Taught Courses (StuCo): Introduction to Student Journalism",
        "short_name":  "STUCO: STUJO",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is for anyone interested in student journalism. The course will start out with the basics of newswriting and move into the different types of articles. We will start with headlines, ledes, and story structure. We will then talk about the different types of articles news, opinion, technical, sports, and arts. From there, we will cover what makes a newspaper, a newspaper This includes learning interviewing, photography, and layout skills. At the end of the semester, we will have a workshop that will teach students the basics of satire writing as well.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "After completing this course, student should be wellversed in the various types of newswriting and know what it means to be a student journalist. Students should be comfortable identifying types of newswriting and know when errors are present and how to correct them.",
                                                    "key_topics":  "\"This course will cover the basics of what you need to know to be an effective student journalist. This includes the various types of writing for newspaper, photography, layout, interviewing, and copy editing. By the end of the course, students will have learned the following:\n- What elements are there to a news story and how to write one\n- How to structure an opinion piece to effectively get your opinion across\n- How to write a technical piece without alienating your reader\n- What should be included in a sports story and how to avoid repetition\n- What is AP style and how is it different from other style\n- What makes a layout \"\"good\"\"\n- How to use a camera and what makes a photo \"\"good\"\"\"",
                                                    "prerequisite_knowledge":  "Students will need to have no prior knowledge to be successful in this course.",
                                                    "assessment_structure":  "There are four assignments throughout the course that will assess how students are doing with the content of the course.",
                                                    "relevance":  "News also constantly happening around us, and for students who are interested in journalism, it\u0027s important to know how to produce your own content. As Carnegie Mellon doesn\u0027t have its own journalism program, students have to learn on their own how to become journalists.",
                                                    "learning_resources":  "All of the presentations and The Tartan internal guides will be available to students.",
                                                    "extra_time_commitment":  "Students will need to complete their articles and other homework outside of class. This shouldn\u0027t take more than an hour per assignment."
                                            }
}