{
        "code":  "98-157",
        "name":  "Student Taught Courses (STUCO): Music: Deep-diving Artists and Genres",
        "short_name":  "STUCO: MUSIC",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Shoegaze Post Rock Experimental Hip Hop Art Pop If you already love or want to learn more about these genres plus more, then this is the course for you Students will focus on selected artists who are creative pioneers of their respective genres, as well as covering highlighted styles of music catered to the overall cohort of the class Each week will comprise a deep dive and discussion on a specific genre or artist delving into musical history, discographies, and how they continue to influence aspects of our society. Students will develop their music knowledge and be able to recognize the importance of certain genres and artists in music culture. Students will also learn how to be more openminded and critical with their approach to music listening  how to appreciate listening to new genres that one may or may not be familiar with. Through inclass activities and discussions, this class embraces the study of music genres and artists to broader social references, illustrating how music reflects and influences cultural dynamics.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "This course will equip students with comprehensive knowledge of various contemporary music genres while improving their ability to analyze and appreciate music across a variety of genres, focusing on understanding the elements that define and distinguish these genres. Students will also learn how to listen to music more effectively, encouraging openmindedness while interpreting the nuances and complexities that characterize different musical styles.",
                                                    "key_topics":  "Spotlighted genres of contemporary music, how specific artists have influenced future generations of musicians, current events in the music industry, and more!",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Homework, participation, and midterm/final projects. Students are expected to get involved in discussions and show effort in participating.",
                                                    "relevance":  "Students will get the opportunity to develop their music knowledge and overall music-listening skills! Contemporary music is constantly evolving, so being able to understand the history of previous and existing musical landscapes is of relevance to anyone interested in learning more about overall music culture.",
                                                    "learning_resources":  "Lecture slides, songs, albums, playlists, and supplemental material.",
                                                    "extra_time_commitment":  "Occasional listening activities."
                                            }
}