{
        "code":  "98-128",
        "name":  "Student Taught Courses (StuCo): Fundamentals of Improv Comedy",
        "short_name":  "STUCO: IMPROV COMEDY",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Through improv games and structured activities, students will learn the basic tenets of improvisational theater with a focus on both short and long form styles. These tenets will include the basic rules of improv, building base reality, listening, top of intelligence, finding and continuing game, and how to use support moves. No prior experience is necessary. Students will be expected to participate in group activities, discussions, and performances during class time. They may also be asked to watch performances or attend workshops outside of class. Students will have the opportunity to participate in an endofsemester showcase with a live audience.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Improvisation, comedy, public speaking, communication, teamwork",
                                                    "key_topics":  "Basic rules of improv; characters and relationships; location, space work, and miming; top of intelligence; introduction to game; long-form improv; Armando form.",
                                                    "prerequisite_knowledge":  "No prior experience is necessary to be successful in this course! Just a willingness to try :)",
                                                    "assessment_structure":  "Students will be assessed by a mix of discussion on improv topics from assigned readings and videos, as well as in person participation in games and exercises. Midterm assessment, students are expected to perform in a scene with a scene partner. Final assessment, students are expected to perform an Armando with several other classmates.",
                                                    "relevance":  "Students who have a desire to improve public speaking, acting, or comedic skills, will find their knowledge and ability in these areas increased over the semester.",
                                                    "learning_resources":  "Additional materials such as recommended readings, podcasts, and videos for students to practice improv independently will be provided.",
                                                    "extra_time_commitment":  "Various assigned readings and videos on improv that are relevant to the upcoming week\u0027s topic."
                                            }
}