{
        "code":  "98-106",
        "name":  "Student Taught Courses (StuCo): Intuitive Quantum Computing",
        "short_name":  "STUCO: INTUIT QCOMP",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course covers the basic foundations of quantum computing through the use of visuals and examples. The goal is to build an intuitive understanding rather than depending on complex math that is often used for even the most basic quantum concepts. This course is ideal for those with a computer science background who are curious to learn about quantum computing fundamentals. No prior quantum computing experience is expected. A basic familiarity with linear algebra is helpful but not required.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "cmu.edu/stuco",
        "custom_fields":  {
                                                    "goals":  "After taking this course, students should be able to comfortably discuss quantum computing topics, understand news about advancements in the field of quantum computing, as well as identify low quality generalizations about quantum computing. This course should leave a student with a strong conceptual baseline if they choose to take mathematically rigorous quantum courses in the future.",
                                                    "key_topics":  "Students will learn the basics of quantum computing, as well as some very simple quantum communication and quantum information theory.",
                                                    "prerequisite_knowledge":  "15-151 or 21-127 or 21-128",
                                                    "assessment_structure":  "40% Attendance\n20% Required Readings\n20% Midterm Project\n20% Final Presentation",
                                                    "relevance":  "This course is designed for any student who is curious about quantum computing and wants a soft, visual introduction to the subject. To get the most out of the course, the student should have familiarity with computer science topics, since this course will be looking at quantum computing through the lens of computer science.",
                                                    "learning_resources":  "Slides presented in each class will be available for students.\nIf possible, each class will be recorded via zoom or similar and be available as well.\nA Piazza forum will be available for students to ask each other and instructor questions.\nWeekly readings will be posted with some optional additional material from the following sources: Quantum Computing Since Democritus (by Scott Aaronson), Quantum in Pictures (by Bob Coecke \u0026 Stefano Gogioso), Shtetl-Optimized (Scott Aaronson\u0027s Blog), Algorithmic Assertions Blog (Craig Gidney\u0027s blog).",
                                                    "extra_time_commitment":  "Each week there will be an assigned short reading that is illustrative of the upcoming lecture.\nThis reading should take no more than 1 hour per week.\nStudents are expected to participate on the Piazza and answer each others\u0027 questions, which should take less than 1 hour per week.\nThe midterm project and final presentation are each expected to take roughly 8 hours of work."
                                            }
}