{
        "code":  "98-108",
        "name":  "Student Taught Courses (StuCo): Settlers of Catan",
        "short_name":  "STUCO: CATAN",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Settlers of Catan is a dynamic game in which the conditions change with every game and require different strategies. 3 to 4 players compete to score 10 victory points using 5 different resources. This course invites newcomers, occasional enjoyers, and fanatics to play Catan. Over the course of the semester, we will explore tactics to expand your territory given any landscape and navigate the nuances of trading and the robber... Students will gain a deeper understanding and hopefully appreciation for Catan. No previous experience with Catan is required for this course. Every week, a new topic will be introduced to evolve your gameplay followed by a game with classmates in order to implement the concepts taught. Most importantly, this game is a way to foster a community of inclusion, competitiveness, and enjoyment. The instructors hope that through this course, students of diverse backgrounds can meet and form bonds over Catan. There will be a 10 course fee.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "cmu.edu/stuco",
        "custom_fields":  {
                                                    "goals":  "By completing the course, students will have a much better understanding of catan and develop essential optimization strategies that can applied in other games and life.",
                                                    "key_topics":  "Introduction to Catan, Decision Making, The State of the Game, Basic Strategies, Statistics and Probability, Resource Value, Trading, Building, Settling.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Attendance, Game Performance (Exam), Homework.",
                                                    "relevance":  "This course is relevant to any student looking for a creative and fun way to improve their critical thinking skills.",
                                                    "learning_resources":  "CATAN STRATEGY: A Complete Guide to Winning the Popular Board Game by Mark Oxer, DyLighted Strategy Videos, Spathy Game Tutorials",
                                                    "extra_time_commitment":  "Major homework assignments will be completing readings on Catan Strategy (class textbook) and watching catan strategy videos online."
                                            }
}