{
        "code":  "98-127",
        "name":  "Student Taught Courses (StuCo): Developing Your First Game In Unity",
        "short_name":  "STUCO: GAME DEVELOP",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course serves as an introduction to game development using the Unity game engine. Students will explore the fundamentals of both 2D and 3D game development, gaining handson experience in creating interactive and engaging gaming experiences. Through a combination of theoretical lectures and practical exercises, participants will acquire essential skills in Unity, programming with C, and game design principles.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "This course is designed for beginners and aspiring game developers who want to enter the exciting world of game development. Whether youre a student pursuing a career in game development or an enthusiast looking to turn your creative ideas into interactive experiences, this course provides a solid foundation for your journey in game development.",
                                                    "key_topics":  "Unity Scripting, physics systems, animations, UI",
                                                    "prerequisite_knowledge":  "15-110 or 15-112 or similar programming experience in any language. Familiarity with object-oriented programming is preferred but not required.",
                                                    "assessment_structure":  "Students will be assessed on 4 assignments (50%), participation (30%), and a final game project as the culmination of the course (20%).\nAssignments:\n-Player controller with animations (15%)\n-Interactable Objects (15%)\n-Creating your own shader (10%)\n-Game design document (10%)",
                                                    "relevance":  "Video games have become an integral part of modern culture. They often reflect societal trends, values, and interests, contributing to cultural conversations. Game development also pushes the boundaries of technology. Innovations in graphics, artificial intelligence, virtual reality, and other fields often emerge from the gaming industry. In this course, students will have hands-on experience on what game development is like.",
                                                    "learning_resources":  "Canvas, YouTube tutorials, Unity API documentation",
                                                    "extra_time_commitment":  "Students should spend about 3-5 hours outside of class time on each assignment (4 in total), and about 10-15 hours on the final project!"
                                            }
}