{
        "code":  "98-134",
        "name":  "Student Taught Courses (StuCo): Introduction to Genshin Impact",
        "short_name":  "STUCO: INTRO GENSHIN",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Students will learn the basics of the PCmobile game Genshin Impact, including gameplay, mechanics, general skills, and strategies that will help them problemsolve and think outside the box. In addition, students will have ample class time to play the game and receive advice from instructors. Furthermore, Genshin Impacts storyline has many deep and thoughtprovoking themes, and students will discuss such themes during class, prompting them to relate these to realworld events or philosophies.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "After completing the course, we hope that students will have a new appreciation for the game. We also hope that they will understand that Genshin Impact is deeply rooted in human history and mythology, and we hope that students will be interested in this history. Furthermore, we wish to invert the stereotype that Genshin Impact is a mindless gacha game and show students that a lot of thought and effort was put into developing the game and must also be put into playing it.",
                                                    "key_topics":  "Basics of Genshin Impact (gameplay, mechanics, general skills),\nStory of Genshin Impact (including relation to real-world philosophies)",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Students will be assessed by the midterm and final assessment.",
                                                    "relevance":  "Genshin Impact is a popular mobile/PC game. There may be many students who always wanted to play it but have never found the time, or they may have been overwhelmed by the sheer amount of content involved. We would like to help these students find the time to play this game in the middle of their busy workload, and we\u0027d also like to help break down the game so that it isn\u0027t confusing.",
                                                    "learning_resources":  "There are a great many fanmade sites that were made to help players navigate the world. We will be making many of these links available.",
                                                    "extra_time_commitment":  "As there are few days to play the game in class, students should dedicate time outside of class to make progress in the game. This time should be at least 1hr per week."
                                            }
}