{
        "code":  "98-123",
        "name":  "Student Taught Courses (StuCo): Introduction to Hand Lettering",
        "short_name":  "STUCO: LETTERING",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In this course, we will introduce you to the basics of hand lettering and modern brush calligraphy. Skills such as cursive, monoline lettering, faux calligraphy, brush lettering, shading, blending, and more will be developed with in class practice and projects. By the end of the course, you should be able to create lettering using a variety of materials. There are no prerequisites needed for this course you do not need to have good handwriting to be able to do calligraphy. Everyone is welcome COURSE FEE 3 This is used to purchase recommended supplies for students.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Learn the basic cursive alphabet and calligraphy strokes, which are the building blocks of hand lettering. Understand how to use different materials to create the effect of modern calligraphy, including brush pens, paintbrushes, dip pens, and penspencils. Learn how to create your own style of lettering with flourishes, shading, blending, and more.",
                                                    "key_topics":  "Hand lettering, faux calligraphy, blending, shading and highlights, flourishes, bounce lettering, dip pen calligraphy, basics of typography.",
                                                    "prerequisite_knowledge":  "There are no prerequisites needed for this course; you do not need to have \"good handwriting\" to be able to do calligraphy.",
                                                    "assessment_structure":  "This course is structured where participation will be the majority of your grade. Attendance and participation in class will be assessed. Students are encouraged to practice the skills outside of class, as well, to develop their skills and become more comfortable with calligraphy concepts. There will also be mini, open-ended projects for a more creative outlet, which will also be compiled at the end of the semester in a portfolio that will show the student\u0027s progress over time.",
                                                    "relevance":  "Hand lettering and modern calligraphy will give students a better understanding of how to create aesthetically pleasing designs using different fonts. This can be applied to poster designs, website typography, handwriting used for notetaking, and many more areas. If you have ever seen hand lettering on a poster and wanted to learn how to create it yourself, this is the course for you!",
                                                    "learning_resources":  "A collection of additional learning resources (extra practice sheets, videos, etc.) will be available for student.",
                                                    "extra_time_commitment":  "The extra time commitment expected for this course will be about 1 hour each week. This should be used to practice the skills covered in class that week, as well as working on the relevant projects for the midterm/final when necessary."
                                            }
}