{
        "code":  "98-120",
        "name":  "Student Taught Courses (StuCo): BookTok- Literature\u0027s Social Media",
        "short_name":  "STUCO: BOOKTOK",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "BookTok is a viral sensation on Tiktok that started in 2020 and grew exponentially over the past few years. The platform gives people the opportunity to talk about their favorite books and make memes, edits, and stories about their favorite characters. BookTok has increased the popularity of reading on other platforms as well, such as Instagram and Youtube. BookTok has caused a resurgence in reading, some even going as far to make an aesthetic out of being a reader. With access to go viral through the app, many authors have also skyrocketed in popularity due to their books being recommended by others and themselves on the app. BookTok has many subsections on the platform, ranging from romantasy to the classics, each with varying opinions on if BookTok is helping or harming the publishing industry and overall reading community. From scandals to immaculate book recommendations, BookTok is never short of content. In this class, you will learn about all things BookTok",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "After completion of this course, students should have a deeper understanding of the trends that occur in literature and how it shapes the industry. Students should be able to learn more about themselves as well, finding genres and tropes that they enjoy the most. By the end, students may find a new love for reading or find a new book they want to read Students will also become more equipped with media literacy, learning how posts are made and the algorithms that make them famous. They should be able to identify what becomes most popular in literature and how the publishing industry keeps track of what is the most marketable. Altogether, students will learn how their individualistic habits, whether through consumerism or social media, is able to affect how books and their messages are perceived.",
                                                    "key_topics":  "In this class, we will look at the effect BookTok has on influencing a reader\u0027s recommendations, consumer habits, and even the publishing industry as a whole. We will discuss whether BookTok is elevating inclusivity, how tropes are affecting the popularity of books, and how books tend to become mainstream on the platform. We will look at different authors and content creators and analyze how their rise to fame worked and how it affected their careers. We will also be digging into questions about \"the aesthetic of reading\" and if people are trying to make literature a trend and attempting to gatekeep the art form. Additionally, we will go through the scandals that occurred on the app, talking about the importance of consent and holding people accountable, especially on social media where it is so easy to hide behind a screen. Overall, we will go through multiple book genres and describe the effect they had on BookTok, the reader community, publishing industry, and society as a whole.",
                                                    "prerequisite_knowledge":  "No prior knowledge is required, but a love for reading is always helpful!",
                                                    "assessment_structure":  "Midterm and final presentation, along with a few assignments throughout the semester.",
                                                    "relevance":  "This course is relevant to students because social media is a large part of society and how people get their information today. It is insightful to learn how media can change consumer habits, affect the economy, and change an author\u0027s career in a moment by either making their book a bestseller or canceling them, causing a plummet in their sales. BookTok is just a key example on how anyone can use social media to have a voice, establish communities, and also speak up about wrongdoings. Plus, learning how to get book recommendations through media catered to each student can help them find new favorite books!",
                                                    "learning_resources":  "Canvas page with uploaded presentations and videos will be available for students.",
                                                    "extra_time_commitment":  "Students should prepare to spend a little time outside of class to work on their midterm, final presentation and search for examples online that will benefit to class discussion each week."
                                            }
}