{
        "code":  "98-140",
        "name":  "Student Taught Courses (StuCo): Introduction to Competitive Magic: The Gathering",
        "short_name":  "STUCO: INTROCOMPMGCS",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Magic The Gathering, the originator of collectible card game genre, was created by mathematician Richard Garfield in 1993 and now has an estimated 40 million worldwide players. The game combines strategic thinking, deck construction, game theory, and indepth planning. Magic has a very large dedicated competitive scene that has been around for all its existence. Whether youre a new player who has an interest in learning the game or an experienced veteran, this course is perfect for you  Taught by a former gold level professional player, Pro Tour top 8 competitor, along with other competitors, this course will give you the tools to improve your Magic play.  In this course, you will learn the fundamentals of competitive Magic, such as deck building, game theory, strategy, tactics, and metagame analysis along with the current state of Magic tournaments. No prior experience in Magic is required. Time during class will be spent playing Magic, learning about Magic theory, watching recordings, building decks, and listening to guest lectures from professional players. The semester will end with a final tournament to show off the skills that youve mastered.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Upon completion of this courseStudents without experience will leave with a good understanding of the game. Players with experience will have the tools they need to start playing in tournaments.Players who were already playing in tournaments will learn strategies to take their game to the next level.",
                                                    "key_topics":  "How to Play for new players, Formats of Magic, Advanced rules and Strategy, Game Theory, Side boarding, Metagaming, Tournament Preparation, Deck Selection, Deckbuilding, Archetypes",
                                                    "prerequisite_knowledge":  "Lessons will be adjusted to the skill level of the students in Magic, so no prior knowledge of the game is required.",
                                                    "assessment_structure":  "Assessments will be based on completion of homework assignments, a midterm, and overall participation in the class.",
                                                    "relevance":  "Open to students of all skill backgrounds where everyone can benefit from playing Magic and is a game that is known to improve strategic thinking skills.",
                                                    "learning_resources":  "Articles written about Magic, video recordings of Magic games, professional player guest speakers will be among the resources utilized.",
                                                    "extra_time_commitment":  "There will be 5 homework assignments throughout the semester along with a midterm to test the skills learned along the way."
                                            }
}