{
        "code":  "98-260",
        "name":  "Student Taught Courses (StuCo): Everyday Mindfulness: Pragmatic Peace",
        "short_name":  "STUCO: MINDFUL",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Mindfulness is a mental state achieved by focusing ones awareness on the present moment. When this is done by calmly acknowledging and accepting ones feelings, thoughts, and bodily sensations, mindfulness can be used as a therapeutic technique. The benefits of mindfulness are well documented and proven. From decreased depression, physical pain reduction, regulation of emotions, decreased anxiety, decreased inflammation, improved academic performance, lessened feelings of stress, and the ability to shorten illness such as the cold and flu, mindfulness is a practice everyone can benefit from, especially CMU students.   Throughout this course we will explore several mindfulness mediation techniques to find the one that best fits into your daily routine. Finding time with a busy schedule to fit in one more thing can be hard, so we will explore techniques from across the world and different cultures so that by the time you leave this class, you will have a daily mindfulness practice that best suits you. Examples of techniques include mindful yoga, expanding spaces, body scanning, visual meditations, and walking everyday mindfulness practices, like the ones from prominent mindfulness practitioners such as Thich Nhat Hanh, and many more.   Come with an open heart and mind, and you are sure to leave this class with a greater sense of inner peace and tranquility.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}