{
        "code":  "98-258",
        "name":  "Student Taught Courses (StuCo): Introduction to Competitive Pokemon",
        "short_name":  "STUCO: CMPT POKEMON",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Do you want to be the very best, like no one ever was Pounding the Elite Four into dust with your level 100 team is one thing, but defeating a human trainer on equal footing is another. Competitive Pokemon involves strategy, teambuilding, predictions, and a thorough understanding of battle mechanics, all under a rainbow of different battle formats, each with their own set of rules and playstyles. This course will introduce basic mechanics, teambuilding principles, and strategy, as well as the most popular competitive formats such as VGC, Smogon singles, across the many generations of Pokemons existence. No competitive experience required, but experienced players may also learn something new All teambuilding and battling will be done through the free online simulator Pokemon Showdown.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Be comfortable with playing showdown random battles.Learn how to build teams and play competitive battles in all generations of Pokmon.Learn what it means to play competitive PokmonLearn how to build competitive teams in the real Pokmon games or at least have an appreciation of how annoying it is to make one without hacking",
                                                    "key_topics":  "Battling \u0026 Teambuilding for singles and doubles formats, analytics, creating competitive teams in-game, definitions of competitive Pokémon, general battle mechanics.",
                                                    "prerequisite_knowledge":  "Ideally students should have played a mainline Pokémon game (this is the main audience), but we will still try our best to teach anyone who takes the course.",
                                                    "assessment_structure":  "We will have a mid-semester and final tournament in which students will be graded based on completion. Building teams in order to play is required.",
                                                    "relevance":  "Competitive Pokémon is a large part of Pokémon, and at the very least, it gives people who know about Pokémon a quick way to play Pokémon with others. It also generally makes the games more enjoyable just from understanding how one of the core aspects of it works.",
                                                    "learning_resources":  "Online guides, Course Presentations, discord server to ask questions",
                                                    "extra_time_commitment":  "Lecture quizzes due after class and short homework assignments, usually about a paragraph of writing or 3 online battles."
                                            }
}