{
        "code":  "98-251",
        "name":  "Student Taught Courses (StuCo): Principles of Racecar Engineering",
        "short_name":  "STUCO: RACECAR ENG",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course introduces students to key concepts and strategies used when designing and building a racecar. We will focus on two key areas 1 understanding the theory of vehicle dynamics and how it drives vehicle design, and 2 learning basic engineering strategies as applied to the design and construction of racecars. The first half of the course will focus on vehicle dynamics and high level qualitative vehicle and system design. Topics include vehicle dynamics, tire behavior, suspension design, powertrains, and aerodynamics. The second half of the course will focus on engineering skills and their applications to racecar design and manufacturing. Topics will include engineering design, manufacturing techniques, computer aided engineering, and testing and tuning. We will also discuss the history of motorsports and watch motorsports documentaries throughout the semester to provide students with a greater understanding of the context of their work in the course. This is a project based course that will require students to learn and apply various computational tools to create their own vehicle and part designs. There will be two large projects in the course. The first project is a vehicle dynamics focused project involving optimizing a vehicle design using lap simulation software. The second project is an engineering project in which students will optimize a given part based on given design criteria. Students need not have any prior experience with cars or engineering, but are expected to have a basic understanding of physics and a strong desire to dive into technical topics and learn new skills and software tools.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}