{
        "code":  "98-268",
        "name":  "Student Taught Courses (StuCo): The Scary Story: Gothic Lit and the Uncanny",
        "short_name":  "STUCO: SCARY STORY",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course on Gothic literature and the scary story is for anyone who is intrigued by things that chill the blood and tingle the spine. All are welcome, from literary enthusiasts to those who haven?t taken an English course in years; all you need is an interest in storytelling and curiosity about human darkness. The course will explore Gothic themes, the nature of the uncanny, and the evolution of the scary story across region and time. How is the scary story colored by history and folklore? What psychological horrors lurk at the core of all truly scary stories? How does the history of the scary story relate to contemporary horror media? We will explore these questions and many more through authors such as Edgar Allan Poe, H. P. Lovecraft, Joyce Carol Oates, and a host of others. Class will be primarily lecture- and discussion-based. The midterm and final will allow you to create your own scary stories or creations to be shared in a spooky campfire- esque setting. Enroll if you dare!",
        "student_sets":  [

                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}