{
        "code":  "98-254",
        "name":  "Student Taught Courses (StuCo): Ukulele For Non-Majors",
        "short_name":  "STUCO: UKELELE",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The ukulele is one of the most accessible instruments created unlike the guitar or piano, the ukulele only has four strings and is much smaller, which is easier to transport. This makes it an ideal instrument for making music anywhere. This course will develop the musical abilities of students through a combined crash course of basic harmony, eurhythmics, and solfege, while simultaneously applying that knowledge to the ukulele. Students will acquire knowledge in music theory to order to read and build chords, a skill important to learning songs. Students will also acquire a rhythmic ability such that they can strum comfortably and effortlessly. Lastly, students will acquire some form of vocal and ear knowledge to assist in their education. The course may be intensive for students with absolutely no musical ability. Students will learn a variety of techniques in weekly classes and the broad scope of musical development may prove a little difficult. However, this can be amended with adequate practice, which is emphasized at the end of each class. Students are required to purchase their own ukulele instruments. Prices range from 3045.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}