{
        "code":  "98-269",
        "name":  "Student Taught Courses (StuCo): Intro to Sabermetrics",
        "short_name":  "STUCO: SABERMETRICS",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Born in the 1970s and popularized by Moneyball as a radical challenge to traditional baseball statistics, sabermetrics has developed into a new way of understanding Americas pastime. Its practitioners have created new statistical tools and revised our old ways of thinking about the game, transforming the way fans and Front Offices view and assess players. This introduction to the basics of sabermetrics will explain concepts including standardization, peak versus career performance, linear weights and runs created, as well as popular calculations such as OPS OnBase plus Slugging, WHIP Walks and Hits per Inning Pitched, PF Park Factor, and others increasingly used by members of the sabermetrics community.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will gain a deep understanding of baseballs statistical revolution. Learn how to identify and best utilize the numerous statistics which are used everywhere throughout baseball today.",
                                                    "key_topics":  "Students will learn basic and advanced statistics for all parts of baseball. This includes defensive, pitching, and offensive stats. The language of specific statistics and how to evaluate players and teams across baseball history. Students will also learn about the impact of sabermetrics on baseball strategy and discussion.",
                                                    "prerequisite_knowledge":  "Basic understanding of baseball ideal, but it is not necessary to take the course.",
                                                    "assessment_structure":  "Final Project - 30%\nAttendance - 50%\nQuiz - 20%",
                                                    "relevance":  "Fans of baseball analytics, or sports analytics in general, will have the chance to expand their knowledge and grow their passion.",
                                                    "learning_resources":  "The course Canvas page will contain weekly slides (posted after lecture), as well as any recommended supplementary materials.",
                                                    "extra_time_commitment":  "Quiz is through Canvas and will need to be completed outside of course lecture time"
                                            }
}