{
        "code":  "98-203",
        "name":  "Student Taught Courses (StuCo): Music and Interaction",
        "short_name":  "STUCO:MUS AND INT",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In this course, students will sample a wide variety of knowledge ranging from the fields of HCIGame design, music theorymusic computing, interactive media design, and learn about how these disciplines intersect. The course will also provide an introduction to the history and development of rhythm games, audiovisual art, and experimental music practices. Instruction is a combination of lectures on various topics followed by handson p5.js programming exercises. Assignment will consist primarily of creative coding assignments where students with less programming background can build algorithmic thinking skills while more advanced coders will be able to apply their knowledge and build their portfolio. Collaborations are welcome on projects, especially between students from different backgrounds. Students with a background in any form of design, media arts, HCI, computer science, music, IDEATE, will be a good fit for the course. The course will be taught in p5.js, but students are free to explore other tools e.g. Unity, Max MSP for their projects. Students should be familiar with at least one of the following fields design, music, programming, or be committed to spend extra time learning outside of scheduled lecture times. Coding knowledge is strongly preferred but not a requirement as we will go through programming basics in the first few weeks.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Understanding the relationship between music, computation, and interaction. Learn about the history of rhythm games and visual music. Basic coding proficiency. Realizing two major interactive music projects.",
                                                    "key_topics":  "game design, p5 programming, visual music history, rhythm gaming history.",
                                                    "prerequisite_knowledge":  "No mandatory prerequisites. Background in basic coding, music, and design will be very helpful.",
                                                    "assessment_structure":  "Participation, presentation, coding assignments, midterm+final projects",
                                                    "relevance":  "This course aims to bring together people from different departments that have a common interest in this topic. Music students who are interested in exploring interactive mediums and computing, or computer science students who wants to apply their skill to creative works would be targets student populations. This class covers a wide range of topics so it should be a new experience for most students looking to expand their knowledge on interdisciplinary fields related to their major study. This class can also be a place where collaborations between departments can happen, for students in tech, art, and design to come together and work on ambitious projects.",
                                                    "learning_resources":  "The p5.js coding library has a wide range of community resources, such as detailed youtube series that teaches complete beginners to code through the library. There are also many complimentary readings that are available online relevant to the studies of music and interaction.",
                                                    "extra_time_commitment":  "There will be recommended readings, as well as open-ended weekly coding assignments based on topics discussed in class. Time should also be committed to create two major collaborative projects."
                                            }
}