{
        "code":  "98-205",
        "name":  "Student Taught Courses (StuCo): Introduction to Minecraft",
        "short_name":  "STUCO: MINECRAFT",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Minecraft is the single most sold video game of all time. It places you in a randomly generated world of blocks and sets you free to survive and be creative in a completely sandbox environment. This course will provide survey information on playing Minecraft, including basic to advanced survival skills, multiplayer aspects, modding, and whatnot. Along with playing survival Minecraft together on a class server, we will also play fun Minecraft minigames inclass and explore possibilities such as playing on public servers. By the end of this class, students should know the basics about Minecraft and be able to survive in a Minecraft world, as well as expand their knowledge about Minecraft to depth within and out of the game. This class is designed for both players completely new to the game, as well as those with plenty of experience who are looking to play the game with some new friends. The desktop computer WindowsMacLinux edition of the game costs 30 and is required for the course.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of this class, students should know the basics of Minecraft and be able to survive in a Minecraft world, as well as expand their knowledge about Minecraft indepth within and out of the game.",
                                                    "key_topics":  "This course will provide survey information on playing Minecraft, including basic to advanced survival skills, multiplayer aspects, minigames, modding, etc. Along with playing survival Minecraft together on a class server, we will also play fun Minecraft minigames in class and explore possibilities such as playing on public servers.",
                                                    "prerequisite_knowledge":  "None! Gaming experience can be helpful, but is not required.",
                                                    "assessment_structure":  "Attendance, assignments, midterm (adventure map), and final project. A student must earn a pass in all four sections to pass the whole course. Don\u0027t be stressed about the assignments! This is a class meant to be fun.",
                                                    "relevance":  "Minecraft is an extremely creative game, even more so than many subjects taught in school. This game will challenge a student\u0027s creativity and adaptability of knowledge in various scenarios in the game, which hopefully translates to the same abilities in life as well. Aside from these, we will also teach various mechanics of Minecraft which is relevant with computer science and mathematics to fully understand the game.",
                                                    "learning_resources":  "There are plenty of learning resources for Minecraft online, including a comprehensive wiki that contains documentation on almost every aspect of the game and plenty of video guides. A custom web system for this course and a class Discord will be used to facilitate logistics.",
                                                    "extra_time_commitment":  "Homework, midterm (if not completed in the one class session), and final project are to be completed outside of class."
                                            }
}