{
        "code":  "98-262",
        "name":  "Student Taught Courses (StuCo): Intro to Boardgames",
        "short_name":  "STUCO: BOARD GAMES",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course will introduce students to the hobby of board games and nonstandard card games. We will be playing a wide variety of game genres and investigating their mechanics, with the ultimate goal of expanding your knowledge of the wide varieties of games and understanding their mechanics enough to extend similar principles of play to games that use similar mechanics. Each week we will have a small lecture and then play some of the board games we spoke about. Roughly every 3 weeks we will ask for a progress report on your midtermfinal. What Kinds of Games will we be playing Eurogames Settlers of Catan, Carcassonne, Ticket to Ride, Stone Age, Puerto Rico, etc. Nonstandard Card Games Fluxx, Pit, Race for the Galaxy, The Resistance, etc. What Kinds of Games we will NOT be playing  Including but not limited to the following examples  Common household boardgames Risk, Monopoly, Dominoes, Sorry, Apples to Apples, Scrabble, Clue, Life, Trivial Pursuit, etc. Standard 52 Card Deck Card Games Blackjack, Poker, Rummy, etc.  Traditional Games Chess, Checkers, Go, Nine Mans Morris, etc.  We are not contractually obligated to introduce all of the games on the list, nor are we restricted only to this list when deciding upon what games we will play.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Creating your own board game, learning about different board games, meeting other people.",
                                                    "key_topics":  "Teamwork, different types of board games, how to create your own board game.",
                                                    "prerequisite_knowledge":  "Enthusiasm! Otherwise, no prerequisites are required.",
                                                    "assessment_structure":  "Attendance, final project - making their own playable board game",
                                                    "relevance":  "The skills learned by studying board games are applicable in many situations such as they teach you how to interact with people and manage your own resources. Strategy board games are relevant to problem solvers.",
                                                    "learning_resources":  "Canvas, Power Point Presentations.",
                                                    "extra_time_commitment":  "Weekly time devoted to creation of a board game."
                                            }
}