{
        "code":  "98-219",
        "name":  "Student Taught Courses (StuCo): Engineering: My Heart is in the Work",
        "short_name":  "STUCO: IDEAS ENGRG",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The main goal of this course is to expose students to the fields of engineering studied at Carnegie Mellon. The class will emphasize different aspects of engineering such as working in groups, getting handson with projects and technical knowledge. We hope to get the students invested in the ideas and methods of engineering and feel a nerdy excitement for the concepts involved. We plan to focus on the sweet spots of the different fields in engineering, exposing students to the material that motivates the current upperclassmen to pursue the field while accurately representing what one might do in a typical day of majoring in that field. Each lecture will be taught by students for students. Upperclassmen from across the engineering disciplines will share their enthusiasm for their major by teaching four lectures in their area of study. This class will help incoming freshmen understand what the different engineering majors are about and will help them decide what they want to study for their four years at CMU. Additionally, it will allow students outside of engineering to be exposed to what engineering is about in general, instead of focusing on just one field of engineering.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}