{
        "code":  "98-201",
        "name":  "Student Taught Courses (StuCo): Filmography",
        "short_name":  "STUCO: FILMOGRAPHY",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Spring 2015 Course Description: \u003cbr\u003e  The theme is \"The Pragmatics of Romantic Relationships\" and will represent the final academic offering in the 98-201 Filmography course sequence. If waitlisted, please contact instructor directly for availability. What makes a romantic relationship work? When do these relationships begin to fall apart? In this course, we will ground our cinematic expectations of romance within the pragmatics of emotional availability, long-distance, and human sexuality. Throughout the semester, students will be introduced to the subtleties of fate, the nuances of infidelity, and the boundaries of attachment within both healthy and dysfunctional on-screen partnerships, as seen across cinema\u0027s most pragmatic films on romantic relationships. To successfully complete this course, you must have a demonstrated interest in becoming conversant in film (or relationships) before graduation -- and of course, you\u0027ll have to have a little faith in people. A course fee of $10/student will be collected at the beginning of the semester towards weekly refreshments and lecture series.",
        "student_sets":  [

                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}