{
        "code":  "98-213",
        "name":  "Student Taught Courses (StuCo): Excelling in Excel",
        "short_name":  "STUCO: EXCEL",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Learn to use Microsoft Excel and Google Sheets in the context of data science, engineering, and decision science. Become better at organizing and analyzing quantitative and qualitative data for classroom use and personal records.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Practice using spreadsheets to organize data, keep records, and do simple calculations. Learn to sort, filter, and analyze quantitative and qualitative data. Learn spreadsheet formulae and differences across Excel and Google Sheets, as well as different versions of these programs.",
                                                    "key_topics":  "Excel formulae (for data analysis and aggregation), spreadsheet formatting (overall functionality and conditional formatting), searching and filtering spreadsheets, basics of what-if analysis and dynamic arrays.",
                                                    "prerequisite_knowledge":  "This course assumes little to no prior knowledge in Excel or related programs. Proficient users are welcome but are unlikely to learn anything new.",
                                                    "assessment_structure":  "There will be two projects, one as the midterm and one as the final project. The midterm will involve creating a budget or similar record. The final project is up to the student (examples include NPV calculator, decision tree, or a Stardew Valley checker).",
                                                    "relevance":  "Basic spreadsheet skills are applicable to every individual. Engineering students in particular can use it for data organization and basic graphing and analysis. Students in Social and Decision Sciences will also use Excel extensively.",
                                                    "learning_resources":  "Excel documentation is exceedingly prevalent on the internet and students are encouraged to utilize these resources, especially for syntax questions",
                                                    "extra_time_commitment":  "The four homeworks and projects are expected to be completed out of class, but there will be additional class time to work as needed."
                                            }
}