{
        "code":  "98-288",
        "name":  "Student Taught Courses (StuCo): Star Wars: The Course Awakens",
        "short_name":  "STUCO: STAR WARS",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "We will spend each class focusing on a specific topic in the Star Wars universe starting with plot discussion, clip viewing, fun facts, and opinions on each of the canon films. Then we will look more into the details of what makes Star Wars the worldwide pop culture phenomenon that it is by discussing other aspects of the franchise in the remaining classes.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Our goal is for students to have a greater appreciation of the Star Wars universe and how it can be used to learn more about themselves and the real world around them.",
                                                    "key_topics":  "This course will cover the breadth of the Star Wars universe including the feature films, TV series, Expanded Universe, and more.",
                                                    "prerequisite_knowledge":  "None, however it is recommended to have seen at least some of the Star Wars movies.",
                                                    "assessment_structure":  "Students will be mainly graded on attendance and participation. There is also a midterm and a final exam, but they have limited impact on student grades.",
                                                    "relevance":  "This course is a fun getaway from stressful life at CMU. Students will also learn elements of film and film criticism.",
                                                    "learning_resources":  "We provide reference to a useful textbook, recommended readings, and the films themselves.",
                                                    "extra_time_commitment":  "Weekly polls for students to complete. Students are also expected to watch relevant Star Wars movies or TV shows before each class."
                                            }
}