{
        "code":  "98-272",
        "name":  "Student Taught Courses (StuCo): Financial Literacy for Beginners",
        "short_name":  "STUCO: FINANCIAL LIT",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is an introductory class designed to provide an overview of financial literacy. This course will break down ways for each student to think about their own spending habits and come up with ways to make better financial decisions. We will start off with basic knowledge about budgeting, spending psychology, banking, creditdebit cards, and go into some of the basic investing and economic information you should know when handling any money. This course will also integrate simple monetary biases that people have, and how to tackle and handle those situations. Students should be able to balance their finances and have a financial goal for the future by the end of this course.   Learn basic knowledge about budgeting, banking, creditdebit cards   Understand simple monetary biases that people have, and how to tackle and handle those situations   Balance finances and have financial goals for the future, including investment priorities.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The goal of this course is that students will be equipped with tools necessary to begin planning for their financial futures, including setting SMART goals for their personal finances and other skills.",
                                                    "key_topics":  "Budgeting, psychology behind spending, banking, loans, taxes, investing basics, investing strategies, retirement planning, insurance, financial order of operations, topic of interest (examples from previous years: crypto, real estate)",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "15% Investment Simulation\n20% Attendance\n15% Quizzes\n25% Midterm\n25% Final",
                                                    "relevance":  "After and during college, targeted student populations seek financial independence and stability for themselves outside of their parents and guardians\u0027 finances. In order to achieve this, students will be exposed to critical financial literacy topics to pave the way for a future of healthy personal finances.",
                                                    "learning_resources":  "Investment simulation and prepared slide resources will be available for students.",
                                                    "extra_time_commitment":  "There will be weekly homework and quiz assignments that should take no more than two hours to complete each week. The investment game will run after the second half of the semester, at which point students may spend an aggregate of two hours making trades."
                                            }
}