{
        "code":  "98-259",
        "name":  "Student Taught Courses (StuCo): From Food to Chinese Culture",
        "short_name":  "STUCO: GENERAL TSO\u0027S",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Maybe you are familiar with General Tsos chicken, Kung Pao chicken Ma Po Tofu, dumplings and spring rolls, and maybe you like them pretty much. But who is general Tso What is Kung Pao Where is Ma Po from Who invented dumpling Why do we eat spring rolls If you are curious about the answers, this course is right for you.  The lecture series covers ten most wellknown Chinese festivals with their food and one additional special topic. Each lecture has a culture session and a language session. The culture session introduces Chinese festivals with their associated legend stories and food while the language session introduces students to some sophisticated yet practical Chinese phrases or even verses from a poem. Through this interesting detour, this course provides an explanation of obscure aspects of Chinese language and culture. By the end of the course, students should walk away with basic ideas about Chinese culture and also advance in Chinese language.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}