{
        "code":  "98-230",
        "name":  "Student Taught Courses (StuCo): Avatar: The Last Airbender \u0026 The Legend of Korra",
        "short_name":  "STUCO: AVATAR \u0026 KORR",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This class will offer an opportunity for fans of Avatar The Last Airbender and The Legend of Korra to engage in discussion of the two shows themes, characters, storyline, animation, and the many cultural influences on the shows creation, particularly East and South Asian cultures. A typical class will begin with a presentation on the topics of the week with ample opportunity for class discussion, before watching an episode of Avatar The Last Airbender or The Legend of Korra.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Our goal is that students have a deeper understanding of the reallife cultural and historical influences in Avatar, and be able to critically analyze the themes, character development, motivations, and arcs, understand how the two series were developed and produced, and engage in thoughtful, respectful discussions about the topics discussed from the shows. Students will have a better understanding of the different elements that make Avatar such an incredible, influential, and widely beloved show.",
                                                    "key_topics":  "Topics of discussion will include the history behind the two series, world building, technological developments, East Asian, South Asian, and various other cultures that inspired the show, and various forms of martial arts. We will also discuss the legacy of Avatar: The Last Airbender and The Legend of Korra, and the impact it has had on animation, especially in regards to the surge of queer representation in media following The Legend of Korra.",
                                                    "prerequisite_knowledge":  "It is recommended that students have seen Avatar: The Last Airbender and The Legend of Korra, but this is not a requirement. This class will remain open to everyone, from longtime fans to newcomers to the franchise. All that\u0027s needed is a passion and curiosity for the Avatar franchise and universe.",
                                                    "assessment_structure":  "The majority of a student\u0027s grade will be based on in-class participation. It is important to be engaged and present for classes. There are occasional homework assignments consisting of a brief written response to a question based on the previous class. as well as a midterm and final project. The midterm will consist of several short-answer prompts based on material covered in the first half of the semester. The final project is a project and/or presentation related to Avatar the Last Airbender. Topics can be anything so long as they are related to Avatar and involve time and effort to create (min. 5 hours). Given that this is a very participation-based class, attendance is mandatory, and two unexcused absences will result in failing the class. Excused absences are allowed, as long as instructors are notified in advance.",
                                                    "relevance":  "We will explore and learn about the rich and diverse cultures that inspired the world of Avatar, as well as diversity and representation in the medium of animation. The Avatar franchise has become a cultural touchstone, viewed by many as among the greatest series of all time, and having an incredible influence on animation and pop culture. Avatar has also introduced many viewers to the Asian cultures, traditions, and martial arts depicted in the franchise for the first time, and has allowed viewers of Asian descent to feel seen.",
                                                    "learning_resources":  "The presentations will be on Canvas for the entire semester, and access to the episodes will be given on an as-needed basis. If any student needs accommodations for attendance or assignments, we are willing to discuss potential accommodations for the class. Though this class will not cover the Chronicles of the Avatar novel series, the first three novels will be available to borrow on request for curious students on a first-come-first-serve basis.",
                                                    "extra_time_commitment":  "There are homework assignments, a midterm, and a final project. Homework will consist of a very brief written response to a question about a topic covered in the previous class. The midterm will consist of several short-answer prompts based on material covered in the first half of the semester. The final project is a project and/or presentation related to Avatar The Last Airbender/ The Legend of Korra. Topics and mediums can be anything so long as they are related to Avatar and involve time and effort to create (min. 5 hours). Potential topics can be run by the professors at any point during the semester. Projects can be completed individually or in groups of two."
                                            }
}