{
        "code":  "98-359",
        "name":  "Student Taught Courses (StuCo): Survey of Horror in Media",
        "short_name":  "STUCO: HORROR MEDIA",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course aims to provide a brief introduction to the horror genre across multiple mediums. We will engage with works of horror from diverse sourcestelevision, feature films, short stories, fine art, and music created over a period of nearly 200 years with the goal of pinpointing the characteristics of effective horror media. The course will feature material that is violent and often disturbing by nature.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The students should be able to articulate what makes horror effective, and have a deeper appreciation for the craft of producing good horror.",
                                                    "key_topics":  "Entertainment, Aesthetics, Criticism, Analysis",
                                                    "prerequisite_knowledge":  "Students should be able to write concisely and put together logical arguments before taking this course.",
                                                    "assessment_structure":  "The students will be given small writing assignments weekly, to be completed during class time, an essay assignment for the midterm, with a presentation for the final.",
                                                    "relevance":  "This course is designed to be a deep dive into the horror genre, and get students to think about elements in groundbreaking works that they may not have thought about before.",
                                                    "learning_resources":  "All material for the course will be available online. The material consists of a mix of text and audio/visual media.",
                                                    "extra_time_commitment":  "The students will be expected to preview the material that will be discussed before the course meeting."
                                            }
}