{
        "code":  "98-349",
        "name":  "Student Taught Courses (StuCo): Logic Puzzle StuCo",
        "short_name":  "STUCO: LOGIC PUZZLE",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Students will learn about various logic puzzle genres, such as Sudoku, Masyu, and other gridbased puzzles. They will learn techniques applicable to specific puzzles, and general strategies applicable to all puzzles or activities involving logic. Students will also have the opportunity to create their own puzzles, as well as learn about the math and history behind certain puzzle types. There are no prerequisites.  The first half of each class will be lecturebased, introducing a puzzle genres rules and various techniques. For the rest of class, students can work together to apply those techniques to solve puzzles.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students should learn how to logically approach problems rather than guessing, understand beautiful deductions such as entrance counting and parity, and see the process behind constructing a puzzle. Furthermore, students will hopefully try out logic puzzles as a way to have fun while keeping the brain active.",
                                                    "key_topics":  "Overview of logic puzzles, loop puzzles, object placement puzzles, number placement puzzles, shading puzzles, websites used to construct puzzles.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "60% homework, 20% midterm, 20% final. The midterm and final are similar to projects because they involve constructing a puzzle.",
                                                    "relevance":  "Anyone can enjoy logic puzzles, as it\u0027s an interesting way to spend time and have fun. It is especially relevant for students, who enjoy using the sort of reasoning and creative thinking skills involved in college classes.",
                                                    "learning_resources":  "Resources will be available as links to various blogs written by puzzle masters around the world.",
                                                    "extra_time_commitment":  "Students will solve logic puzzles on a handout provided weekly, as homework."
                                            }
}