{
        "code":  "98-348",
        "name":  "Student Taught Courses (StuCo): Introduction to Old Icelandic",
        "short_name":  "STUCO:INTRO OLD ISL",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Ask veit ek standa, heitir Yggdrasill hr bamr, ausinn hvta auri aan koma dggvar rs  dala falla stendr  yfir grnn Urar brunni.  In this course, we will learn the basics of Old Icelandic  the language itself as well as relevant concepts in linguistics. Topics in Old Icelandic include orthography, phonology, mutations, noun, pronoun and adjective declension, verb conjugation and syntax. We will also read and translate and write our own Old Icelandic text.  Topics in linguistics include basics of phonology, historical linguistics, particularly the development of ProtoGermanic into Old Icelandic. We will compare and contrast Old Icelandic with other languages, modern or ancient, to facilitate our understanding of linguistics.  If time allows, we may also discuss the history and the culture of the Nordic people, who constituted the majority of the speakers of Old Icelandic however, it is to be noted that the focus of this course is on the language and linguistics rather than on history and culture.  Upon completion of the course, in addition to gaining an understanding of the above topics, students will be able to conjugate verbs and decline nouns, adjectives and pronouns given their conjugation and declension classes, translate basic Old Icelandic text into English with a dictionary.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}