{
        "code":  "98-389",
        "name":  "Student Taught Courses (StuCo): Introduction to Nail Art",
        "short_name":  "STUCO: NAIL ART",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "With nail art, selfexpression is right at our fingertips. Together, we will dive into not only how to paint various nail art designs, but we will also discuss the origins of nail art and past nail art trends. Each week, we will learn and practice a new design technique. By the end of the course, you will have your very own nail salon right at home. No prior nail painting experience is required. Students are encouraged to bring any of their own nailartrelated supplies e.g. nail polishes, nail art brush, dotter tool, nail polish remover if they have any and would like to use their own tools. Otherwise, the course will provide all necessary materials as shared class resources for all students. COURSE FEE 5.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://leesue630.github.io/intro-nail-art/",
        "custom_fields":  {
                                                    "goals":  "Understand how a nail art design was executed through visual examination.",
                                                    "key_topics":  "How to paint various nail art designs and the origins of nail art and past nail art trends.",
                                                    "prerequisite_knowledge":  "No prior knowledge required.",
                                                    "assessment_structure":  "In-person attendance, Midterm canvas assessment, and Final project (students create their own nail design).",
                                                    "relevance":  "This course is relevant to anyone that would like to learn how to paint their nails or is looking to take an hour out of their week for self-expression and care.",
                                                    "learning_resources":  "We will have a course website that will feature any relevant source material students may need. Students are also welcome to do their own research.",
                                                    "extra_time_commitment":  "Students will complete their midterm multiple choice assessment and Final Project nail designs outside of class."
                                            }
}