{
        "code":  "98-341",
        "name":  "Student Taught Courses (StuCo): Build Your Own Breadboard Computer",
        "short_name":  "STUCO: DIY COMPUTER",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Students will construct a homebrew computer on a breadboard from basic parts e.g. a CPU, RAM, and ROM, similar to Ben Eaters Custom 6502 YouTube series. The computer will be built in a modular way, studying each part individually to go from a computer that can only blink a light to a fully complete system. By the end of this class, students will have their very own expandable custom computer that can communicate with other devices, display text, play games, etc. No computer architecture or assembly knowledge is required, though familiarity with breadboarding and the basics of digital logic is recommended. Some work time outside of class 3 hours per week will be required for building. A materials fee of 30 may be required amount TBD.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course, students will be able to understand and explain how a microprocessor and peripherals are used to form a complete computer system, have handson experience building a real computer from scratch, be able to write code for their custom computer to interact with the world, and understand how this computer relates to modern computer design.",
                                                    "key_topics":  "The design and implementation of microcontroller systems, including reading and building electronic schematics, understanding timing diagrams, memory buses and bus components, CPU status signals and execution, and assembly-language programming.",
                                                    "prerequisite_knowledge":  "Students should be familiar with using breadboards to build electronic circuits. 18-100 (or equivalent) is highly recommended. Familiarity with assembly programming of any kind helps but is not required.",
                                                    "assessment_structure":  "There will be a midterm assessment and a final assessment. The midterm assessment will be a demonstration of a functioning (work-in-progress) computer along with technical questions. The final assessment will be a demonstration of a project of the student\u0027s choosing. Remaining points are assigned based on participation.",
                                                    "relevance":  "There is very little existing curriculum that covers the area between microprocessor design and writing code for complete systems. Microcontrollers used in ECE classes such as Arduinos are typically presented as black boxes that \"just work.\" This course will bridge the gap between an individual microprocessor and a fully functioning computer system.",
                                                    "learning_resources":  "An existing YouTube series (Custom 6502 by Ben Eater) closely follows the structure of this class. For more practical design considerations there is the Homebrew 6502 set of articles by Wilson Mines. A completed computer for demonstration and schematics will be available for students to inspect directly.",
                                                    "extra_time_commitment":  "Depending on experience level, 1-5 extra hours per week outside of class time will be required for building the computer. There is no homework other than building the parts that are explained in each lecture."
                                            }
}