{
        "code":  "98-309",
        "name":  "Student Taught Courses (StuCo): Build Your Own Startup",
        "short_name":  "STUCO: TECH STARTUP",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In this dynamic and interactive course, we will take a handson approach to learning about entrepreneurship with a focus on startups in technology, data, green energy, fintech, healthcare, and other areas of student interest. Students will be divided into teams and will work together as potential cofounders throughout the course, giving them a realistic experience of the startup journey. Through engaging lectures, practical exercises, and realworld case studies, we will explore key concepts such as product market fit, marketing strategies, financing a business, and wireframing. Each week, we will delve deeper into one of these topics and students will have the opportunity to apply their understanding to their own startup idea, through regular feedback and mentorship from instructors and guest industry experts. The course will culminate in a final pitch where students will present their startup to the class and instructors, giving them a taste of the realworld experience in incubator and accelerator applications. Grading will be based on the quality of the pitch, the progress made on the startup throughout the course, and participation in class discussions and group work. This course is designed for students who are passionate about entrepreneurship and innovation and want to gain a deeper understanding of the startup ecosystem.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Complete an effective startup pitch and be ready to professionalize their idea for incubators and accelerators along the lines of YCombinator, The Founder Institute, and Techstars.",
                                                    "key_topics":  "Key concepts: product market fit, marketing strategies, financing a business, marketing, startup round raises, culture, user interviews, wireframing, and more.",
                                                    "prerequisite_knowledge":  "N/A. Students who are ready to jump into the world of entrepreneurship and learn what it takes to start a successful, innovative startup.",
                                                    "assessment_structure":  "\"Homework is assignment-based\nExams are pitched based (startup pitch final and midterm progress check)\nProject on startup is the overall course goal.\"\n\n- 20% participation/attendance.\n\nPass/No Pass grading. 70% or higher for a Passing grade.",
                                                    "relevance":  "This course is designed to provide students with the knowledge and skills they need to start their own business and succeed in the competitive world of technology startups.",
                                                    "learning_resources":  "Figma, case studies, prior StuCo slides and pitches, guest speakers, connections to Undergraduate Entrepreneurship Association, and announcements posted on incubators, competitions, and accelerator applications.",
                                                    "extra_time_commitment":  "1-2 hours outside of class. This is to develop the weekly assignments."
                                            }
}