{
        "code":  "98-390",
        "name":  "Student Taught Courses (StuCo): They Came as Romans: Roman Civilization 360",
        "short_name":  "STUCO: ROMAN CIV",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Roman civilization was a famous and powerful ancient civilization, however its details are not regularly taught in schools. Moreover, even when its taught, instructors often weigh too much on the historical timeline and take its culture for granted. In this course we will look into Ancient Rome through multiple lenses, including history, politics, warfare, society, culture, etc. We hope that through this course students will have a broad and more complete view of the ancient Roman civilization. We will also correct misinformations of Ancient Rome by popular media. This course will be conducted in a nonacademic manner and its fun and informative",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will have a broader and more unbiased view of ancient Roman civilization. They can also have their previous incorrect knowledge of Ancient Rome through popular media corrected.",
                                                    "key_topics":  "General historical timeline from Rome\u0027s legendary foundation to its fall in 476CE. Roman governmental system, military, society, entertainment, culture, literature, religion, key figures, key provinces, etc.",
                                                    "prerequisite_knowledge":  "Knowing that there was a civilization called Ancient Rome",
                                                    "assessment_structure":  "Final",
                                                    "relevance":  "Since CMU doesn\u0027t have a classics department, lots of students who are interested in Ancient Rome including myself can\u0027t learn according to their interests. Additionally, this course mainly deal with parts of Roman civilization that are uncovered in popular media or history textbooks. Learning this can also expand student\u0027s knowledge.",
                                                    "learning_resources":  "Web pages",
                                                    "extra_time_commitment":  "Yes. An average of 20 minutes of reviewing course materials/background research before class is recommended"
                                            }
}