{
        "code":  "98-372",
        "name":  "Student Taught Courses (StuCo): Introduction to Battlestar Galactica",
        "short_name":  "STUCO: GALACTICA",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In 1982, Edward James Olmos played Detective Gaff in Blade Runner. Four years later, when offered the lead role on Star Trek The Next Generation, he turned it down. Why He didnt want to do any more scifi. Why, then, did Olmos agree to lead the reboot of Battlestar Galactica, a cheesy science fiction show from the 70s that earned most of its fans by coasting on Star Wars hype   Through the course of a semester, we attempt to answer this question, and in the process, explore Battlestar Galacticas impact on American society. This course is for everyone who wants to learn more about Battlestar Galactica. Whether youve watched no Battlestar Galactica, or all of Battlestar Galactica, this StuCo is a forum for fans to simply watch the show and talk about it. We will spend each class discussing a different topic in the Battlestar Galactica universe, discussing plot elements, behindthescenes fun facts, and the impact Battlestar Galactica had on pop culture.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}