{
        "code":  "98-360",
        "name":  "Student Taught Courses (StuCo): Gödel, Escher, Bach: an Eternal Golden StuCo",
        "short_name":  "STUCO:GEB",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "What do mathematics, philosophy, and the arts have in common This course will study the underlying themes and patterns of many seeminglydisparate fields, united by the idea of extracting meaning from meaninglessness, through the imposition of rules and selfreference. Students can expect to become familiar with ideas pertaining to the meaning of truth, the recognition of thinking on multiple different levels, and how recursive ideas can produce incredible results in many different contexts, even going so far as to provide a foundation for human intelligence itself. These ideas are all grounded in and taught from the book Gdel, Escher, Bach an Eternal Golden Braid, the groundbreaking 1979 book published by professor Douglas Hofstadter that changed American intellectualism at its core. A background in logic, mathematics, or computer science can help with comprehension, but it is by no means required.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will be able to recognize common patterns of selfreference in common phenomena such as math, art, and music. Students will be able to appreciate the beauty in such selfreference, and how mathematics can be beautiful in a way that transcends pretty pictures. Students will be able to critically think about what their perception of the theory of the self is.",
                                                    "key_topics":  "Gödel, Escher, Bach: Recursion, elegance in mathematics, the origin of human intelligence.",
                                                    "prerequisite_knowledge":  "A background in logic, mathematics, or computer science can help with comprehension, but it is by no means required.",
                                                    "assessment_structure":  "Homeworks will be based on summarizing the ideas of the latest chapter in the book, as well as small brain-teasers and puzzles relating to the topic of the week.",
                                                    "relevance":  "As undergraduate students, we stand at the brink of the casual layperson and the academic world. Gödel, Escher, Bach, written in 1979 by professor Douglas Hofstadter, became an immediate hit, and embedded itself into the American mainstream, teaching people about how cognition can be explained in terms of recursive ideas at the level that a layperson could understand. It is important to understand this book, not only for its fascinating ideas, but to understand how it connected the world at the time, and how its ideas are relevant today.",
                                                    "learning_resources":  "A PDF of the book will be made available.",
                                                    "extra_time_commitment":  "Homework, and perhaps some take-home aspect to midterm/final."
                                            }
}