{
        "code":  "98-335",
        "name":  "Student Taught Courses (StuCo): Introduction to Glowstringing/Poi",
        "short_name":  "STUCO: GLOWSTRINGING",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Often seen in raves and music festivals, glowstringing is the art of dancing with glowsticks or other luminescent objects on a string by swinging them in the air, hitting them against your body, and performing other tricks and manipulations. In this StuCo, you can expect to learn many of the fundamentals of glowstringing, along with a simple choreography that you can use to put on a show for friends, family, or strangers.   Although this course is targeted towards beginners with no experience, people of all skill levels will have something to learn.  Class sessions are workshopbased but highly individualized. Everyones learning pace is different and the pacing of the course will be adjusted based on overall learning speed of the class.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "The ability to spin poi improvising to music as well as choreograph their own poi performances.",
                                                    "key_topics":  "Basic moves for the performance art called Poi or Glowstringing including planes, weaves, flowers, wraps, and partner poi.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Participate and performances. Showing up and learning the taught moves each class as well as having a midterm and a final performance.",
                                                    "relevance":  "People who would like to learn about poi, a pretty niche but beautiful performance art that originated from the Maori tribe in New Zealand but has evolved since, will be able to put together their own poi performances and spin poi by the end of this course.",
                                                    "learning_resources":  "Youtube channels, office hours, hands on experience.",
                                                    "extra_time_commitment":  "Optional personal practice based on your own preferences."
                                            }
}