{
        "code":  "98-388",
        "name":  "Student Taught Courses (StuCo): Introduction to English Syntax",
        "short_name":  "STUCO: INTR ENG SYN",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In this course, we will learn about the syntax of English. Syntax is the study of the rules that dictate how words combine to form sentences in language. We will discuss the syntax of English both from a historical diachronic perspective, e.g. the nowlost V2 word order of Old English and from a contemporary synchronic perspective, compare dialects spoken across various speaker communities, e.g. multiple modal constructions such as We might can go up there next Saturday. where more than one modal verb in this case might and can appear in a single sentence, used in the Southern United States the zero copula of AAVE AfricanAmerican Vernacular English, where certain forms of the copula be can be omitted in certain contexts, e.g. He an expert He is an expert, but not others, e.g. I driving to Amherst Im driving to Amherst the asterisk  denotes ungrammaticality imperatives in Belfast English, where the imperative verb can precede the subject, e.g. Read you that book You read that book, whereas only the opposite word order is permissible in Standard English You read that book We will also compare the syntactic properties of English with those of other languages.  This course also covers the basics of generative linguistics, a widely accepted framework which has been used by linguists to analyze various syntactic phenomena. We will see that many interesting questions can be formulated and studied from a generative linguistic standpoint. We will also touch upon the basics of formal semantics and pragmatics and the socalled syntaxsemantics interface and the syntaxpragmatics interface, i.e. the study of how syntax interacts with semantics and pragmatics. Examples of this are quantifier raising QR and presupposition holes.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}