{
        "code":  "98-301",
        "name":  "Student Taught Courses (StuCo): Taylor Swift Through the Eras",
        "short_name":  "STUCO: TAYLOR SWIFT",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In this class, we will look at Taylor Swifts music career through each of her albums. Each class will cover a different album and a different topic related to that album. We will look at song Taylor Swifts use of personal experiences, literary techniques, and Easter eggs in her songs. We will look into the ways that Taylor swift has been able to change and adapt to society throughout her career including transitioning between different music genres and continuing to create music throughout the pandemic. We will also learn about why Taylor Swift has decided to rerecord her music and learn about the rerecording process. Each class will begin with a discussion. Classes are each 50 mins long and will be lecturediscussion style. During classes, we will listen to a lot of music and watch many music videos to help analyze the songs. There will be a few video assignments throughout the semester as well as a midterm essay and a final project.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will learn how Taylor Swift became such an influential musician, understand how she was able to adapt and stay popular throughout her career, understand the inner workings of the music industry to understand why and how Taylor Swift is rerecording her music, learn how criticism from media has impacted her career, understand the ways Taylor Swift uses her power to advocate for womens rights and the rights of the LGBTQ community, and learn about the ways Taylor Swift has used songwriting as an outlet and understand the techniques she uses to create her songs.",
                                                    "key_topics":  "How Taylor Swift started her music career and how she adapted to changes throughout her career, the literary techniques Taylor Swift uses to create songs, how Taylor Swift uses easter eggs to keep her fans engaged, and why Taylor Swift has decided to rerecord her music and what that process looks like.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "3 hw assignments, a midterm, and a final project",
                                                    "relevance":  "Taylor Swift is an extremely popular artist and I believe many students would be interested in exploring her music career more in depth.",
                                                    "learning_resources":  "Music videos, songs, documentaries, lecture notes.",
                                                    "extra_time_commitment":  "3 hw assignments where people need to watch movies"
                                            }
}