{
        "code":  "98-304",
        "name":  "Student Taught Courses (StuCo): Game Theory Across Disciplines",
        "short_name":  "STUCO: GAMES BEYOND",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Game Theory is the mathematical study of strategic decisionmaking, and it has been found to be a toolbox for studying topics across a wide variety of disciplines. This course is intended to introduce models and applications of Game Theory within a diverse set of fields, including but not limited to  Psychology, Operations Research, Physics, Machine Learning, and International  Relations. This course will analyze results in Game Theory that broke ground in  the 20th century and will study new frontiers of Game Theory within the 21st  century. Topics discussed in the course will include but are not limited to  KLevel Learning, Matching Problems, The PrincipalAgent Model, Evolutionary  Game Theory, Quantum Games, MultiAgent Reinforcement Learning, and Global  Games. No previous experience with Game Theory is required, as we will introduce  rational Game Theory within the first few weeks of the course. While no previous  background in mathematics is required, some familiarity with calculus is  preferred.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}