{
        "code":  "98-336",
        "name":  "Student Taught Courses (StuCo): Introduction to Greek Mythology",
        "short_name":  "STUCO: GREEK MYTHS",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Greek myths have continued to inspire and capture the imagination for thousands of years. This course presents a basic introduction to Greek mythology and the concepts that are essential to understanding mythology. Students in this course will gain an understanding of Greek mythology and the Olympian gods and goddesses through readings and discussions of these ancient stories, both in the context of history and through the lens of modern media.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "We will dive into the world of Mount Olympus and try to answer why the power of storytelling in Ancient Greece had such a lasting impact on future generations, and how we can see manifestations of these stories and the lessons they teach in modern media.",
                                                    "key_topics":  "The Greek Cannon, Significant Greek Myths, The Epic Cycle, Drama and Theatre, History, Religion, Art, Philosophy, Percy Jackson, and more!",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Grades in this course will be participation based. Students will be given an open-note midterm exam testing them on the Greek Mythology content discussed in class and will be graded on effort in answering the questions. Students will complete a final project in the class of their choosing, and projects will be presented the last week of class. Students will be graded on completion of the project and their presentation. An open note final grade on participation may be taken in place of the final project.",
                                                    "relevance":  "Mythology came about as early as the twelfth century BCE in Ancient Greece and was a vital part of Ancient Greco-Roman society. Even today in the 21st century, the stories and lessons of Greek mythology influence and shape modern society. In this class, we will explore every aspect of Greek Mythology, from its stories of creation to the major gods and goddesses and what they represent, and how it has influenced its successors, such as other religions of the world and the arts and theatre.",
                                                    "learning_resources":  "Lecture slides and video clips, articles, and story excerpts that we use in class will be made available.",
                                                    "extra_time_commitment":  "There will be optional reading assigned outside of class, along with an optional final project to be completed outside of class time."
                                            }
}