{
        "code":  "98-379",
        "name":  "Student Taught Courses (StuCo): Neuroscience for Non-Majors",
        "short_name":  "STUCO: NEURO NON-MAJ",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Anybody can learn neuroscience. Whether you are an artist, scientist, writer, philosopher, musician, or anyone else, as long as you are interested in how the mind works, this course is for you. Understanding the processes that determine your consciousness, emotions, reality, perceptions, and the only way you have ever experienced life is immensely powerful and meaningful. This introduction to neuroscience is tailored to accommodate for ANY background. The course will teach fundamental neuroscience concepts. It will also provide an overview of areas in current neuroscience research learning and memory, neurodegenerative and psychiatric diseases, etc., experimental techniques used in neuroscience research, and neuroscience applications in a variety of different fields ranging from science fiction writing to philosophy to artificial intelligence. Instead of a midterm or final exam, there will be two projects that encourage you to use your individual creativity and the unique backgrounds and sets of skills you bring to the course.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}