{
        "code":  "98-503",
        "name":  "Student Taught Courses (StuCo): Jurassic Park: Science, Ethics, and Cinema",
        "short_name":  "STUCO: JURASSIC PARK",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course explores Jurassic Park 1993, The Lost World Jurassic Park 1997, and Jurassic Park III 2001 as both scientific cautionary tales and blockbuster filmmaking achievements. Through an interdisciplinary lens, we will examine the ethical implications of genetic engineering, the portrayal of science and technology in film, and the evolution of the franchises storytelling, themes, and cultural impact.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Understand and critique the scientific concepts of cloning, genetics, and paleontology as portrayed in the films.Evaluate ethical dilemmas surrounding genetic manipulation and corporate responsibility.Analyze the trilogys narrative structure, themes, and cinematic techniques.Compare the films to Michael Crichtons novels and realworld scientific advancements.Discuss the impact of the Jurassic Park franchise on public perceptions of dinosaurs, science, and filmmaking.",
                                                    "key_topics":  "Jurassic Park movies 1, 2 \u0026 3\nCloning/genetic engineering, Chaos theory, ethics, scientific accuracy of the films, effects of the films on pop culture and cinema",
                                                    "prerequisite_knowledge":  "No prerequisite knowledge needed.",
                                                    "assessment_structure":  "Midterm: This will be a short essay to expand on what students have learned. Students will be given three possible prompts to write about and will choose one to write about.\nFinal: Students will have creative freedom to show proof of learning. Possible acceptable projects could be a short essay, presentation, art project, short film, or a different approved format that addresses a course-covered topic. Projects are meant to be expansion pieces on a topic the student is interested in, and can be done in groups or individually.",
                                                    "relevance":  "As an interdisciplinary course, it will appeal to students interested in science, ethics, arts, and cinema. Not only will we discuss pop culture, but these films touch on important topics such as human impact on ecosystems, corporate greed, and the ethical implications of scientific advancements. In-class discussion enables a diverse view of opinions and facilitates learning.",
                                                    "learning_resources":  "Scholarly articles, videos, and the movie clips will be used as resources for learning",
                                                    "extra_time_commitment":  "Extra time commitments include short readings or videos to be watched outside of class to then be applied to group discussions."
                                            }
}