{
        "code":  "98-506",
        "name":  "Student Taught Courses (StuCo): Introduction to Web Development",
        "short_name":  "STUCO: INTRO WEB DEV",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Students will learn the syntax, usage, and applications of HTML, CSS, and JavaScript to create webpages. Students will become familiar with the process of creating and implementing a website from the ground up. The importance of creating semantically correct, wellstructured, and accessible HTML will be emphasized. The core concepts of CSS will be covered, including selectors, specificity, the box model, gridflex, and the importance of CSS in creating a responsive website. Topics of JavaScript that will be covered include accessing the DOM, event handlers, asyncawait, and various browser APIs such as fetch, localStorage, History, and more. As a part of the course, students will progressively work to create a fullyfledged website of their choice, which serves as a final project.Familiarity with programming concepts at the level of 15110 is recommended, but no background knowledge in any one specific language is necessary. We welcome all those interested in web development to give this course a try",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will learn how to read HTML, CSS, and JavaScript code to understand the functionality of an existing website. Students will understand core concepts of web development including semantic correctness, accessibility, requests and responses, and usage of various browser APIs. Students will be able to write wellstructured code in HTML, CSS, and JavaScript to create their own websites.",
                                                    "key_topics":  "This course will cover fundamentals of HTML, CSS, and JavaScript and their usage in building a full-fledged website from scratch.",
                                                    "prerequisite_knowledge":  "Familiarity with programming concepts at the level of 15-110 is recommended, but no background knowledge in any one specific language is necessary.",
                                                    "assessment_structure":  "Students will be assessed through weekly homeworks and a final project. Progress on the final project will serve as a midterm grade.",
                                                    "relevance":  "This course is useful for anyone looking for a practical introduction to web development and those who want to expand their portfolio and knowledge base.",
                                                    "learning_resources":  "There will be slides posted with lecture content as well as other reference materials from the internet when appropriate.",
                                                    "extra_time_commitment":  "There will be weekly homeworks based on lecture content which are estimated to take roughly an hour to complete. Students will also intermittently work on their final project throughout the semester."
                                            }
}