{
        "code":  "98-502",
        "name":  "Student Taught Courses (StuCo): Introduction to Writing Dystopian Fiction",
        "short_name":  "STUCO: DYSTPIA WRTNG",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The beauty of dystopia is that it lets us vicariously experience future worlds  because we still have the power to change our own.  Ally CondieThis course is a genre fiction writing class. We will learn how to write effective stories in the dystopian genre, by exploring themes and tropes in dystopian media and learning how to employ them in our own writing. The study of dystopias will be approached through four units theme, worldbuilding, character, and plot. Classes will be a mix of lecture and discussion, with time for workshopping student work towards the end of the semester. Activities will includeDiscussing and learning about the dystopian genre Reading examples of dystopian fiction Exercises and assignments in creative writing Workshopping each others workStudents will leave the course with an original plan for a Dystopian story. Aside from being super fun, dystopias reflect aspects of our own society and provide space for contemplation, and their study makes us more informed and conscientious people.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course, students will have developed the skill of writing effective dystopian stories. Students will be able to Understand different dystopian themes and how to write theme into a dystopian story Understand different elements that dystopian worlds are comprised of and how to write them Understand different character archetypes, character arcs, and how to create characters for a dystopian story Understand how theme, world, and character interact to create plot Review and evaluate other peoples work in a workshop settingIn the course, students will produce a portfolio of material for their original dystopian story including but not limited to theme statements, worldbuilding descriptions, character sheets, plot outlines.",
                                                    "key_topics":  "Students will gain an understanding of how to write effective dystopian fiction through analyzing examples in media and learning various writing techniques. We will focus on four key topics: theme, worldbuilding, character, and plot.\nTheme: We will explore how different themes are incorporated in social commentary.\nWorldbuilding: We will discuss different elements of worldbuilding, including but not limited to: government, society, and environment.\nCharacters: We will learn how to write complex characters and their arcs. Additionally, we will analyze common character archetypes of the genre.\nPlot: We will learn how to structure and build effective and compelling plots.\nFinally, we will look at how all four key elements interact to create a dystopian story.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Students will be assessed for this course through the midterm and final project, as well as participation in weekly discussions and workshops.\nWorkshop Participation: 15%\nWeekly Participation: 15%\nMidterm Project: 35%\nFinal Project: 35%",
                                                    "relevance":  "This course is designed for anyone who wishes to analyze dystopian media, and create their own dystopian worlds and stories. This is an introductory writing course. We will be teaching craft elements of fiction that are applicable to any genre and level of experience.",
                                                    "learning_resources":  "Students will have access to slides presented during class and other materials via the course Canvas site.",
                                                    "extra_time_commitment":  "The midterm and final project will be assigned as homework. For workshops, students should read material in preparation to give feedback."
                                            }
}