{
        "code":  "98-501",
        "name":  "Student Taught Courses (StuCo): The Art and Science of Origami",
        "short_name":  "STUCO: ORIGAMI",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Origami, far more than the ancient Japanese art of paperfolding, is a very modern art form with many technical and artistic advancements achieved in the last few decades. Despite this, most of the capabilities of modern origami remain unknown to the larger public. This class will serve as an introduction to how origami is practiced in the modern day on the one hand, the technical aspects of how origami bases are created on the other hand, the artistic aspects of how those bases are shaped into finished models. The aim of the class is to display origami as it truly is modern, international, equal parts art and science.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Gain a better appreciation for the depth of modern origami, be encouraged to further explore origami on their own terms",
                                                    "key_topics":  "Common folding maneuvers and how to execute them\nHow to construct an origami base\nHow to shape a base into the finished model\nBasics of model design",
                                                    "prerequisite_knowledge":  "An ability to read origami diagrams will be helpful (but we will still go over this in class)",
                                                    "assessment_structure":  "Weekly attendance and participation in class will count for 50% of the grade, out-of-class homework for another 20%, and a final project for the remaining 30%.",
                                                    "relevance":  "This course is designed to appeal to both scientists and artists by demonstrating a place where they intersect. The course encourages an interdisciplinary attitude in origami and, by extension, all aspects of life, a relevant skill for any student.",
                                                    "learning_resources":  "Online resources and scanned texts will form the bulk of the necessary resources.",
                                                    "extra_time_commitment":  "1-2 hours per week outside of class spent on models/readings"
                                            }
}