{
        "code":  "98-507",
        "name":  "Student Taught Courses (StuCo): Music in Motion",
        "short_name":  "STUCO: MUS N MO",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Do you tap your foot when you listen to music Have you ever thought of something as groovy but cant explain why Do you find yourself wishing you could improve your rhythmic or musical abilities Well thats great if you have, and completely fine if you havent. Music in Motion is a class based around the Eurhythmics style of teaching, which helps students make deeper connections with the music they listen to and interact with. As a movementbased class, this class allows you to internalize the music and feel the feels by moving your body and learning kinesthetically. In each class, students will engage with music, either live or recorded, in various group settings that will invite them to view music differently and engage actively with their peers. Music in Motion is a class environment that encourages play, allows for mistakes, and invites students to make choices about how they interact with the space and people around them.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students by the end of the course will be more proficient in producing accurate rhythms either through clapping, stepping, or singing. Students will gain a deeper appreciation and understanding of music.",
                                                    "key_topics":  "This course will cover a variety of topics in music: rhythm, basic improvisation, conducting, phrasing, and general musicianship.",
                                                    "prerequisite_knowledge":  "No prerequisite knowledge is required. Some music background would be helpful but is unnecessary.",
                                                    "assessment_structure":  "Most assessments will take place in class and be based on students\u0027 capabilities to perform basic rhythmic movements through either clapping, walking, or singing the rhythms. Most assessments will be given in advance so that there is time to rehearse and prepare. A couple of assessments will be related to a student\u0027s ability to recognize rhythms quickly and thus will not be given in advance.",
                                                    "relevance":  "Music is all around us in everyday life. This class teaches students how to appreciate music on a deeper level and helps students\u0027 confidence and ability to create interpersonal relationships.",
                                                    "learning_resources":  "A canvas page will be provided with information for assessments and homework, as well as hints for the homework and suggestions on how to practice the material given in class. I will hold office hours weekly to help answer questions because there are few online resources for the more specific assignments in class.",
                                                    "extra_time_commitment":  "There will be several assignments given outside of class relating to listening to provided simple recordings and the student writing down what they hear. Time should also be dedicated to rehearsing and preparing material given for upcoming assessments."
                                            }
}