{
        "code":  "98-505",
        "name":  "Student Taught Courses (StuCo): Mindful Crafting: Relaxation in the Digital Age",
        "short_name":  "STUCO: MINDFUL CRAFT",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "In a hyperconnected digital world, crafting has emerged as both an online and offline practice that fosters mindfulness, creativity, and community. From diamond painting to digital scrapbooking, this course explores how craftingboth physical and virtualenhances focus, reduces stress, and cultivates mindfulness.Students will engage in handson crafting, explore digital crafting communities YouTube, TikTok, Instagram, Reddit, etc., and study the psychology behind creative flow states through handson projects and inclass discussions. By the end of the course, students will develop their own mindful craft project. Course fee 5",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of this course, students will be able toRecognize the importance of mental wellbeing through mindfulness activities, such as crafting.Analyze the impact of social media on the spread of DIY crafting trends.Explore the cognitive and psychological benefits of handson crafting.Develop and present their own craft projects while incorporating knowledge from class discussions.",
                                                    "key_topics":  "The Role of Crafting in Well-Being\nDigital Crafting \u0026 Online Trends\nThe Psychology of Creativity\nThe Impact of Social Media on Hobbies\nBalancing Online and Offline Creativity\nCrafting for Relaxation vs. Productivity\nThe Evolution of Crafting\nPersonal Reflection \u0026 Growth Through Crafting",
                                                    "prerequisite_knowledge":  "No prior knowledge or experience is required.",
                                                    "assessment_structure":  "Participation, Project, Written Course Reflection",
                                                    "relevance":  "Carnegie Mellon students are often overworked and constantly juggling academic and extracurricular demands. This course provides a structured space to explore crafting as a tool for mindfulness, stress relief, and creative expression. By integrating hands-on activities with discussions on digital trends and well-being, students will learn how crafting can support mental health and enhance overall student well-being.",
                                                    "learning_resources":  "Web pages, AI, anything available on the internet",
                                                    "extra_time_commitment":  "Around 2 hours of extra time commitments every week to complete homeworks and final crafting project."
                                            }
}