{
        "code":  "99-265",
        "name":  "ADDvocate: Anti-Discrimination Dialogue",
        "short_name":  "ADDVOCATE",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The aim of this multidisciplinary course is to establish a firm, educationbased understanding of Diversity, Equity, and Inclusion topics in Pittsburgh, Qatar and Worldwide to enhance students classroom and university experience. This course consists of 9 units to provide students with a thorough overview of DEI topics. Through a series of lectures by subject experts, this course aims to educate and raise consciousness of discrimination, racism and bias in the real world. The course encourages students to critically examine their personal beliefs and opinions about race and discrimination. Students will also evaluate and analyze inequalities and systems of privilege that promote marginalization within key topics such as gender bias in research, discrimination in education, and discrimination practices in the healthcare system. Assessments include lowstakes assignments attached to weekly content and a final advocacy project. This course will also highlight strategies to become an active bystander and advocate for fair treatment in all our communities.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "1. Illustrate greater awareness about ones own culturebound perceptions, assumptions, experiences, and implicit biases2. Offer a safe and constructive space for active recognition, discussion, and engagement with realworld issues3. Educate and raise consciousness of discrimination, racism, and bias both explicit and implicit4. Gain a working knowledge of DEIB scholarship and key perspectives5. Examine and debate how inequalities and systems of privilege contribute to discrimination through biased policy implementation.6. Develop tools to become an active bystander and advocate for fair treatment in CMUQ community and Qatar.7. Create a global citizen cognizant of realworld issues with a greater understanding of and appreciation for diversity and inclusion.",
                                                    "key_topics":  "Understanding Personal Identities. Introducing and defining discrimination and understanding its effects. Slavery, stereotypes, inequalities and systems of privilege. Gender bias in research, discrimination in education, and discrimination practices in the healthcare system. Allyship and Social Justice.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "Attendance \u0026 Participation (20%); Contribution to discussion board (30%); Action plan workbook (30%); Project Showcase (10%); Community Work Showcase (10%)",
                                                    "relevance":  "The aim of this multidisciplinary course is to establish a firm, education-based understanding of Diversity, Equity, and Inclusion topics in Qatar, Pittsburgh and Worldwide to help students become global citizens who are cognizant of these issues. This course encourages students to critically examine race, discrimination, and privilege within key topics relevant to their education and futures.",
                                                    "learning_resources":  "Textbook and Selected readings and videos",
                                                    "extra_time_commitment":  "Students may be requested to attend talks on or off campus."
                                            }
}