{
        "code":  "99-238",
        "name":  "Materials, Energy and Environment",
        "short_name":  "MATERLS ENGY ENVIRON",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "The survival of humans and the advancement of civilization and culture are a result of mankinds continued development of materials. From early times, civilizations with the most advanced materials have dominated the history of warfare and have been responsible for the infrastructural developments that have cradled out societies. As a result, materials have been influential in the trade and commerce between societies and are still to this day, strongly involved in the political, economic and social conflicts worldwide.    Materials do not stand alone in development however, they are a result of, or are influenced by, technological needs and developments. The more advanced the material, the more energy and effort is required for its production. In the US, the production of materials accounts for about 90 of the countrys energy usage. This fact clearly indicates a strong tie between materials and energy, and without energy, technological developments based on material advancement will not occur.    In our world today, the need to provide improved performance, economics and design in consumer goods comes as a direct result of the market conditions established by consumers. Material selection and design therefore is driven by application and consumer needs which implies that the consumer has a large influence on material consumption. Material selection and material usage in turn have major ecological  implications in energy, material resources and direct environmental impact. Awareness of the complicated interaction is paramount for continued development of civilization. With the scale of industrialization that exists on our planet, consideration of  resource management, ethical material selection choices, energy management, and final disposal are all necessary to ensure a sustainable future.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}