{
        "code":  "99-263",
        "name":  "Centering Diversity, Equity, and Inclusion in Course Design \u0026 Teaching",
        "short_name":  "DEI IN TEACHING",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Issues of diversity, equity, and inclusion, commonly referred to as DEI, are becoming more prevalent in discussions about teaching in higher education. DEI not only affects students sense of belonging in the classroom, but also their overall motivation, learning and success in and beyond the classroom and future careers.   Throughout this course, together, we will explore various topics related to DEI, beginning with an exploration of our own identities and those of our students, as well as other factors that influence DEI in the classroom. After understanding how identity influences the teaching and learning, we will learn about various frameworks, research, and evidencebased practices that can be used and applied in the classroom to overcome issues of DEI in classroom climate, course design, and inclass activities. To demonstrate understanding of course concepts, students will participate inclass activities, complete weekly reflections, apply concepts in small homework assignments, and complete a final project proposed by each individual student, to showcase their personal understanding and path related to DEI.   The aim of this course is to prepare students to work in higher education, as educators, policy makers, or curriculum design specialists, to create classrooms that welcome, support, and respond to all students unique backgrounds and experiences. This course is also designed to accommodate students perspectives, interests, and knowledge regarding DEI, as students will have input regarding the the course content and assignments.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}