{
        "code":  "99-231",
        "name":  "Introduction to Environmental Ideas",
        "short_name":  "INTRO ENV IDEAS",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Environmental problems are complex and require insights from both scientific and social perspectives. For example, it is not enough to tackle climate change solely by knowing the science it is also very important to communicate well, and to understand the relevant ethics, economics, policy, and business aspects. Although this course does not explicitly address the example of climate change, this course includes and draws awareness to concepts coming from different disciplines, calling these Environmental Ideas. The course builds competence for students to identify, and name, different approaches for dealing with complex problems of environment and sustainability.  Upon successful completion of this course, students should be able to  Apply social and scientific perspectives to environmental problems  Distinguish among methods for evaluating environmental problems  Identify environmental justice issues within the context of proposed policy solutions and distinguish among impacts on different communities, and different groups of stakeholders, when considering environmental problems and proposed solutions",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}