{
        "code":  "99-360",
        "name":  "IDeATe: E-Textiles",
        "short_name":  "IDEATE: E-TEXTILES",
        "units":  1.0,
        "min_units":  1.0,
        "max_units":  1.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "PLEASE NOTE The specific meeting dates for the A2 section of this micro course are Saturdays Nov 1, Nov 8, Nov 15, and Nov 22. Electronics and Textiles are both pervasive aspects of our lives. At first they might seem like opposites. One is thought of as rigid, structured, and high tech while the other is viewed as soft, flexible, and one of our oldest technologies. In this workshop students will learn how combining these two opens a world of possibilities. We will cover multiple approaches for robustly constructing soft circuits and sensors as well as the unique challenges associated with adding electronics to a textile and adding flexibility to a circuit. Students will construct several swatches to explore techniques and materials.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "After taking this class, students will be able to Construct a flexible circuit using multiple construction methods Create new samples that integrate electronics and textiles effectively Make design choices that will improve the integration of electronics and textiles",
                                                    "key_topics":  "Soft Circuits, Soft sensors, Sewable Microcontrollers",
                                                    "prerequisite_knowledge":  "No prerequisite Knowledge is required for this course. We will cover all the necessary skills in class.",
                                                    "assessment_structure":  "Students will be assessed on attendance and the completion of a final sample swatch project after class concludes.",
                                                    "relevance":  "E-Textiles is inherently a multidisciplinary field that allows for deeper exploration of both electronics and textiles. Students with interest or a background in either will learn unique ways to apply their knowledge and experience to new situations and materials.",
                                                    "learning_resources":  "Material and tool access during the rest of the semester as well as access to lecture notes on Canvas.",
                                                    "extra_time_commitment":  "Students will construct a sample swatch of their choosing after the course concludes. The intention is for students to attempt an E-Textiles technique we didn\u0027t cover explicitly in class and should take a few hours at most."
                                            }
}