{
        "code":  "99-348",
        "name":  "Global Health and Climate Change",
        "short_name":  "GLBL HLTH CLIMATE CH",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "With each global health crisis, the interconnectedness of populations around the globe becomes more pronounced. Diseases not only affect the health of communities, but they have a profound impact on political, economic, and social stability within countries and regions. This course engages the interdisciplinary nature of global health by approaching the issue through the lens of the Sustainable Development Goals SDG developed by the United Nations. The SDGs range in focus from good health and wellbeing to gender equality to clean water and sanitation to affordable, clean energy. By engaging the ways that health has a stake in these goals, the course will bring the expertise of faculty from the University of Pittsburgh and CMU as well as practitioners to understand and address the issue surrounding global health from a myriad of perspectives and avenues. With an applied focus, the course will assist students in engaging and advocating for a community on a global health issue through a policy memo. This iteration of the course will examine climate change and SDGs 13 and 15.  The course will occur on Friday, Nov. 6th, Saturday, Nov. 7th, and Sunday, Nov. 8th. Engagement in the course should be synchronous accommodations for those in significant time zone differences will be provided to allow enrollment and completion of all elements of the weekend.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}