{
        "code":  "99-344",
        "name":  "Muslims in a Global Context: Muslim Migrations: Pre-Modern Era",
        "short_name":  "MUSLIMS: MIGRATIONS",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "WEEKEND COURSE DATES NOVEMBER 35, 2017 COURSE WEBSITE httpwww.ucis.pitt.eduglobalminicoursemuslimmigration. COURSE LOCATION  UNIVERSITY OF PITTSBURGH, Cathedral of Learning, Room G24.  To intend a journey, is the translation of the Arabic word hajj it describes both the actual trip through space undertaken by millions of pilgrims, and each ones personal, emotional reasons for migrating. Muslim Migrations PreModern Era is one of a twopart series exploring the various contexts in which Muslim individuals and populations have migrated since the first migration from Mecca to Medina to the millions of Muslims on the move in the 21st Century. Whether journeying for the sake of learning, resources, or trade or as the result of war, enslavement, or forced migration, Muslims migrating have had a profound impact around the globe. This multidisciplinary course will explore the social, economic, environmental, and political dimensions of Muslims on the move. In this first 3.0 unit course, we will look at the premodern era from the 7th century to the mid 1800s, considering for example the impact of the hajj as the nucleus of thought, the expulsion of Muslims from Medieval Spain, and the forced migration of African Muslims during the transAtlantic slave trade to the Americas. The second part in the series will consider various migration trajectories in their colonial and postcolonial contexts, examining in particular the impact of WWI and WWII, histories of decolonization, the Cold War contexts, and more recent wars, such as the US invasion in Iraq.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}