{
        "code":  "99-350",
        "name":  "Transforming Cities: Cities and Technology",
        "short_name":  "CITIES: TECHNOLOGY",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Due to economic development and globalization, cities continue to grow with predictions that 70 of the worlds population will live in urban areas by the year 2050. This course, then, will view cities as hubs where patterns, connections, discussions, and the processes shape such issues as social justice, economic development, technology, migration, the environment among others. By examining cities as a lens, this sequence of weekend courses encourages students to examine cities as a system for discussing social processes being built and rebuilt. With an interdisciplinary focus, the course invites experts from the University of Pittsburgh, Carnegie Mellon, and relevant fields more broadly.  This iteration of the course will explore such topics as the influence of multinational corporations on cities the rise of privacy issues in relation to adoption of technology within cities and homes the replacement of human labor and access to employment the role of technology on urban planning, among others.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}