{
        "code":  "99-361",
        "name":  "IDeATe Portal",
        "short_name":  "IDEATE PORTAL",
        "units":  9.0,
        "min_units":  9.0,
        "max_units":  9.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Full descriptions of each section topic are available at httpsideate.cmu.educoursesportalandsectiondetails.html. IDeATe Portal courses introduce students to key aspects of critical, creative, and technical practice and prepare them to engage in productive interdisciplinary Collaborative Studio coursework in IDeATe minor areas. Section A Learning about Learning will provide an introduction to the science of learning. Students will learn about the different ways that people learn, the factors that influence learning, and how to apply this knowledge to their own learning and in designing learning experiences. Section B Intelligent Environments is a handon, projectbased course that introduces students to the issues and challenges of creating workable, affordable, and adaptable intelligent environments. Section C Garments covers the process of design, patterning, and construction of garments or other wearable items  to support creating experimental pieces for the body.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "https://ideate.cmu.edu/courses/portal-and-section-details.html",
        "custom_fields":  {
                                                    "goals":  "Section A Apply scientificallybased principles and practical strategies for educational design Align instruction and assessment designs with explicit goals and learners in context Develop strategies for engaging learners in formal and informal learning contexts Consider contextual factors of learning environments Reflect upon your goals and values as an educational designer Analyze, and suggest ways of improving, specific educational interventions.Section B Experience the principles of team dynamics by participating in and contributing to multidisciplinary design teams Incorporate nontechnical aspects into intelligent systems not just as aesthetic, but as integral, functional components apply an appropriate cultural context to the design of the built environment accept and provide constructive critique throughout the designbuild process create an engaging narrative to promote their ideas tackle challenges to the acceptance of intelligent environments discover how humanspace interaction affects mood, productivity, collaboration, and creativity use automated manufacturing and Arduinobased technology to produce prototypes that operate at the scale of a room and use technical and artistic background to develop successful designs that will enhance the human experience at home, work, and playSection CDevelop skills for conceptualizing, designing, flat patterning, and constructing garments or other wearable items Construct multiple skillbased samples and a finished experimental wearable item or garment Build a knowledge base of wearablebased works through identifying and presenting about garments, costumes, performance art, fashion, and wearable technology Reflect upon and think critically about garments, fashion, and culture as expressed through wearable items Contribute to a critique environment with open responses, constructive criticism, and positive feedback.",
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}