{
        "code":  "99-385",
        "name":  "Technology, Humanity, and Social Justice: Criminal Justice",
        "short_name":  "TECH/HUM/SJ: CRMJUST",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "As humans rely more and more on electronic devices to support their everyday activities, there are ever present warnings about the impacts such reliance has on human autonomy ranging from who owns and controls information networks, the inequitable impact of technology consumption on peoples and places, varying accessibility of technology around the globe, and the promises and limitations of technology in improving human health. By engaging in technology as a lens, this sequence of weekend microcourses encourages students to examine technology as a system disproportionately impacting humanity by enabling and constraining human rights of groups of people around the globe. With a multidisciplinary focus, the course invites researchers and practitioners from the University of Pittsburgh, Carnegie Mellon, and relevant fields more broadly.  In Spring 2024, the focus will be on the impact technology has on criminal justice. This will include a discussion about technologys impact on human safety, including the increasing use of machine learning, artificial intelligence, and other technology by various authorities of the criminal justice system. This will include discussions on the benefits and risks in the implementation and automation of such technology within criminal justice apparatuses. We will also consider how such implementation differs across global criminal justice systems, including how this technology is governed.  Added Note The course will occur on Friday, Mar. 22, Saturday, Mar. 23, and Sunday, Mar. 24. Engagement in the course should be synchronous accommodations for those in significant time zone differences will be provided to allow enrollment and completion of all elements of the weekend. If a student is interested in the course but unable to engage in the course dates, please reach out to Korryn Mozisek kmozisekandrew.cmu.edu.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "By the end of the course, students will be able toIdentify define the characteristics of technologys positivenegative impact on humanity relative to criminal justice. [weekend worksheetsIdentify varying perspectives of stakeholders on issues related to technology and its impact on humanity relative to criminal justice. [weekend worksheetsactivities, planning assignment, final paperCompare disciplinary approaches and perspectives on technology, humanity, and social justice in relation to criminal justice. [weekend worksheets comparison assignmentCompare perspectives of stakeholders on issues related to technology and humanity to understand how this impacts perceptions and actions on the issue, particularly as it is concerned in finding a just resolution. [weekend activities, planning assignment, final paperReflect on the level of influence varying stakeholders have or are denied in shaping actions on the issue of technology, humanity, and criminal justice. [weekend activities, planning assignment, final paperExamine why the perspectives of stakeholders compete with one another, including how this leads to potentially varying impacts on humanity depending on actions and what actions are considered as viable. [weekend activities, planning assignment, final paperPropose recommendations of action on an issue in relation to technology, humanity, and criminal justice that represents the perspectives of stakeholders to develop a resolution. [weekend worksheetsactivities, and final assignmentsSupport proposed recommendations by developing a costbenefit analysis, including how the recommendations harm and benefit the varying stakeholders and its wider societal benefit. [final paper",
                                                    "key_topics":  "Technology, humanity, social justice, criminal justice",
                                                    "prerequisite_knowledge":  "None is necessary. The course is set up to allow easy entrance for any student interested in the topic broadly or narrowly.",
                                                    "assessment_structure":  "Pre-Course \u0026 Post-Course Surveys (5%)\nLecture Worksheets (30%)\nActivity Worksheets (20%)\nFinal Paper Assignments (Planning and Final Document) (45%)",
                                                    "relevance":  "Lectures and activities highlight various interdisciplinary approaches and research related to examine the power of technology on humanity and its implications on social justice as it relates to criminal justice. It provides insight from a variety of researchers and practitioners that students otherwise may not be in contact with.",
                                                    "learning_resources":  "Slides and readings from faculty participants, prior examples from students, assignment descriptions and rubrics will be on Canvas. The weekend will include case study activities and worksheets to aid in the learning of the concepts.",
                                                    "extra_time_commitment":  "Students will be expected to complete various assignments once the weekend is complete. A pre-course survey, viewing of a recorded lecture on the major assignment, and review of the major course assignment are required before the weekend course begins. Other commitments are comparable to a normal course with outside research and preparation of assignments after the weekend."
                                            }
}