{
        "code":  "99-355",
        "name":  "IDeATe: Introduction to Arduino",
        "short_name":  "INTRO TO ARDUINO",
        "units":  1.0,
        "min_units":  1.0,
        "max_units":  1.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "PLEASE NOTE The specific meeting dates for the A1 section of this micro course are Fridays Sep 19, Sept 26, and Oct 3. The specific meeting dates for the A2 section of this micro course are Sundays Nov 2, Nov 9, and Nov 16.This IDeATe micro course aims to demystify the Arduino microcontroller through handson work in the lab creating simple machines with embodied behaviors. The Arduino is a versatile resource for physical projects for students in all disciplines, and this course brings students over the beginners threshold to a basic understanding of the use, terminology, and potential of the Arduino. The skills and concepts taught in this course are presented from an interdisciplinary approach which merges practices in arts and technology. Students learn through a series of asynchronous lectures reinforced by handson activities, and during the final course meeting, each student builds their own original interactive project. The course has no technical prerequisites. Undergraduate students, graduate students, faculty and staff interested in learning new skills in an interdisciplinary environment are all welcome",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  "http://courses.ideate.cmu.edu/99-355",
        "custom_fields":  {
                                                    "goals":  "Students will have a wellrounded introduction to the Arduino microcontroller environment, with an understanding of the basic technical elements software and electronics required to make a simple interactive system with embedded behavior.",
                                                    "key_topics":  "Arduino microcontroller use, basic electronics theory and practice, basic programming in C",
                                                    "prerequisite_knowledge":  "NA",
                                                    "assessment_structure":  "Students must complete four requirements for credit in the course: 1) Attend all three class meetings, 2) Complete the asynchronous learning modules, 3) Get instructor signoff on the final project proposal, and 4) Put forth a sincere effort to build the final project.",
                                                    "relevance":  "NA",
                                                    "learning_resources":  "The bulk of the technical learning in the course is conducted through asynchronous learning video modules that students access via Canvas.",
                                                    "extra_time_commitment":  "NA"
                                            }
}