{
        "code":  "99-358",
        "name":  "IDeATe: Introduction to the Unity Game Engine",
        "short_name":  "IDEATE UNITY3D INTRO",
        "units":  1.0,
        "min_units":  1.0,
        "max_units":  1.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "PLEASE NOTE The specific meeting dates for the A1 section of this micro course are Saturdays Sep 13, Sep 20, and Sep 27. The specific meeting dates for the A2 section of this micro course are Sundays Oct 26, Nov 2, and Nov 9.This course is designed for students with little to no experience working with game engines as an entry point into the field of game development.  Students will learn the basics of the Unity3D engine, and to creatively and effectively build their own simple games.  This course will cover topics such as navigating and using the engine, basic game programming in C, user interface development and introductory game design principles. Students will be assessed based on the functionality of their games and will receive further feedback on their implementation, execution and creativity.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Students will be primed with the skills and knowledge to tackle independent projects in Unity without relying on followalong guides or existing structures. They will get past the initial learning curve into the realm where they can teach themselves more independently.The course is designed to support students of all skill levels and disciplines, and the project is intended to give students the flexibility of focusing on their interests e.g. more on 3D art pipelines, audio systems, game programming, etc.",
                                                    "key_topics":  "This course is about the Unity editor as a tool. Topics covered include a broad set of foundational and underlying concepts to working with the tool, and being able to teach oneself or problem solve with Unity more in the future. Basic computer programming will be covered with a focus on how C# and Unity work together, and programming knowledge is not a barrier to the course.",
                                                    "prerequisite_knowledge":  "While this course covers C# programming, it is designed through the workshop approach, to support students of all skill levels in programming - including none. The workshop is flexibly adapted so that all students are able to engage and learn new elements about Unity, programming, and/or 3D workflows.",
                                                    "assessment_structure":  "The course is evaluated with 4 grade points, each worth 25%. 3 are a participation mark in the 3 course sessions, and the last is an out-of-class final project where the students \"make a game\". With this structure, a 75% or 100% equates to a passing grade.\n\nIn other words, the final project is optional unless a class session was missed. Missing two class sessions (of a total of 3) makes passing impossible.",
                                                    "relevance":  "Students interested in game design, digital arts and technology, film, media arts, VR/AR, Human-Computer interaction, theater, and more will find a real time 3D game engine (such as Unity) to enable or propel future projects in their other disciplines.",
                                                    "learning_resources":  "A comprehensive suite of asynchronous Unity resources has been developed throughout the years of teaching this course. Articles, example projects, videos, and recordings of most (but not all) lecture content are available in some form or another for students independent knowledge reinforcement.",
                                                    "extra_time_commitment":  "The final project is intended to take around 4 hours to complete, with much of that time set aside for research and troubleshooting projects. The minimum requirements are relatively modest, with an expectation that students will take the opportunity to explore their own interests in Unity with the project."
                                            }
}