{
        "code":  "99-346",
        "name":  "Global Health: Maternal and Child Wellness",
        "short_name":  "GLOB HLTH WELLNESS",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "NOTE  THIS IS A WEEKEND COURSE ONLY  November 24, 2018 held on the campus of the University of Pittsburgh.  With each global health crisis, the interconnectedness of populations around the globe becomes more pronounced.  Diseases not only affect the health of communities, but they have a profound impact on political, economic, and social stability within countries and regions.  This course engages the interdisciplinary nature of global health by approaching the issue through the lens of the Sustainable Development Goals SDG developed by the United Nations.  The SDGs range in focus from good health and wellbeing to gender equality to clean water and sanitation to affordable, clean energy.  By engaging the ways that health has a stake in these goals, the course will bring the expertise of faculty from the University of Pittsburgh and CMU to understand and address the issue surrounding global health from a myriad of perspectives and avenues.  With a projectbased focus, the course will assist students engaging and impacting their local community though a global issue.  This iteration of the course will examine food insecurity and malnutrition as a part of the larger discussion on how to ensure healthy lives and promote wellbeing for all at all ages.  SDGs 2 and 3 will be the primary focus of this offering.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  null,
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  null,
                                                    "relevance":  null,
                                                    "learning_resources":  null,
                                                    "extra_time_commitment":  null
                                            }
}