{
        "code":  "99-363",
        "name":  "IDeATe: Spatial Storytelling",
        "short_name":  "IDEATE SPTL STRY",
        "units":  6.0,
        "min_units":  6.0,
        "max_units":  6.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "Spatial Storytelling promotes the use of digital storytelling methods and methodologies across disciplinary topics. In this Spring mini, students are guided through the process from identifying a research problem, collecting data from diverse sources, learning specific geospatial mapping tools, and finally crafting narrative. They will work with spatial information geospatial data to build complex multimodal narratives around social issues. By the end of this course, students will know what are spatial data, how to find and identify different types of spatial data, how to create a story based on data, and how to analyze data in geospatial software. Students will be able to develop constructive critique and data literacy skills to critically review peer work across disciplinary topics. Using competencies gained over the semester, students will create an online interactive narrative and present it to the broader community.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Understand spatial storytelling distinguish different possible narratives and perspectives in stories. Sketch how geography can play a role in storytelling.Distinguish space from place identify and explain the differences between spaceand place, demonstrate the use of space and place to construct a map and composean accompanying narrative that looks at a social issue.Use a variety of technologies to express a story including the use of ArcGIS Online and ESRI StoryMap experiment with these tools to construct basic maps, maps showcasing analysis, and create interactive narrative map integrations.Present to peers plan and deliver a presentation based on selfgenerated content, respond to feedback from peers and instructors and modify their project.Critique stories and themes identify common research narrative structures in a variety of examples including their classmates and their own work, critically evaluate and convey feedback about a classmates work.",
                                                    "key_topics":  null,
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "There are three types of assessments in this course, assignments, in-class storyboards, and the final project and presentations:\nAssignments: There will be six homework assignments during the course. You will be assigned a homework (and the homework from the previous week will be due) on the first day of the class each week. Homeworks will expect you to write an essay or use data and technologies described in the class. The amount of work will be achievable in one week. Some of the in-class work will be designed to help you get started with the homework.\nFinal Project and Presentation: The final project will be the creation of an interactive StoryMap that integrates several geospatial data maps with other forms of media and the presentation of your StoryMap during the last weeks of classes.",
                                                    "relevance":  null,
                                                    "learning_resources":  "Students will need to have access to a laptop. If you do not have access to a laptop, please speak to one of the instructors and we will help provide one. Students will be using ESRI ArcGIS and Storymap tools. Access to the software and licensing will be provided at the beginning of the semester.",
                                                    "extra_time_commitment":  null
                                            }
}