{
        "code":  "99-353",
        "name":  "IDeATe: Design Essentials for Laser Cutting",
        "short_name":  "LASER CUTTING",
        "units":  1.0,
        "min_units":  1.0,
        "max_units":  1.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "PLEASE NOTE The specific meeting dates for the A1 section of this micro course are Saturdays Sep 20, Sep 27, Oct 4. The specific meeting dates for the A2 section of this micro course are Sundays Nov 2, Nov 9, Nov 16.This mini course is designed to get students ready to use a laser cutter. We will cover essential design considerations unique to laser cutting such as material choice, tolerances, available methods of assembly, and techniques for improving cut quality. The bulk of the class time is spent handson learning to design and create a laser cutter ready vector file as well as learning how to safely operate the IDeATe Laser cutters. The primary software we use is Adobe Illustrator, with some time also spent in Photoshop for learning how to integrate raster images like photos and drawings into lasercut objects. Students who complete this course will be able to use the IDeATe facilitys laser cutters on their own for future course work or personal projects.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "After taking this class, students will be able to Safely operate the laser cutters and successfully complete cut, score, and engraving operations.Prepare a vectorbased file for cutting including making minor modifications in Adobe Illustrator.Export and cut parts for 3D objects designed for laser cutting using Fusion 360.Describe some strengths and weaknesses of laser cutting as a tool for artistic, functional, or production pursuits.Identify if some or all of an idea can be made using laser cutting.",
                                                    "key_topics":  "Laser cutter safety, Laser cutter operation, Basic Adobe Illustrator/Photoshop use, Laser cutter joinery methods, Metal engraving with Laser cutters",
                                                    "prerequisite_knowledge":  "No prerequisite knowledge is needed",
                                                    "assessment_structure":  "This course is assessed on attendance only.",
                                                    "relevance":  "Laser cutting is a unique fabrication tool found on college campuses and community makerspaces. Its ability to quickly and accurately cut parts out of flat material as well as engrave text and images makes it invaluable when working on any project involving physical parts. Students will be able to use the learnings from this course on class projects, gifts, art, and more.\nAfter taking this class, students will be able to:\nSafely operate the laser cutters and successfully complete cut, score, and engraving operations.\nPrepare a vector-based file for cutting (including making minor modifications in Adobe Illustrator).\nExport and cut parts for 3D objects designed for laser cutting using Fusion 360.\nDescribe some strengths and weaknesses of laser cutting as a tool for artistic, functional, or production pursuits.\nIdentify if some or all of an idea can be made using laser cutting.",
                                                    "learning_resources":  "Lecture notes on canvas, links to online resources, and links to IDeATe\u0027s official procedures.",
                                                    "extra_time_commitment":  null
                                            }
}