{
        "code":  "99-408",
        "name":  "Get Career Ready: Unlocking Pathways to Success",
        "short_name":  "GET CAREER READY",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  3.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course gives students the skills and knowledge they need to succeed in their chosen careers. By the end of the course, students will set meaningful career goals, create a plan to achieve them, develop their employability skills, and strategically position themselves for success in the competitive job market. Students will also gain insights from professional guest speakers who will share their experiences, perspectives, and industryspecific knowledge.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "Upon completion of the course, students will be able toIdentify and critically examine personal values, interests, and strengths and evaluate how these factors influence their career choices.Reflect and expand knowledge of possible career options, perform expert industry and job market research, and set a plan for growth.Effectively build professional relationships and networks, and use these relationships to advance their careers.Develop a professional brand and create a compelling CVresume and cover letter.Deftly handle an interview and negotiate a job offer competently.",
                                                    "key_topics":  "This course will help students learn about themselves and set career goals, develop the skills and competencies employers are looking for, and improve their overall career readiness to succeed in a competitive job market.",
                                                    "prerequisite_knowledge":  null,
                                                    "assessment_structure":  "There will be assigned readings and exercises, a record of class attendance and participation, and a final project presentation.",
                                                    "relevance":  "The course will enhance students\u0027 career readiness and set them up for success after graduation. Students will understand what competencies are valued by employers and focus their personal and professional growth in the areas that will give them a competitive edge.",
                                                    "learning_resources":  "Career Readiness Canvas course, Focus2Career assessment, selected TEDTalks, and LinkedIn Learning videos",
                                                    "extra_time_commitment":  "A company visit as part of experiential learning."
                                            }
}