{
        "code":  "99-430",
        "name":  "General Studies Capstone Course",
        "short_name":  "GENERAL STUDY CAP",
        "units":  3.0,
        "min_units":  3.0,
        "max_units":  11.0,
        "prereqs":  {
                                        "text":  ""
                                },
        "co_reqs":  [

                                ],
        "anti_reqs":  [

                                    ],
        "equiv":  [

                            ],
        "long_desc":  "This course is a series of modules with guided activities to enable students to reflect on and synthesize their academic course of study. The activities will include reflective exercises, feedback from faculty, mock interviews, and speakers from CPDC and recent graduates who have followed similar, successful academic paths. Under the guidance of a faculty advisor, a student may undertake a reflective project that synthesizes the students academic coursework and educational experience at Carnegie Mellon. The project can be written, oral, visual, audio, or other means of artistic expression approved by the faculty advisor. The course will be offered through Canvas and in person. Each semester, the course will be facilitated by an instructor from the General Studies oversight committee in conjunction with the students academic and project advisors. Additionally, students will regularly meet individually with the course instructor in person or through Zoom.  Registration by special permission.  This course is for students who have declared a general studies major. Students should contact the instructors for permission to enroll.",
        "student_sets":  [
                                                {
                                                        "id":  896,
                                                        "name":  "undergraduate"
                                                }
                                        ],
        "website":  null,
        "custom_fields":  {
                                                    "goals":  "At the end of the course students should be able to1 Demonstrate effective oral and written communication.2 Reflect on and synthesize documentation summarizing the work that theyve done in their undergraduate career.3 Develop a professional portfolio to showcase themselves above and beyond a CVresume.4 Communicate about their strengths and achievements to an employer.5 Build a community of likeminded individuals and campus resources to support their personal and professional goals.",
                                                    "key_topics":  "Student reflection, student success, professional development",
                                                    "prerequisite_knowledge":  "No prerequisite knowledge is needed.",
                                                    "assessment_structure":  "多\tAttendance: 20%\n多\tParticipation: 20%\n多\tHomework: 30%\n多\tFinal Project: 30%",
                                                    "relevance":  "This course is only available to students in the general studies major. Students should take this course in their final semester as preparation for life after college. The course will support students in defining and describing their undergraduate experience holistically for multiple target audiences.",
                                                    "learning_resources":  "Instructors will provide all materials needed for this course. No textbook is required.",
                                                    "extra_time_commitment":  "Weekly homework helps students prepare for in-class discussions. The class meets for 50 minutes a week. The other 2 units of work are completed outside of class meeting times."
                                            }
}